[
  {
    "front": "【問1　情報セキュリティ】\n\nサイバー攻撃への対策に関する次の記述を読んで，設問に答えよ。\nC社は首都圏に複数の販売店をもつ，中堅の中古車販売会社である。\nC社はS県に複数の中古車販売店舗を展開するP社と業務提携しており，P社の中古車情報もC社の販売管理システムに登録した上で販売を行っている。\n〔C社販売管理システムの概要〕\n販売管理システムは，Webサーバ，アプリケーション(以下，APという)サーバ及びデータベース(以下，DBという)サーバから成り，C社及びP社の販売店は，Webサーバを経由して中古車情報や販売実績の登録を行う。C社の販売店の情報は，C社内のPC(以下，PC-Cという)から，APサーバの販売店情報登録ツール(以下，販売店ツールという)を利用して登録を行う。また，販売管理システムのWebサーバ，APサーバ及びDBサーバ(以下，C社各サーバという)のメンテナンスは，C社の社内システム担当が，社内システム用のPC(以下，PC-Sという)から管理者権限のあるID(以下，特権IDという)でC社各サーバにログインして実施している。\nP社の販売店の情報は，P社従業員が，社内に設置したP社販売店情報登録用のPC(以下，PC-Pという)から，C社内に設置したP社販売店情報登録用のPC(以下，PC-Rという)にリモートデスクトップでログインし，販売店ツールを利用して登録を行う。P社は，P社従業員の自宅PC(以下，自宅PCという)からSSL-VPNを利用して，PC-Pにリモートデスクトップでログインできる環境を構築している。\nC社及びP社のネットワーク構成(抜粋)を図1に示す。\nC社FW1，FW2及びP社FW3の許可ルール(抜粋)を表1に示す。\nC社各サーバにはマルウェア対策ソフトウェアがインストールされている。C社各サーバのデータは，毎日午前0時30分～午前1時30分の間にバックアップを行う。月曜日にデータのフルバックアップを行い，火曜日から日曜日まではデータの差分バックアップを行っている。NASには月曜日を起点として最大7日分のバックアップを1世代分保存しており，次の世代のデータは前の世代のデータに上書き保存される。また，C社各サーバのシステムバックアップもNASに保存している。\nC社及びP社の各PC，各サーバ及びネットワーク機器のログは各機器内部に保存しており，ログのサイズが最大値に達した場合は，最も古い記録から上書きする設定になっている。\nC社の各PC及び各サーバはログインのロックアウトのしきい値を5回に設定している。\n〔セキュリティインシデントの発生〕\nある月曜日の午前9時頃，C社のシステム部門に，C社販売店から販売管理システムが利用できないとの報告があった。システム部門のR主任が販売管理システムを調査したところ，C社各サーバのデータが暗号化されていることが判明した。\nR主任は外部のセキュリティ会社であるU社に連絡してインシデントの調査を依頼した。U社のX氏から\"\n①電磁的記録の証拠保全，調査及び分析\nを行うので，C社内のインターネットと広域イーサネットに接続しているネットワークを遮断した後，全てのPCの使用を停止してください\"との要請があり，R主任は要請に従った。\n〔セキュリティインシデントの調査〕\nX氏から\"PC，サーバ及びネットワーク機器のログを分析した結果，侵入者は次の(1)～(4)の順序で攻撃したことが判明した\"と報告があった。\nインシデントの報告日の午前3時15分に，PC-PからPC-Rにログインした。\nPC-Rと同じパスワードのログインIDがPC-Sに存在していた。PC-Rのログインに利用したパスワードで，PC-Sにリバースブルートフォース攻撃を行い，PC-Sにログインした。\n\"社内システム担当がサーバにログインする際に利用したIDとパスワードを，PC-Sのメモリ上に保存してしまう\"というPC-SのAPソフトウェアの脆弱性を利用して，C社各サーバにログインした。\nC社各サーバのマルウェア対策ソフトウェアのプロセスを強制終了して，ランサムウェアを実行した。\nX氏は\"侵入経路であるP社の機器もC社と同様に電磁的記録の証拠保全，調査及び分析を行う必要があるので，P社へ連絡するように\"とR主任に要請した。\nX氏がPC-P及びP社のネットワーク機器を調査したところ，次の状況が判明した。\nVPNルータには認証に関する脆弱性があった。\n攻撃に利用されたPC-PのIDとパスワードはPC-Rと同一であった。\nPC-PのIDは\"admin\"，パスワードは\"password123456\"であった。\nPC-Pへは\"administrator\"のIDに対して異なるパスワードで約1万回ログインに失敗した後，\"admin\"のIDに対して異なるパスワードで150回ログインに失敗し，151回目でログインに成功していた。\nX氏は\"侵入者はVPNルータの脆弱性を利用して，認証情報を取得した上でVPN接続を行い，PC-Pへ\na\n攻撃を行い侵入した後，\nb\nでPC-Rヘログインした可能性が高い。PC-Pのログインに関する設定がPC-Rと異なっていたので，\na\n攻撃を防げずに侵入されたと推測される。\"とR主任へ報告した。\n〔暫定対応及びシステムの復旧〕\n侵入経路と原因が判明したので，R主任及びP社は次の暫定対応を実施し，C社各サーバのシステム及びデータをバックアップデータから復旧の上，販売管理システムの利用を再開した。\nVPNルータとPC-SのAPソフトウェアに，脆弱性に対応した修正プログラムを適用した。\nPC及びサーバのIDとパスワードを推測が困難で複雑なものへ変更した。\n②今回と同様の攻撃を防御するために，PC-Pの設定を変更した。ただし，パスワードが漏えいし，リバースブルートフォース攻撃を受けた場合は，このPC-Pの設定変更では防御できないおそれがある\nので，PC-Rへのリモートデスクトップでのログインは，P社からの利用申請を受けてC社が許可したときだけ可能とするルールを設けることにした。\n〔U社からC社への報告〕\nU社はC社へ，C社の課題をまとめて報告した。C社の課題(抜粋)を表2に示す。\n〔課題に対する対策〕\nR主任は，課題に対して次の対策案を検討した。\n項番1の対策として，C社に接続するP社のPC及びネットワーク機器の情報をP社から提供してもらい，機器の一覧を作成する。また，P社に運用ルールの作成を依頼し，作成してもらった運用ルールが適切であることを確認する。\n項番2の対策として，R主任を特権ID管理者とし，R主任が許可した場合だけ，特権IDを利用可能にする運用ルールを作成する。また，R主任が許可した場合には，特権IDにワンタイムパスワードを設定し，利用者に払い出す仕組みを導入する。\n項番3の対策として，バックアップデータが暗号化されないように，NASに加えて，\nc\nバックアップに対応したストレージにバックアップデータを保存する。また，バックアップデータは3世代分保存する。\n項番4の対策として，ログサーバを設置し，PC，サーバ及びネットワーク機器の口グを保存する。\n\n【設問1】\n\n本文中の\n下線①\nの調査方法の名称を，片仮名12字以内で答えよ。\n\n【設問2】\n\n本文中の\na\nに入れる適切な字句，本文中の\nb\nに入れる適切なプロトコル名をそれぞれ解答群の中から選び，記号で答えよ。\n\n【設問3】\n\n本文中の\n下線②\nについて，変更した設定項目を，本文中の字句を用いて15字以内で答えよ。また，防御できないおそれがある理由を，\"同一\"という字句を用いて25字以内で答えよ。\n\n【設問4】\n\n〔U社からC社への報告〕について答えよ。\n表2中の\n下線③\nについて，バックアップデータに発生していたおそれがある事象を30字以内で答えよ。\n表2中の\n下線④\nについて，調査ができなくなる理由を20字以内で答えよ。\n\n【設問5】\n\n本文中の\nc\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n---\n【選択肢】\n: HTTP\n: HTTPS\n: RDP\n: SSH\n: 辞書\n: 中間者\n: パスワードスプレー\n: リプレイ",
    "back": "【正解】 デジタルフォレンジックス, オ, ウ, ロックアウトのしきい値, 同一のIDで2回以上ログイン試行しないから (21文字)・同一のパスワードで異なるIDにログイン試行するから (25文字), 暗号化されたデータで上書きされている, 古い記録のログが上書きされるから, ア\n\n【解説】\n解説\n本文中では、X氏は「電磁的記録の証拠保全，調査及び分析を行う」としています。この「電磁的記録の証拠保全・調査・分析」という一連の手続は「デジタルフォレンジックス」と呼ばれます。\nデジタルフォレンジックスは、サイバー攻撃や情報漏えいなどのインシデント発生時に、PC・サーバ・ネットワーク機器等に保存されたデータを収集・保全し、科学的手順で分析して、法的な証拠として活用可能な形で報告する技術・プロセスです。主に次の目的で実施されます。\n証拠保全\nデータが改ざん・消去されないよう、元媒体の状態を厳密に保って保存します。本文中でX氏が要請している「ネットワーク遮断」「PCの使用停止」は、追加被害や証拠の毀損を防ぐための保全措置です\n調査・分析\n操作履歴や通信履歴、削除ファイルの復元等を行い、「誰が・いつ・何をしたか」「原因・侵害範囲」を特定します。本件でも機器のログ分析により、侵入順序や手口が特定されています\n法的活用\n加害者を特定し、法的責任を追及する際には、調査結果を裁判所へ証拠として提出します。民事・刑事を問わず、訴訟における立証に耐える証拠を確保することが目的の一つです\n∴デジタルフォレンジックス\n※デジタル→ディジタル、フォレンジックス→フォレンジクスの表記ゆれは許容されると考えます。\n\n---\n\n解説\n〔\na\nについて〕\nPC-Pへの侵入の痕跡を示すログとして次の2つがあります。\nPC-PのIDは\"admin\"，パスワードは\"password123456\"であった。\nPC-Pへは\"administrator\"のIDに対して異なるパスワードで約1万回ログインに失敗した後，\"admin\"のIDに対して異なるパスワードで150回ログインに失敗し，151回目でログインに成功していた。\n多数のログイン失敗は、同一アカウントに対して多数の候補パスワードを順次試行した痕跡です。\"admin\"に対して151回目という比較的早い段階でログインに成功していること、成功パスワードが\"password123456\"のような「パスワードに選ばれがちな単語＋連番」であることを踏まえると、今回行われたのは「辞書攻撃」と判断できます。\n辞書攻撃は、一般的に使用される単語やフレーズが含まれた辞書リストを用いて、簡単なパスワードを持つアカウントを狙い撃ちするパスワードクラック手法です。ユーザーが容易に推測可能なパスワードを選ぶ場合、この攻撃を受けるリスクが高くなります。一般的な辞書はパスワードでありがちな文字列をリスト化しており、それにはログインに関係する単語（password、login、admin、guestなど）、キーボード配列（qwerty、asdfghjkl、1qaz2wsxなど）と短い数字の組合せが含まれます。本問の事例は、まさに辞書攻撃の典型例と言えます（辞書は「よく使われる順」に並びます）。\n∴\na\n＝オ：辞書\nその他の攻撃手法が選択肢が誤りの理由です。\nキ：パスワードスプレー\n多数のアカウントに対して少数の共通パスワードを試す手法です。本件は一つのIDに対して多数パスワードを連続試行しているため適合しません\nカ：中間者、ク：リプレイ\n盗聴したデータを改ざん・再送して取得済みの認証情報を悪用する攻撃です。本件は多数試行の末に弱いパスワードを当てた事案なので適合しません\n〔\nb\nについて〕\n本文中には、P社従業員がC社内のPC-Rにログインする手順として以下の記述があります。\nP社従業員が，社内に設置したP社販売店情報登録用のPC（PC-P）から，C社内に設置したP社販売店情報登録用のPC（PC-R）にリモートデスクトップでログインし，販売店ツールを利用して登録を行う。\n侵入者は，…PC-Pへ「a：辞書」攻撃を行い侵入した後，\nb\nでPC-Rへログインした可能性が高い\nこの記述より、侵入者は、PC-Pを踏み台にしてPC-Rにリモートデスクトップでログインしたことがわかります。図1中の太線部分が示すように、P社→C社の通信はFW3・FW2を経由して行われています。表1で2つのFWの設定を見ると、PC-P（P社の業務セグメント）からPC-R（C社の業務セグメント）への通信は、TCP/3389（RDP）だけが許可されているため、侵入者が使ったプロトコルは「RDP（Remote Desktop Protocol)」であると特定できます。\nRDPは、離れた場所にあるPCのデスクトップ画面を手元PCへ転送し、遠隔操作を可能にするプロトコルです。RDPは既定でTCP/3389を使用することが広く知られているため、攻撃の標的となりやすいです。\n∴\nb\n＝ウ：RDP\n\n---\n\n解説\n〔設定項目について〕\n下線②の直前には「IDとパスワードを推測困難で複雑なものへ変更した」の記載があるため、IDとパスワード以外の変更を答える必要があります。\n本文中の次の2つの記述に注目します。\nC社の各PC及び各サーバはログインのロックアウトのしきい値を5回に設定している\nPC-P（P社側のPC）のログインに関する設定がPC-Rと異なっていたので，「a：辞書：攻撃を防げずに侵入された\n侵入者は、PC-P上の\"administrator\"のアカウントに対して1万回、\"admin\"に対して151回の試行の末、ログインに成功しています。今回のような攻撃は、C社のPCのようにロックアウト機能（一定回数の失敗でアカウントを一時停止する仕組み）があれば防げるはずですが、突破されたという事実からPC-Pではロックアウトが未設定だったことが読み取れます。\n辞書攻撃や総当たり攻撃といった多数回の試行を前提とする攻撃に対しては、ロックアウトが対策となります。これらを総合すると、PC-Pに実施した設定変更とは「ロックアウトのしきい値」であると判断できます。\n∴ロックアウトのしきい値\n〔理由について〕\nロックアウトを設定した場合でも、リバースブルートフォース攻撃に対しては有効ではない理由が問われています。\n通常のブルートフォースが1つのIDに多数のパスワードを試すのに対し、リバースブルートフォースは同一のパスワードを多数のIDに順番に試す手口です。\nブルートフォース\n：同一のID、多数のパスワード\nリバースブルートフォース\n：同一のパスワード、多数のID\n一般的にロックアウトの回数制限はIDごとに管理されるため、1つのIDにつき1回しか試さないリバースブルートフォース攻撃では、この回数制限が回避されてしまいます（しきい値に到達しない）。このため、ロックアウトの設定ではリバースブルートフォースを十分に防ぐことができません。\n解答には「同一」の字句を含める必要があります。ロックアウトが有効ではない直接的な理由は「同一のIDで2回以上ログイン試行しない」ことですが、リバースブルートフォースの特徴である「同一のパスワードを多数のIDに試す」ことも解答として認められています。\n∴同一のIDで2回以上ログイン試行しないから\n同一のパスワードで異なるIDにログイン試行するから\n\n---\n\n解説\n〔C社販売管理システムの概要〕にはバックアップ運用に関して、以下の記述があります。\nC社各サーバのデータは，毎日午前0時30分～午前1時30分の間にバックアップを行う\n月曜日にデータのフルバックアップを行い，火曜日から日曜日まではデータの差分バックアップを行っている\nNASには月曜日を起点として最大7日分のバックアップを1世代保存しており，次の世代のデータは前の世代のデータに上書き保存される\nこの事例では、月曜日の午前3時15分にランサムウェアの被害が発生しました。バックアップ時点ではデータは暗号化されていなかったため、月曜日のフルバックアップから復旧することで事なきを得ています。しかし、もし攻撃が前日の日曜日に起きていた場合、暗号化されたデータがバックアップされ、それを前の世代のデータに上書き保存していたおそれがあります。C社はバックアップを1世代しか保存していないため、正常なフルバックアップデータが失われ、復旧は困難になっていたと想定されます。\n以上より、ランサムウェアに感染したのが前日だった場合に、バックアップデータに発生していたおそれがある事象とは、「暗号化されたデータでバックアップが上書きされている」ことだと判断できます。\n∴暗号化されたデータで上書きされている\n〔C社販売管理システムの概要〕にはログの記録に関して、以下の記述があります。\nC社及びP社の各PC，各サーバ及びネットワーク機器のログは各機器内部に保存しており，ログのサイズが最大値に達した場合は，最も古い記録から上書きする設定になっている\nこの設定では、短時間に大量のイベントが発生し、各機器のログが容量上限に達した場合、設定に従って古い記録から順に上書きされます。C社ではログは各機器内だけに保存され、外部や長期保管先には退避されないため、過去のログが失われ、原因特定・侵入経路の追跡・被害範囲の把握等ができなくなるおそれがあります。\n表2項番4が指摘しているのは上記のリスクです。したがって、調査ができなくなる理由としては「古い記録のログが上書きされるため」が適切です。\n∴古い記録のログが上書きされるため\n\n---\n\n解説\n〔\nc\nについて〕\nそれぞれのバックアップ手法の意味は以下の通りです。\nイミュータブルバックアップ\n保存後のデータの変更や削除ができないように保護されたバックアップ。Immutableは「不変」を意味する\nインクリメンタルバックアップ\n増分バックアップのことで、前回のバックアップ以降の変更箇所だけを保存する方式\nディファレンシャルバックアップ\n差分バックアップのことで、前回のフルバックアップ以降の累積変更箇所を保存する方式\nマルチプルバックアップ\n同一データを複数の異なる場所や媒体に並行して保管するバックアップ運用方式\n本問ではランサムウェア対策として、バックアップデータが暗号化されないことが要求されています。この目的に合致するのは「イミュータブル」バックアップです。ランサムウェア攻撃を受けた場合でも、イミュータブルバックアップに保存されたデータは影響を受けないため、安全に復旧を行うことができます。\n∴\nc\n＝ア：イミュータブル\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm01.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm01.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問1(情報セキュリティ)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問2　経営戦略】\n\n企業の成長戦路に関する次の記述を読んで，設問に答えよ。\nD社は大手の化学品製造・販売会社である。創業初期はフィルムカメラで使用する映像フイルムや医療診断で使用するX線フィルムなどのフィルム事業を展開していた。20数年前に情報記録方式がアナログからデジタルに変わるという事業環境の変化によってフィルム事業の売上高が激減した。事業の危機に直面したD社は，保有技術を軸にして製品・サービス及び市場を抜本的に見直すことによって事業を拡張してきた。\n現在は，素材関連，映像関連及び医療関連の3事業分野の市場で様々な製品・サービスを展開している。しかし，D社の経営層は，今後の事業環境の変化に対応できるかどうかを懸念していた。そこで，事業環境の変化によって生じる全社の事業リスクに対応するために，更なる安定成長を目標とする中期事業計画を立案するよう経営企画部のB課長に指示した。\n〔D社の成長戦略の振返り〕\nB課長をリーダーとするチーム(以下，戦略策定チー厶という)は，まず過去20数年間のD社の成長戦略とその結果を振り返ることにした。D社では成長戦略を立案する際に，フレームワークとして図1に示す成長マトリクスを用いてきた。このマトリクスは，市場を縦軸に，製品・サービスを横軸にしてそれぞれの軸を既存と新規の領域に分けた四つの象限の戦略から成る。図1において，振返りの開始時点における既存市場をフィルムカメラ関連市場及び医療診断市場とし，既存製品・サービスを映像フィルム及びX線フィルムとした。\n戦略策定チームは，D社が第1象限の戦略に取り組みながら，次のとおり，\n①第2象限及び第3象限の戦略を用いて事業を拡張\nしてきたことを再認識した。\n第2象限では，医療診断市場において，X線フィルムとデジタル画像処理の技術を応用し，新たに医療用画像診断ネットワークサービスを立ち上げた。\n第3象限では，新たな素材関連市場において，映像フィルムの製造で培った技術を応用し，フィルム，シート，膜の形状をした産業用液晶フィルムなどの素材を製造して他メーカーに供給する事業を展開した。\nこれらの成功事例では，D社内の事業間で生産設備や技術を共用することによって，\na\n効果が生まれていた。\n〔成長戦略策定のための環境分析とクロスSWOT分析〕\n過去の成長戦略を把握した戦略策定チームは，次に現在のD社に関する外部環境及び内部環境を整理して分析した。\n外部環境\n素材関連市場では，日本は高い技術力によって個々の市場規模は小さいが海外市場でも高いシェアを占めている。しかし，国際的な競争激化や顧客ニーズの多様化といった事業環境の変化によって，日本の優位性が脅かされつつある。\n映像関連市場では，情報記録方式がアナログからデジタルに変わって様々な映像媒体が出てきているが，技術開発の中心は媒体関連からストリーミングやXR(クロスリアリティ)などのコンテンツ作成・活用関連に移行している。\n医療関連市場では，新しい医療手法が注目され，中でも再生医療市場の拡大が見込まれる。国の主導で再生医療の研究開発と普及促進が行われている。\n世界有数の長寿国になった日本で安心して豊かに暮らすために，健康意識やエイジングケア意識が更に高まっていくと予想される。アクティブシニア層の増加や，中年齢層及び女性層の需要拡大によって，発毛剤などの機能的なヘアケア市場は大きな成長が期待できる。\n内部環境\n前年度のD社全体の売上高に占める事業分野別の売上高の割合は，素材関連事業が5割，映像関連事業が2割，医療関連事業が3割であった。\n素材関連事業の売上高は，従来では量産が困難であった特性や機能を備えた特殊な素材(以下，機能性素材という)の海外市場を含めた取扱高の増大が寄与し，堅調に拡大している。また，自社の最適化された生産プロセスを活用することによって，最先端製品に欠かせない機能性素材を短期間で開発・製造し，顧客ニーズの多様化に対応できている。\n映像関連事業の売上高は，ここ数年間は横ばいで，他の事業分野の成長によってD社全体の売上高に占める割合は減少している。有望なコンテンツ作成・活用関連事業は行っていないので，現時点ではこれ以上の事業拡張は見込めない。\n医療関連事業の売上高は，医療用画像診断ネットワークサービスなどの診断型の事業が大半を占め，ここ数年の伸びは鈍化傾向にあるものの，今後も市場は拡大すると見られ，D社の市場シエアから見ると成長の余地がある。\nD社は現在に至るまで長年にわたって，競合他社と差別化できて事業を進める上で強みになり得るコア技術を維持してきた。現在のコア技術を応用した将来有望な新製品として，フィルムの劣化を防ぐ抗酸化技術を応用した再生医療向け製品，ナノテクノロジーを応用した高機能な発毛剤が挙げられている。\nD社は映像関連事業での実績から全国的に企業知名度が高い。\n戦略策定チームは，これらを基にSWOT分析及びクロスSWOT分析を行った。クロスSWOT分析では，SWOT分析で抽出した外部環境及び内部環境におけるプラス要因及びマイナス要因の組合せをマトリクスで表し，複合的な視点で戦略を立てた。今回の環境分析の結果から一例を挙げると，素材関連市場で日本の優位性が脅かされつつあるとき，\nb\nと\nc\nとの組合せによる戦略を用いることによって，他社と差別化できる最先端の機能性素材を短期間で開発・製造する施策につながる。\n戦略策定チームは，D社が今後も安定成長を続けるために，事業環境の変化による事業リスクを分散・軽減する戦略について図1の第4象限に踏み込んで検討した。その結果，\n②クロスSWOT分析における機会と強みとの組合せによって生まれる戦略から導かれる再生医療事業\nは，従来の診断型の事業とは一線を画す治療型の新たな事業として位置づけられ，将来有望視できると考えた。事業化への大きな課題として，投資資金の確保，及び本格的な事業化までの期間の短縮を挙げた。B課長は，この検討結果を経営層に報告したところ，新たな事業化については多角化戦略を用いて検討を継続するよう指示を受けた。\n〔多角化戦略の検討〕\nその後の検討を経て，戦略策定チームは，再生医療事業と比較すると事業化までに要する期間が短いと予想される\n③新たなヘアケア市場への事業参入を多角化戦略の最初のターゲットに設定した\n。B課長は，D社が発毛剤を主力製品とするヘアケア事業を立ち上げ，ここから多角化戦略を推し進めることによって，事業拡張が見込めるだけでなく，経営層が望んでいる\n④安定成長の実現に寄与できる\nと考えた。\n戦略策定チームは，ヘアケア事業の実現に関する分析を次のように整理した。\nクロスSWOT分析から導き出される，機会と強みとの組合せによる戦略と合致する。\nへアケア市場は成熟している。しかし，D社が得意とする機能性に特長をもつ発毛剤などの製品を揃える強力な競合他社は少ない。D社の高い企業知名度を生かせるので，市場参入の可能性はある。\n発毛剤は医薬品の分類に属しており，今後の治療型の医療事業との\na\n効果が期待できる。\n新規事業の実現には新製品の開発推進，製造プロセスの整備，関連する事業ノウハウの習得，及び経営資源の獲得に要する多額の投資資金と長期の時間が必要である。一方で，事業環境の変化は急速で対応スピードを最も重視する必要がある。\n新規事業が十分に成長するまでには期間を要するので，その間は既存事業も一定の成長を維持する必要がある。\nまた，戦略策定チームは，有限であるD社の経営資源の活用に関して次のとおり考えた。\n将来需要減退が進行する既存事業は選択と集中による事業再編を進め，将来性のある新規事業に資金をはじめとする経営資源を再配分する。\n既存事業では，成長が見込めてD社の優位性が維持できる素材関連事業と医療関連事業に経営資源を集中する。製品開発，M&Aなどの新規事業立上げの投資資金を確保するために，既存事業の再編の施策として\nd\nすることを検討する。\nD社がもっていない技術や事業ノウハウ，設備・人・組織などの経営資源は，事業特性や将来性を見極めながら，\n⑤M&Aなどを通じて外部から獲得することで補う\n。\nB課長は，ヘアケア事業の立上げの提案を盛り込んだ中期事業計画を経営層に報告したところ，具体的な検討を更に進めるよう指示を受けた。\n\n【設問1】\n\n〔D社の成長戦略の振返り〕について答えよ。\n本文中の\n下線①\nについて，D社が過去にこれらの戦略を用いて事業を拡張させてきた内部環境上の最も重要な成功要因は何か。本文中の字句を用いて15字以内で答えよ。\n本文中の\na\nに入れる適切な字句を5字以内で答えよ。\n\n【設問2】\n\n〔成長戦略策定のための環境分析とクロスSWOT分析〕について答えよ。\n本文中の\nb\n，\nc\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\n下線②\nについて，戦略策定チームが行ったクロスSWOT分析における再生医療事業を導く戦略を，本文中の\"外部環境\"及び\"内部環境\"に記載された字句を用いて35字以内で答えよ。\n\n【設問3】\n\n〔多角化戦略の検討〕について答えよ。\n本文中の\n下線③\nについて，D社がヘアケア事業を立ち上げて多角化する戦略はどれか。適切なものを解答群の中から選び，記号で答えよ。\n本文中の\n下線④\nについて，多角化戦略は，D社の安定成長の実現に対してどのような点で寄与できるか。30字以内で答えよ。\n本文中の\nd\nに入れる既存事業の再編の施策を15字以内で答えよ。\n本文中の\n下線⑤\nについて，戦略策定チームは内部調達ではなく外部から補うことでどのようなメリットを期待したか。本文中の字句を用いて10字以内で答えよ。\n\n---\n【選択肢】\n: 機会\n: 脅威\n: 強み\n: 弱み",
    "back": "【正解】 コア技術を維持してきたこと, シナジー, イ, ウ, 再生医療市場の拡大を見込み，抗酸化技術を応用した製品を開発する, イ, 事業環境の変化による事業リスクを分散・軽減できること, 映像関連事業を売却, 対応スピードの速さ\n\n【解説】\n解説\n本文冒頭では、D社は「保有技術を軸にして製品・サービス及び市場を抜本的に見直すことによって事業を拡張してきた」とあります。これに関連して、〔D社の成長戦略の振返り〕ではその具体的内容が説明されています。\n第2象限では，医療診断市場において，X線フィルムとデジタル画像処理の技術を応用し，新たに医療用画像診断ネットワークサービスを立ち上げた\n第3象限では，新たな素材関連市場において，映像フィルムの製造で培った技術を応用し，フィルム，シート，膜の形状をした産業用液晶フィルムなどの素材を製造して他メーカーに供給する事業を展開した\nこれらはいずれも、既存のフィルム技術を別領域へ応用した事例です。これは単発のひらめきではなく、D社内で長年にわたり研究開発と維持を続けてきた技術資産があったからこそ実行できたことです。D社の成功を支えた根本的な要因は、この技術資産であったことが本文から伺えます。\nこれを踏まえて内部環境分析を見ると、「D社は現在に至るまで長年にわたって，競合他社と差別化できて事業を進める上で強みになり得るコア技術を維持してきた」とあります。これが設問の求める内部環境上の成功要因であると判断できます。したがって、答えは「コア技術を維持してきたこと」となります。\nなお、内部環境上の強みである「D社は映像関連事業での実績から全国的に企業知名度が高い」ことも、スムーズな事業展開を後押しする要因であることは確かです。事業拡張が上手くいった要因の一つではありますが、知名度は主に市場浸透・需要形成を促進する要素であり、コア技術と比べると「最も重要」とは言えないこと、前述した2つの説明内容と適合しないため不適切です。\n∴コア技術を維持してきたこと\n〔\na\nについて〕\n本文中の空欄aは2つあり、それぞれ効果が生じる場面が次のように説明されています。\nD社内の事業間で生産設備や技術を共用することによって，\na\n効果が生まれていた\n発毛剤は医薬品の分類に属しており，今後の治療型の医療事業との\na\n効果が期待できる\nどちらも事業間の結び付きによって追加的な価値が生じるという類似の場面です。複数事業で設備・技術を共用することで、コスト低減や学習効果の向上が生み出される現象は、一般にシナジー効果（相乗効果）と呼ばれます。また、経済学の分野では「範囲の経済」と表現されます。\n文脈上、空欄aの後は「…効果」と続くため、5字以内という条件に合うのは「シナジー（または相乗）」となります。「範囲の経済」効果では日本語として不自然で、「範囲の経済の」効果では字数制限を超えるためです。\nなお、範囲の経済と似た概念として「規模の経済」があります。規模の経済は、同一製品・同一事業の生産量が増えるほど生産が効率化され、平均費用が下がるというスケールメリット（規模効果）が本質です。本事例は複数の事業間の結びつきなので妥当しません。\n∴\na\n＝シナジー\n\n---\n\n解説\n〔\nb\nc\nについて〕\nクロスSWOT分析は、内部環境要因（強み・弱み）に対し、外部環境要因（機会・脅威）をそれぞれ対応させ、置かれた環境に適した戦略を示したものです。\n本文中では、素材関連事業に関する分析結果として以下の記述があります。\n（外部環境）国際的な競争激化や顧客ニーズの多様化といった事業環境の変化によって，日本の優位性が脅かされつつある\n（内部環境）自社の最適化された生産プロセスを活用することによって，最先端製品に欠かせない機能性素材を短期間で開発・製造し，顧客ニーズの多様化に対応できている\n外部環境は国内企業であるD社にとって不利な変化なので「脅威」、内部環境はD社が有する市場に対する優位性なので「強み」に該当します。よって、クロスSWOT分析上、選択すべき戦略は「強み」と「脅威」を組合せによる戦略（S×T戦略）です。これは、空欄の後に差別化戦略に関する説明が続いていることからも確認できます。したがって、空欄b、cに入るのは「イ」「ウ」です。\n∴\nb\nc\n＝イ：脅威、ウ：強み（順不同）\n下線②は「機会と強みとの組み合わせによって生まれる戦略」とあるため、再生医療事業に関し、機会と強みとなっている部分を本文中から確認します。\n（機会）医療関連市場では，…\n再生医療市場\nの拡大が見込まれる。国の主導で再生医療の研究開発と普及促進が行われている\n（強み）現在のコア技術を応用した将来有望な新製品として，フィルムの劣化を防ぐ抗酸化技術を応用した\n再生医療向け製品\n…が挙げられている\nクロスSWOT分析において「強み」と「機会」の組合せによる戦略は「積極化戦略」とされ、自社の強みを活かして外部のチャンスを積極的に取りに行く方針を意味します。本事例の場合、機会である「再生医療市場の拡大」と、強みである「抗酸化技術を応用した再生医療向け製品」を結びつけると、「再生医療市場に再生医療向け製品を投入する」という戦略が自然に導けます。この戦略は、成長マトリクスの多角化（新市場×新製品）の方向性とも合致しています。\n∴再生医療市場の拡大を見込み，抗酸化技術を応用した製品を開発する\n\n---\n\n解説\n新たなヘアケア市場への事業参入がどの類型の多角化に当たるかです。多角化は新規市場に新規製品を投入する戦略ですが、既存市場・既存製品との類似性によって、選択肢にある4つの類型に分類されます。\n戦略ごとの特徴と違いを分かりやすくするために、それぞれについて代表的な例を紹介します。\n集成型\n：リース事業から、不動産・再エネ発電・空港運営・プロ野球球団などへ展開（オリックス）\n集中型\n：写真フィルムで培った材料・画像技術を核に、医療機器・バイオ・化粧品へ展開（富士フイルム）\n垂直型\n：自動車製造から、その下流に位置するローン・リース・保険へ展開（トヨタ自動車）\n水平型\n：カメラで培った光学や機械工学の技術を活かし、プリンター・スキャナー・高性能ネットワークカメラへ展開（キヤノン）\nD社が策定した「ヘアケア市場に発毛剤を投入する」という戦略を、市場と製品の2軸に分けて考えます。「ヘアケア市場」はこれまでD社が展開してきた素材関連、映像関連、医療関連の3つの市場とは異なります。製品については「現在のコア技術を応用した…高機能な発毛剤」とあるので、技術的関連度は高いと言えます。\n市場は新規、製品は技術関連度が高いものなので、該当する類型は「集中型」となります。\n∴イ：集中型多角化戦略\n本文冒頭では、経営層が「今後の事業環境の変化に対応できるかどうかを懸念」していることが示されています。それを受けてB課長に「事業環境の変化によって生じる全社の事業リスクに対応するために，更なる安定成長を目標とする中期事業計画」を指示したという流れです。\nD社の過去の経験が示すように、単一事業への依存は、業界の構造変化に対して極めて脆弱です。一つの収益源が環境変化に適応できなかったとき、企業全体が厳しい経営環境に置かれるからです。別の分野に進出すれば、収益源が複数になるため収益全体の変動が平準化されます。また、業界の構造変化にも強くなります。その結果として企業は安定した成長を目指せるようになります。\n本文では、戦略策定チームが図1の第4象限（多角化）に踏み込んだのは、「D社が今後も安定成長を続けるために，事業環境の変化による事業リスクを分散・軽減する戦略」を検討するためだと明記されています。上記の多角化のメリットを踏まえると、多角化戦略が「安定成長の実現に寄与できる」理由は、本文が示すように「事業環境の変化による事業リスクを分散・軽減できること」にあります。\n∴事業環境の変化による事業リスクを分散・軽減できること\n〔\nd\nについて〕\n空欄dの前段には「既存事業では，成長が見込めてD社の優位性が維持できる素材関連事業と医療関連事業に経営資源を集中する」とあります。この記述より、現在の3事業（素材関連、映像関連、医療関連）のうち、映像関連事業には投資対象から外されることが読み取れます。\n映像関連事業は、媒体関連からストリーミングなどのコンテンツ作成・活用関連の市場に移り変わってきており、D社では「売上高の割合は全体の2割」「有望なコンテンツ作成・活用関連事業は行っていないので，現時点ではこれ以上の事業拡張は見込めない」という状況です。クロスSWOT分析に照らせば、脅威と弱みの組合せなので、専守防衛戦略・撤退戦略を検討すべき分野です。\nD社では資金事業立上げの投資資金を必要としています。事業再編の施策としては、縮小・統合・分社化・売却などがありますが、早期に資金を調達したいという目的から考えれば、事業の売却（事業譲渡）が最も適合します。したがって、答えは「映像関連事業を売却」となります。\n∴\nd\n＝映像関連事業を売却\n本文では「新規事業の実現には新製品の開発推進，製造プロセスの整備，関連する事業ノウハウの習得，及び経営資源の獲得に要する多額の投資資金と長期の時間が必要である」とあり、新規事業を内製することの大変さが示されています。一方で「事業環境の変化は急速で対応スピードを最も重視する必要がある」とあるように、企業を取り巻く外部環境は次々に変化し、事業展開を待ってはくれません。\n今回策定された多角化戦略は、現時点の環境分析結果に基づくものです。有効な戦略が確立できても、事業が展開されるまでに前提とした外部環境が変わってしまえば、その有効性が薄れてしまいます。M&Aであれば、事業立上げに必要な経営資源を一括で取り込むことで、内製でゼロから積み上げるよりも立ち上げるまで時間を短縮することができます。これは「対応スピードを最も重視する」という要請に応えるものです。したがって、答えは「対応スピードの速さ」となります。\n∴対応スピードの速さ\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm02.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm02.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問2(経営戦略)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問3　プログラミング】\n\nスライドパズルを解くプログラムに関する次の記述を読んで，設問に答えよ。\n表1のルールで定義されるスライドパズルについて考える。\n一辺が3マスのスライドパズルの例を図1に示す。\n本問では，一辺のマスの個数が任意のスライドパズルにおいて，ゴールの盤面になるまでの駒の移動回数が最小となる移動方法(以下，最小解という)を一つ求めるプログラムを作成する。\n〔一辺がNマスのスライドパズルの最小解を幅優先探索を用いて求める方法〕\n幅優先探索を行ったときの，スライドパズルの盤面の遷移を，グラフで表現する。開始時点の盤面をルートノード，ある時点の盤面をノード，駒の移動に伴う盤面の遷移をエッジで表現する。また，ゴールの盤面をゴールノードとして定義する。\n幅優先探索で最小解を求める方法を次のように考える。ここで，Nは2以上とする。\n探索対象のノードに対して，移動できる駒ごとにその駒を移動した後のノードを作成して，探索対象のノードの子ノードとし，探索対象のノードは探索済みとなる。このとき，子ノードが表す盤面が既に探索したノード(以下，探索済みノードという)と同じであれば，この子ノードは終端ノードとして，以降の探索は行わない。また，子ノードがゴールノードと同じであれば，最小解が見つかったと判断して探索を終了する。\n〔Nが3の場合の例〕\n一辺が3マスのスライドパズルの最小解を求める過程の例を図2に示す。\n1回目の駒の移動では，ルートノードを探索対象のノードとする。ここでは，移動できる駒が三つあるので，ルートノードから深さが1となる①～③の子ノードを作成し，ルートノードは探索済みノードとなる。ここで，①～③の子ノードに対して，ゴールノードの判定及び終端ノードの判定を行う。\n次に，作成した子ノードで終端ノード以外のノードをそれぞれ探索対象のノードとし，駒の移動にあわせて子ノードを作成する。図2では，①～③のノードから④～⑪の子ノードを作成し，①～③は探索済みノードとなる。ここで，④～⑪の子ノードに対して，ゴールノードの判定及び終端ノードの判定を行う。図2では，盤面が探索済みノードと一致する⑤，⑥及び⑩は終端ノードとなり，以降の探索は行わない。\n以降，(2)で作成したノードの子ノードの作成と，ゴールノードの判定及び終端ノードの判定を繰り返す。図2の⑫は，n回目の移動でゴールノードに至ったことを示している。なお，全てのリーフノードが終端ノードと判定された場合，ゴールの盤面に至る駒の移動方法がないことを意味しているので，その旨のメッセージを出力して探索を終了する。\n次に，配列を用いた盤面の表現方法を図3に示す。ここで，空白マスを表す値は最も大きい駒の数字である8に1を加えた9とする。なお，配列の要素番号は1から始まるものとする。\n〔一辺がNマスのスライドパズルの最小解を求めるプログラム〕\n一辺がNマスのスライドパズルにおいて，開始時点の盤面をランダムに作成し，最小解を求め，開始時点の盤面からの遷移及び駒の移動回数を出力するプログラムを作成する。開始時点からの盤面の遷移を保持する単方向連結リストの要素となるクラス BoardState の説明を図4に，キューを実現するクラス Queue の説明を図5に，リストを実現するクラス List の説明を図6に，プログラムで使用する主な関数を表2に，最小解を求めるプログラムを図7に示す。\n\n【設問1】\n\n図2中の②の盤面を図3に倣って，配列で答えよ。\n\n【設問2】\n\n図7中の\nア\n～\nク\nに入れる適切な字句を答えよ。",
    "back": "【正解】 {{8，6，7}，{2，9，4}，{3，5，1}}, explore_queue.isEmpty(), poll(), direction[i] [1], board_size, direction[i] [2], checkGoal(new_state.board，goal_board), add(new_state), add(new_state.board)\n\n【解説】\n解説\n問われているのは、図2の②の盤面を図3の規則に従って配列で表すことです。\n各子ノードは「探索対象のノードに対して，移動できる駒ごとにその駒を移動した後のノード」です。また、図2の作成過程では「1回目の駒の移動では…ルートノードから深さが1となる①～③の子ノードを作成」とあります。つまり、②はルート盤面から空白マスに隣接する駒のどれかを1手だけ動かした盤面です。\nルートノードは中央下の部分が空白マスとなっており、この空白マスに移動可能な駒は左=\"3\"、上=\"5\"、右=\"1\"の3つです。図2中の1回目の3つの盤面のうち、①は\"3\"を右に移動したもの、③は\"1\"を左に移動したものに対応しますから、残る②は\"5\"を下に動かしたケースだとわかります。\n図3の規則を整理すると、盤面と配列表現の関係は以下のようになっています（空白マスは\"9\"で表すことに注意）。\n②では\"5\"と\"9\"が入れ替わります。規則に従うと、配列表現は\n{{8，6，7}，{2，9，4}，{3，5，1}}\nとなります。\n∴{{8，6，7}，{2，9，4}，{3，5，1}}\n\n---\n\n解説\n空欄アにはwhileループを継続するための条件式が入りますが、プログラム全体の流れを把握してからでないと理解しにくいため、説明は最後に回します。\n〔\nイ\nについて〕\n変数 explore_queue はクラス Queue のインスタンスで、探索対象の盤面データのリストを保持しています。空欄イは\n.\nに続く字句なので、ここにはクラス Queue のメソッドかプロパティが入ります。\n行21の処理では戻り値をBoardState型変数 state に入れているので、Queueの説明（図5）より、戻り値が適合する\npoll()\nと\npeek()\nが解答の候補となります。どちらもキューの先頭要素への参照を返しますが、\npoll()\nが先頭要素を取り出すのに対し、\npeek()\nは参照だけで取り出しは行わないという点が異なります。\nプログラム全体を見ると、他にキューから取り出す処理が存在しないため、ここで先頭要素が削除されなければ、行21では同じ盤面が繰り返し state に格納されてしまいます。これでは一向に探索処理が進みません。したがって、空欄イには取り出しを伴う「poll()」が当てはまります。\n∴\nイ\n＝poll()\n〔\nウ\nエ\nオ\nについて〕\n空欄を含むif文は、新たな盤面 new_state を作成する際の条件となっています。\n本文の動作説明に従うと、子ノードが表す盤面は、空白マスを上下左右のいずれかへ1マス移動することで作成されますが、この際、空白マスの場所によって移動（マス置換え）できる方向が限定されます。\nしたがって、空白マスの移動先が盤面内に収まっていることを確認する処理が必要です。『盤面内で収まっている』をプログラム上で表現すると、行番号・列番号がともに「1以上かつ board_size 以下」となります。行23～26のif文ではこの境界判定を行っています。\nBoardStateの説明（図4）では、盤面における空白マスの位置をメンバ変数 space で保持していることが示されています。space は配列で、[1]が行番号、[2]が列番号です。また、プログラム中では空白マスの移動先の4パターンを保持する変数として、配列 direction が定義されています。行4の説明より、[1]に行番号の増減、[2]に列番号の増減が入っています。\n{{1, 0}, {0, -1}, {-1, 0}, {0, 1}} ⇒ 下、左、上、右\nこの2つのデータを利用すれば境界判定を行うことができます。現在注目している移動パターンは direction[i] で参照できるため、4つある移動パターンの判定を一般化した条件式を考えると、次の4つに整理されます。\nspace[1] + direction[i][1] が 1 以上（上方向）\nspace[1] + direction[i][1] が board_size 以下（下方向）\nspace[2] + direction[i][2] が 1 以上（左方向）\nspace[2] + direction[i][2] が board_size 以下（右方向）\nしたがって、空欄ウには「direction[i][1]」、空欄エには「board_size」、空欄オには「direction[i][2]」がそれぞれ当てはまります。\nなお、行27～32行目では、現在探索中の盤面のコピーを new_state に生成（行27）し、空白マスの位置更新（行28、29）、空白マスと移動先マスの要素を入れ替える（行30～32）ことで、子ノードの盤面を作成しています。\n∴\nウ\n＝direction[i][1]\nエ\n＝board_size\nオ\n＝direction[i][2]\n〔\nカ\nについて〕\n空欄を含むif文がtrueの場合には、関数 printResult により開始時点から盤面の遷移、駒の移動回数を出力され、プログラムは終了しています。本文中の記述と照合すると、これはゴールノードに至った場合の処理であることがわかります。\nゴールノードに至ったかどうかは、表2の関数 checkGoal(b, g) で判定することができます。引数bには「評価対象の盤面」、引数gには「ゴールの盤面配列」を渡します。「評価対象の盤面」には今生成した子ノードの盤面（本文中の「移動できる駒ごとにその駒を移動した後のノード」）である new_state.board を、「ゴールの盤面配列」には行3の createGoal(N) によって生成され保持している goal_board を設定すればよいです。\n∴\nカ\n＝checkGoal(new_state.board，goal_board)\n〔\nキ\nク\nについて〕\n.\nに続く字句なので、ここにはメソッドかプロパティが入ります。戻り値がなく、すでに両変数は行16、18にてコンストラクタで生成済です。したがって、消去法で add メソッドが入ると判断できます。\n本文中ではこの箇所に該当する記述として以下の2つがあります。\n子ノードが表す盤面が既に探索したノード(探索済みノード)と同じであれば，この子ノードは終端ノードとして，以降の探索は行わない\n子ノードがゴールノードと同じであれば，最小解が見つかったと判断して探索を終了\n図7の該当箇所を読むと、新しい状態 new_state を生成した直後にゴール判定を行い，ゴールでなければ\ncheckSameBoard(new_state.board, check_list)\nで探索済と同一の盤面かを確かめています。この判定がfalseなら本文中の「終端ノードではない」に当たるので、この new_state は以降の探索に回すため\"探索待ちリスト\"に追加します。また、その盤面はすでに探索対象となったことをマークするため、\"探索済みリスト\"にも登録する必要があります。これが行38、39で行う処理の位置づけです。\n空欄に入るメソッド名はいずれも add ですが、クラス Queue の引数 st はBoardState型、クラス List の引数 b は盤面を表す整数配列と異なっています。このため適切な引数は以下のようになります。\nexplore_queue.add() ⇒ BoardState型の変数 new_state\ncheck_list.add() ⇒ そのメンバ変数である new_state.board\nしたがって、空欄キは「add(new_state)」、空欄クには「add(new_state.board)」が当てはまります。\n∴\nキ\n＝add(new_state)\nク\n＝add(new_state.board)\n〔\nア\nについて〕\nwhileループを抜けた後は、「ゴールの盤面に至る駒の移動方法がない旨のメッセージを出力」してプログラムは終了します。つまり、空欄には探索継続か終了かを判定する条件が入ります。\nwhileループでは、explore_queue から要素を取り出し、それを基に新たな盤面を生成し、それが終端ノードでなければ explore_queue に追加するという処理を繰り返しています。終端ノードは explore_queue への追加は行われないため、探索が終盤に進むと explore_queue の要素は減っていき、やがて explore_queue は空になります。これが本文中でいう「全てのリーフノードが終端ノードとなった場合」に該当します。\n逆にまだ探索対象が存在するうちは、whileループを継続する必要があります。探索対象が存在するかどうかは、クラス Queue の isEmpty() を使って調べられ、isEmpty() がfalse（＝空でない）であれば探索を続け、true（＝空）になったらwhileループを抜けることになります。したがって、空欄アには「explore_queue.isEmpty()」が当てはまります。\n幅優先探索では「探索候補をキューに入れ、キューが空でない間取り出して展開する」という反復が基本となることを覚えておきましょう。\n∴\nア\n＝explore_queue.isEmpty()\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm03.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm03.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問3(プログラミング)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問4　システムアーキテクチャ】\n\nビルエネルギーマネジメントシステムの非機能要件に関する次の記述を読んで，設問に答えよ。\nE社は，オフィスビルのエネルギー使用量を一元管理するビルエネルギーマネジメントシステム(以下，BEMSという)を開発・運用している企業である。首都圏を中心に複数のオフィスビルを所有しているR社に対して，オンプレミス方式のBEMS(以下，オンプレBEMSという)を運用してきた。最近，R社から\"複数のオフィスビルのオンプレBEMSを統合管理したい\"という要望があり，E社はクラウド方式のBEMS(以下，クラウドBEMSという)を提案することになった。\nオンプレBEMSは，BEMSサーバ，BEMSクライアント及びBEMSゲートウェイで構成され，E社はこれらの設置・運用を行っている。ビル管理員はBEMSクライアント上のWebブラウザを用いてBEMSサーバにアクセスし，BEMSゲートウェイを介して照明機器や空調機器などの制御対象機器の制御や監視を行う。オンプレBEMSは複数のR社オフィスビルに導入されている。\nオンプレBEMSを用いた既存システム(以下，既存システムという)の構成の一部を図1に示す。なお，図1の各R社オフィスビルでは，制御対象機器を接続するビル制御LANと，BEMSサーバやBEMSクライアントを接続するビル管理LANとが既設されており，二つのLANをBEMSゲートウェイで接続している。\nE社は，R社の各オフィスビルに設置している既存システムから，複数のオフィスビルを統合管理できるクラウドBEMSを用いた新システム(以下，新システムという)へ移行する方法を検討した。新システムでは，ビル管理員はR社運用拠点のBEMSクライアントから，E社が別途サービスを提供しているIaaS型クラウドサービス(以下，E社クラウド基盤サービスという)の仮想サーバ上に構築したBEMSサーバを操作し，ファイアウォール(以下，FWという)とBEMSゲートウェイを介して制御対象機器の制御や監視を行う。E社はBEMSサーバ，BEMSクライアント及びBEMSゲートウエイを設置・運用する。FW及びインターネット接続環境はR社が設置・運用する。新システムの構成案の一部を図2に示す。\n〔品質要件の検討〕\nE社は，図2の構成案をR社に提案した。BEMSを新たなビルに導入する場合，既存システムでは，オフィスビルごとにBEMSサーバ，BEMSクライアント及びBEMSゲートウェイをそれぞれ導入する必要があった。一方，新システムでは，FW及びインターネット接続環境をR社が設置・運用すれば，E社がR社オフィスビル側に\na\nを設置することによってBEMSを導入できる。R社が要望した統合管理が実現でき，さらにBEMS導入が比較的容易になることから，R社は新システムへの移行検討の具体化をE社に依頼した。\nE社の提案に対して，R社から次の要望が出された。\n既存システムでは，BEMSサーバをメンテナンスする際に実施する計画停止の頻度が高く不便だったので，新システムでは計画停止の頻度を低くしてほしい。\n既存システムでは，BEMSサーバのハードウェア障害の発生頻度は低いものの，障害発生時のシステム停止時間が長く不便だったので，新システムではできるだけ短くしてほしい。\nE社では，R社からの要望を受けて，既存システム及び新システムの非機能要件を改めて確認し，新システムの構成案を一部見直すとともに，その優位な点を指標を用いて示すことにした。既存システム及び新システムの非機能要件の指標とその指標値の一部を表1に示す。\n表1の項番1について，既存システムではBEMSサーバのメンテナンスのたびに計画停止が必要であった。新システムでは，E社クラウド基盤サービス上でBEMSサーバを仮想サーバとして構築できることを生かして，2台のBEMSサーバを\nd\n構成にすれば，計画停止をなくすことができる。そこで，図2の構成案に対して，E社クラウド基盤サービス上で，BEMSサーバを1台追加する。\n表1の項番2について，既存システムのBEMSサーバのハードウェア障害発生時には，保守サービス会社への連絡，保守員の駆けつけ，障害箇所の確認，ハードウェア交換，バックアップからのデータ復旧，サービスの再開，という手順で回復していた。この手順のうち，BEMSサーバがオフィスビル内に設置されていることに起因して保守員の駆けつけに要する時間が長かったが，新システムではBEMSサーバが配置されるE社クラウド基盤サービスの拠点に保守員が常駐するので，保守員の駆けつけに要する時間は大幅に短縮される。加えて，仮想サーバに障害が発生したときでも速やかにサービスを再開できるように，新システムではE社クラウド基盤サービスの\ne\n機能を活用して構成する。\n〔クラウドサービス障害発生時の新システムへの影響〕\n新システムでは，仮想サーバで構築したBEMSサーバのハードウェア障害発生時の平均サービス回復時間について大幅に短縮できることが確認できたが，E社クラウド基盤サービスに障害が発生した場合の，新システムに対する影響について，R社から説明を求められた。E社クラウド基盤サービスでは，仮想サーバを直接利用する顧客との契約時にサービスレベル合意書(以下，SLAという)を締結しているので，当該SLAの内容を引用して，どの程度の影響が新システムに及ぶかを説明することにした。E社クラウド基盤サービスのSLAの一部を図3に示す。\nE社は新システムで重要な機能を担うBEMSサーバを例として取り上げ，そこで障害が発生した場合の影響について説明する資料を，追加で作成することにした。当該資料には，図3のE社クラウド基盤サービスのSLAの内容に加えて，月間サービス稼働率を満たした場合に月間累積障害時間が\ng\n分以内になることや，\n①月間サービス接働率が99.5%になった場合に減額される金額\nなど，具体的な事例を記載することにした。また，当該資料にはBEMSサーバのハードウェア，ソフトウェア及びネットワークに発生する可能性がある障害の要因を示し，\n②図3のE社クラウド基盤サービスのSLAで保証されない要因\nについて説明を加えることにした。\n\n【設問1】\n\n〔品質要件の検討〕について答えよ。\n本文中の\na\nに入れる適切な構成要素名を図2中から選び答えよ。\n表1中の\nb\n，\nc\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\nd\n，\ne\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n【設問2】\n\n〔クラウドサービス障害発生時の新システムへの影響〕について答えよ。\n図3中の\nf\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\ng\nに入れる適切な月間累積障害時間を分単位で，小数第1位を四捨五入して整数で答えよ。ここで，1か月は30日間とする。\n本文中の\n下線①\nの場合で，サーバの月間利用料金が20万円のときに滅額される金額を円単位で，小数第1位を四捨五入して整数で答えよ。\n本文中の\n下線②\nについて，BEMSサーバに発生する可能性のある障害の要因のうち，E社クラウド基盤サービスのSLAで保証されないものを解答群の中から選び，記号で答えよ。\n\n---\n【選択肢】\n: 移行性\n: 運用・保守性\n: 可用性\n: 性能・拡張性",
    "back": "【正解】 BEMSゲートウェイ, イ, ウ, エ, ク, ア, 22, 900, ウ\n\n【解説】\n解説\n〔\na\nについて〕\nE社が設置する機器は、BEMSサーバ、BEMSクライアント、BEMSゲートウェイです。図2を見ると、既存ではビルごとにあったBEMSサーバとBEMSクライアントは、新システムではクラウドとR社拠点に置かれ、複数のオフィスで共用されます。一方で、BEMSゲートウェイはこれまでと同じくR社ネットワークに置かれています。\n図2中にはBEMSゲートウェイのほかにもいくつかの機器がありますが、図2注記2には「ビル管理LANのL2SW，ビル制御LANのLS2W及び制御対象機器は既設である」、本文中には「FW及びインターネット環境はR社が設置・運用する」とあります。この条件より、E社がR社のオフィスビルに設置すべき機器は「BEMSゲートウェイ」に絞られます。したがって、空欄aには「BEMSゲートウェイ」が入ります。\n∴\na\n＝BEMSゲートウェイ\n非機能要件とは、機能要件以外の要件のことで、可用性、性能・拡張性、運用・保守性、移行性、セキュリティ、システム環境・エコロジーなど、主にシステムの品質に関する要件のことです。\n表1の非機能要件の指標値は、R社から以下2つのの要望を受けて確認されたものです。\n既存システムでは，BEMSサーバをメンテナンスする際に実施する計画停止の頻度が高く不便だったので，新システムでは計画停止の頻度を低くしてほしい\n既存システムでは，BEMSサーバのハードウェア障害の発生頻度は低いものの，障害発生時のシステム停止時間が長く不便だったので，新システムではできるだけ短くしてほしい\n表1項番1の「BEMSサーバのメンテナンスに伴う計画停止の頻度」は、1つ目の要望に対応します。内容はメンテナンス作業に関する要求なので、分類は「運用・保守性」です。また、計画停止が少ないほど運用時間が長くなって稼働率が上がるため「可用性」にも関係します。\n表1の項番2「BEMSサーバのハードウェア障害時のサービス回復時間」は、2つ目の要望に対応します。システムの利用可能時間に関する要求なので、分類は「可用性」です。よって、空欄bには「イ」、空欄cには「ウ」が当てはまります。\n∴\nb\n＝イ：運用・保守性\nc\n＝ウ：可用性\n【補足】\n項番2にある平均サービス回復時間（MTRS：Mean Time To Restore Service）は、サービスマネジメント分野で保守性を測る指標とされています。本問の内容だけだと判断がつきにくく、問題としてはあまり良いとは言えません。IPAの非機能要件グレードでは区分ごとの要求項目を以下のように定義しており、非機能要件の分類から考えると出題の出所はこれだと考えられます。\nここで提示されている8つの選択肢の内容は以下のとおりです。\nCASB（Cloud Access Security Broker）\n組織内のクラウドサービスの利用状況を一元的に可視化・制御し、セキュリティ対策を行うソフトウェア\nRAID5\nデータとパリティビット両方を各ディスクに分散して書き込むことで、信頼性とアクセス性能を高めるストレージ冗長化技術\nVPN（Virtual Private Network）\n認証と暗号技術を利用してインターネット上に仮想的な専用の通信経路を構築し、セキュリティの高い通信を可能にする技術\nアクティブ-スタンバイ\n同じ機能を持つ2台のサーバを用意し、一方は通常稼働している「アクティブ」な状態で、もう一方は待機している「スタンバイ」状態とする方式。アクティブなシステムに障害が発生した場合、スタンバイのシステムが即座に稼働を開始し、サービスの継続性を確保する\nクライアントサーバ\nサービスを利用するクライアントと、サービスを提供するサーバで構成される分散処理システムの方式\nシンクライアント\n端末にはデータやアプリケーションを置かず、サーバ側ですべての情報を管理する方式\nピアツーピア\nネットワーク上の端末同士が対等な立場で、相互にクライアントやサーバの役割を果たしてデータをやり取りする方式\nライブマイグレーション\n物理サーバ上で稼働している仮想マシン（VM）を、稼働させたまま別の物理サーバに差し替え、処理をシームレスに継続させる技術\n〔\nd\nについて〕\n定期メンテナンスそのものの実施は避けられません。適切なメンテナンスを実施しつつ、計画停止をなくすためには、サーバを冗長構成にし保守中でももう一方でシステムが稼働できる仕組みが必要です。空欄dの前には「2台のBEMSサーバで」とあるので、これに該当する構成方式は「アクティブ-スタンバイ」です。\n∴\nd\n＝エ：アクティブ-スタンバイ\n〔\ne\nについて〕\n空欄eの前にある「仮想サーバに障害が発生したときでも速やかにサービスを再開できる」という説明より、「ライブマイグレーション」が該当します。ライブマイグレーションでの切替えはダウンタイムが極めて小さく、移動前の処理やセッションがすべて引き継がれるため可用性を損なうことがありません。\n∴\ne\n＝ク：ライブマイグレーション\n\n---\n\n解説\n〔\nf\nについて〕\n月間サービス稼働率は、サービスを予定している総時間（予定稼働時間）に対して、実際にサービスが稼働した時間（実稼働時間）の割合です。実稼働時間は、予定稼働時間から障害時間を除いた時間なので以下の算式となります。\n月間サービス稼働率＝\n月間総\n稼働\n予定時間－月間累積障害時間\n月間総\n稼働\n予定時間\n空欄fには「ア：稼働」が当てはまります。\n∴\nf\n＝ア：稼働\n〔\ng\nについて〕\n月間サービス稼働率99.95％を満たすために許容される障害時間を求めます。1カ月を30日とみなし、答えは\"分\"で求めることから、\n月間総稼働予定時間＝30×24×60＝43,200（分）\n目標値は99.95％以上であるため、許容される障害時間の割合は「1－99.95％＝0.05％＝0.0005」です。\n月間累積障害時間≦43,200×0.0005＝21.6（分）\n小数第1位を四捨五入するので、正解は「22分」となります。\n∴\ng\n＝22\n図3の「減額対応」には、「月間サービス稼働率が99.95%に満たなかった場合に，SLAに示す稼働率を達成するための稼働時間よりも少なかった稼働時間に相当する利用料金を減額する」とあります。\n月間サービス稼働率が99.95%より少なくなった場合に、月額料金20万円からの減額が発生します。したがって月間サービス稼働率が99.5％の時の返金額は、以下のように計算できます。\nSLAで示す稼働率：99.95％\n実際の稼働率：99.5％\n両者の差異：99.95％－99.5％＝0.45％\n月額料金20万円から、両者の差異である0.45％（＝0.0045）に相当する料金が減額されます。\n200,000×0.0045＝900（円）\n∴900\nBEMSサーバの配置されるE社クラウド基盤サービスは、E社が別途提供しているIaaS型クラウドサービスです。\nIaaS(Infrastructure as a Service)では、ハードウェア（CPU・メモリ・ストレージ）、ネットワークなどの基礎的なコンピュータリソースがサービスの形で提供されます。これらの構成要素および仮想環境を動作させるホストOSや管理用ソフトウェアは事業者の責任で構築・運用され、それに起因する障害はSLAで保証されます。一方、利用者は仮想環境のゲストOS・ミドルウェア・アプリケーションなど、すべてのソフトウェアを自ら導入・管理します。\nクラウドサービスでは、利用者が手を加えられない部分は事業者責任、自由に変更できる部分は利用者責任になるというのが基本的な考え方です。したがって、SLAで保証されないのは、IaaS利用者が管理責任をもつ「ソフトウェアの障害」です。利用者はOSやアプリケーションを自由に変更でき、その結果生じる不具合に関して事業者は制御できないためです。\n∴ウ：ソフトウェアの障害\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm04.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm04.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問4(システムアーキテクチャ)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問5　ネットワーク】\n\n社内LANの障害対応に関する次の記述を読んで，設問に答えよ。\nY社は，従業員約50名の経営コンサルティングサービスを提供する企業である。従業員は会社支給のPCを使用して，Y社のオフィスや自宅などのテレワーク環境で日々の業務を行っている。当該PCには，ディスク暗号化，PC利用時の多要素認証や自宅からY社のオフィスへのSSL-VPN接続などのセキュリティ対策を施している。\nY社のオフィスのLAN(以下，Y社LANという)は，社内LANセグメント(以下，社内LANという)とDMZセグメント(以下，DMZという)で構成され，Y社のオフィス内では，PCは社内LANに接続して利用している。\n社内LANには無線LANのアクセスポイント(以下，無線APという)が設置され，PCは有線LAN又は無線LANで社内LANに接続する。PCのネットワーク関連の設定は，社内LANに設置したDHCPサーバを利用して行われる。社内LANにはプリンタが設置されており，社内LAN上のPCから印刷することができる。\nDMZにはプロキシサーバ，キャッシュDNSサーバ及びファイルサーバが設置されており，社内LAN上のPCはプロキシサーバ経由でインターネットにアクセスしている。業務で使用するファイル類はファイルサーバに保管し，Y社のオフィスやテレワーク環境のPCを使って従業員間でファイルを共有している。\nY社LANは総務部が所管しており，B主任とCさんが日常的な運用管理と障害対応を行っている。Y社のネットワーク構成を図1に示す。また，IPアドレスを固定で割り当てている主な機器のIPアドレスとMACアドレスを表1に示す。\n〔プリンタの印刷障害〕\nある日，従業員から\"社内LAN上のPCからプリンタへの印刷ができない\"という報告が総務部にあった。連絡を受けたCさんが，社内LANに接続していた自身のPC(以下，PC-Cという)からプリンタに印刷を試みたところ，印刷できない状況であった。\nまずCさんはプリンタ本体の管理画面を確認し，プリンタのネットワーク接続に問題がないことや，ネットワークインタフェースのMACアドレス及びIPアドレスに誤りがないことを確認した。PC-Cからプリンタに対してpingコマンドを実行したところ，プリンタからの応答はなかった。\n次にPC-CのARPテーブルの内容を調べてみると，表2のとおりであった。\nCさんは表2を確認して，\n①プリンタに割り当てられているIPアドレスが他の機器に設定されていると判断\nし，従業員全員にPCのIPアドレスを確認するように依頼した。その結果，従業員のDさんから\"自宅のテレワーク環境で会社支給のPCを接続した際にIPアドレスを手動で設定していたが，その設定のまま社内LANに接続した\"との連絡を受けた。DさんのPC(以下，PC-Dという)を確認したところ，手動でIPアドレス\na\nが設定されていた。CさんはPC-DのIPアドレスをDHCPサーバから自動で取得する設定に変更した後，PC-Cからプリンタに印刷できることを確認した。\nCさんは，プリンタの印刷障害への対応状況をB主任に報告した。B主任は，今回の障害への対応策として，\n②社内LANを二つのサブネットに分割してPCとプリンタを別のセグメントに接続する対築\nを検討するようにCさんに指示した。また，セキュリティ対策として，社内LANにPCを接続する際の，MACアドレス認証や認証サーバを用いたIEEE\nb\n認証を導入することの検討と，PCのIPアドレスをDHCPサーバから自動で取得する設定の変更を原則禁止とする旨の社内規程への明記及び従業員への周知をCさんに指示した。\n〔インターネットのアクセス障害〕\nある日，従業員から\"インターネットにアクセスできない\"という多数の報告が総務部にあった。Cさんが原因を調査するために，PC-Cからプロキシサーバ及びキャッシュDNSサーバに対してpingコマンドを実行して疎通確認を行ったところ，いずれも正常な応答が返ってきた。さらに，\nc\nコマンドを実行してキャッシュDNSサーバで名前解決ができるか確認したところ，名前解決はできなかった。\nCさんは，キャッシュDNSサーバのDNSソフトウェアに不具合が発生していると考えて，キャッシュDNSサーバを再起動した。再起動後，名前解決ができるようになり，インターネットへのアクセスが正常化したことを確認した。\nCさんは，インターネットのアクセス障害への対応状況をB主任に報告した。B主任は，今回の障害への対応策として，キャッシュDNSサーバの稼働状況を監視する対策に加えて，\n③キャッシュDNSサーバの不具合時にもインターネットへのアクセスが継続できる対策\nを検討するようにCさんに指示した。\n〔インターネットのアクセス遅延〕\nその後，従業員から\"インターネットへのアクセスがとても遅い\"という報告が総務部にあった。Cさんは，DMZのL2SWにミラーポートを設定して，DMZとインターネットとの間，及び社内LANとDNZとの間に流れている通信パケットを一定時間パケットアナライザーでキャプチャして分析することにした。分析の結果，DMZとインターネットとの間の通信量は少ないが，社内LANとDNZとの間の通信量が非常に多いことが分かった。そこで，社内LANとDMZとの間の送信元と送信先の組合せ別のパケットの割合を整理することにした。整理した結果の一部を表3に示す。\nCさんは表3などを確認して，インターネットのアクセス遅延は，複数の従業員のPCが\nd\nとの間で800Mビット／秒を超える大量の通信を繰り返し実行していることが原因であると判断し，該当する従業員にPCの操作を一時中断するように依頼した。その結果，インターネットへのアクセス速度は平常時と同程度に戻った。\nCさんは，インターネットのアクセス遅延への対応状況をB主任に報告した。B主任は，今回の障害への対応策として，\nd\nと社内LANとの間のトラフィック量を\n④L3SWのSNMPを用いた管理機能を使って監視する仕組み\nや，\nd\nのQoS機能を使って\ne\nを制限する仕組みについて，導入の検討を行うようにCさんに指示した。\n\n【設問1】\n\n〔プリンタの印刷障害〕について答えよ。\n本文中の\n下線①\nについて，Cさんが判断した理由を35字以内で答えよ。\n本文中の\na\nに入れる適切なIPアドレスを答えよ。\n本文中の\n下線②\nについて，サブネットに分割した結果，社内LAN上のPCからプリンタに届かなくなる通信の種類を解答群の中から選び，記号で答えよ。\n本文中の\nb\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n【設問2】\n\n〔インターネットのアクセス障害〕について答えよ。\n本文中の\nc\nに入れる適切な字句を答えよ。\n本文中の\n下線③\nについて，キャッシュDNSサーバのサービス継続に関連して取るべき対策はどれか。最も適切なものを解答群の中から選び，記号で答えよ。\n\n【設問3】\n\n〔インターネットのアクセス遅延〕について答えよ。\n本文中の\nd\nに入れる適切な字句を図1中の機器名で答えよ。\n本文中の\n下線④\nについて，L3SWから運用管理者に通知する際に用いるSNMPの通知機能の名称を答えよ。また，その通知を送信する条件を答えよ。\n本文中の\ne\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n---\n【選択肢】\n: FTP\n: ICMP\n: ブロードキャスト\n: ユニキャスト",
    "back": "【正解】 表2項番3のMACアドレスがプリンタのものと異なっていたから, 192.168.1.21, ウ, エ, nslookup, ウ, ファイルサーバ, SNMPトラップ, トラフィック量が800Mビット／秒を超える, ウ\n\n【解説】\n解説\n本文には「プリンタのネットワーク接続に問題がないことや，ネットワークインタフェースのMACアドレス及びIPアドレスに誤りがないことを確認」とあります。つまり、プリンタ側の設定は表1のとおり、IPアドレス：192.168.1.21、MACアドレス：00-00-5E-00-53-\n63\nで正しいことが前提です。\n障害発生時のPC-CのARPテーブル（表2）を確認すると、プリンタのIPアドレスである 192.168.1.21 に対し、00-00-5E-00-53-\nE4\nというプリンタとは異なるMACアドレスが対応付けられています。PCはARPテーブル（キャッシュ）の対応に従ってイーサネットフレームの宛先MACを決めるため、この保持内容だと、本来プリンタ（00-00-5E-00-53-63）に送られるべき 192.168.1.21 宛の通信が、別の機器（00-00-5E-00-53-E4）に届いてしまうことになります。\nARPテーブルに間違った対応関係が記録されていたという事実は、同一ネットワーク内に同一IPアドレスをもつ複数の機器が存在することを強く示唆します。Cさんは、ARPテーブル内のプリンタに対応するMACアドレスが本来とは異なること、すなわち表2項番3の情報をもとにIPアドレスの重複を判断したと言えます。\n∴表2項番3のMACアドレスがプリンタのものと異なっていたから\n【補足】\n同一IPをもつ複数の機器が存在する場合、ARP要求（ブロードキャストで行われる）に対して、複数台の機器がARP応答を返します。早く届いたほうがARPテーブルに記録されるため、タイミング次第で他の機器のMACアドレスが登録されてしまうことになります。\n〔\na\nについて〕\nCさんは、プリンタに割り当てられているIPアドレスが他の機器に設定されていると判断し、IPアドレスの確認を依頼しています。その結果、PC-Dに「手動でIPアドレス\na\nが設定されていた」と続きます。その後、PC-Dについて、IPアドレスをDHCPサーバから自動で取得する設定に変更したところ、通信障害は解消しています。\nこれらの内容を踏まえると、プリンタのIPアドレス（192.168.1.21）が重複して設定されていた機器は、PC-Dであったとわかります。したがって、空欄aに入るのは「192.168.1.21」です。\n∴\na\n＝192.168.1.21\n【補足】\n図1の注記には「DHCPサーバからは 192.168.1.101～200 のIPアドレスを配布」とあります。プリンタの 192.168.1.21 はこの配布範囲外の\"固定\"として設計されており、本来PCが手動設定する運用は想定されていません。ところがPC-Dが固定値を持ち込んだために、ARPテーブル上で 192.168.1.21 → 別のMACアドレス という矛盾が生じ、プリンタへの通信が届かなくなった、というのが今回の障害の流れです。\n「サブネットに分割する」とは、2つのネットワークの間にL3スイッチ／ルータ（以下、L3機器）を置いて、別々のネットワークセグメントとすることを意味します。同じサブネットに属する端末同士はブロードキャストを相互に受信できますが、L3機器の先にはブロードキャストは届きません。したがって答えは「ウ：ブロードキャスト」です。\nICMPやFTPは特定のIPアドレスを宛先にしたユニキャスト通信なので、L3機器の先にある相手にも問題なく届きます。\nPCとプリンタを別のサブネットに分離すると、PCはプリンタと通信する際、デフォルトゲートウェイであるL3機器にパケットの転送を依頼します。PCがプリンタのIPアドレスについてARP要求をする必要がなくなるため、今回のように同一IPを手動登録したPCが接続されても、ARPテーブルの不整合によるプリンタへの通信障害を防ぐことができます。\n∴ウ：ブロードキャスト\n〔\nd\nについて〕\n選択肢のIEEE規格はそれぞれ次の技術に対応します。\nIEEE 802.11a/n … 無線LAN\nIEEE 802.1Q … タグVLAN\nIEEE 802.1X … LANに接続する端末の認証\n本文中の「社内LANにPCを接続する際の，MACアドレス認証や認証サーバを用いたIEEE\nb\n認証」という文脈より、該当する技術は端末認証を担う「IEEE 802.1X」です。したがって、空欄bに入るのは「802.1X」です。\n∴\nb\n＝エ：802.1X\n\n---\n\n解説\n〔\nc\nについて〕\n空欄cには、Cさんが「キャッシュDNSサーバで名前解決ができるか確認」するために実行したコマンド名が入ります。前段でpingコマンドによる疎通確認が行われているので、pingではありません。\nネットワーク管理でよく使われるツールには以下があります。\nping：宛先への到達可否と遅延（往復時間）を確認\nnslookup：DNSに名前解決を問い合わせ、結果を確認\ntracert：宛先までに経由するルータの一覧と遅延を可視化\narp：IPアドレスとMACアドレスの対応表を表示・更新\nipconfig：端末のネットワーク設定の表示・更新\n今回は、DNSサーバによる名前解決の状態を調べるのが目的なので、該当するツールは\nnslookup\nです。nslookupはDNSサーバに名前解決を要求し、その結果を出力するコマンドラインツールです。したがって、空欄cには入るのは「nslookup」です。\n基本形：nslookup <名前> [DNSサーバ]\n例）nslookup www.example.com 192.168.11.41\n∴\nc\n＝nslookup\nなお、UNIX系PCでは\ndig\nや\nhost\nなどのコマンドも同種の目的で使用されますが、本問では特定OSの使用が明示されていないため、最も一般的な\nnslookup\nという答えが無難です。\n今回のDNSサーバ障害の原因となったのは、DNSサーバソフトウェアの不具合でした。ここで求められているのは、性能を高める方法ではなく、ソフトウェアの不具合が発生してもインターネットアクセスを継続できるようにするための対策です。\n再起動でDNSサービスが復旧したという説明から、原因はDNSサーバの負荷ではなく一時的な障害だったとわかります。CPUを増やしても今回のようなソフトウェア不具合による停止は回避できません。\n「ア」と同様の理由で誤りです。\n正しい。冗長構成にすれば、ソフトウェア障害時のDNSサービスの継続が可能です。キャッシュDNSサーバを二重化し、端末やプロキシに必要な設定をすることにより、片方が故障してももう一方のサーバで名前解決を処理できます。\n再起動するたびに計画停止が発生し、その都度インターネットに接続できなくなります。サービス継続の観点からみて問題外です。\n∴ウ：キャッシュDNSサーバを多重化する。\n\n---\n\n解説\n〔\nd\nについて〕\n図1・表1の情報をもとに、表3中のIPアドレスとY社ネットワークの機器を対応付けると次のようになります。\nパケットの割合が多い組合せは、いずれもファイルサーバ（192.168.11.51）を送信元／宛先とするものとわかります。また、通信の相手は社内LANのPCです。この内容より、複数の従業員のPCとの間で大量の通信を繰り返していた機器は「ファイルサーバ」とわかります。したがって、空欄dに入る機器名は「ファイルサーバ」です。\n∴\nd\n＝ファイルサーバ\nSNMP(Simple Network Management Protocol)は、ネットワーク上のデバイスの情報を取得し、監視するための標準プロトコルです。\nSNMPは管理する側の「SNMPマネージャ」と、管理される側の「SNMPエージェント」から構成されます。SNMPマネージャがネットワーク機器に導入されたSNMPエージェントを通じて情報を収集し、機器の状態の監視や遠隔操作を行うことができます。\n〔名称について〕\nSNMPでやり取りされる主なメッセージは以下のとおりです。\nSNMP Get：エージェントが保持する情報の取得\nSNMP Set：エージェントが保持する情報の更新\nSNMP Trap：エージェントからマネージャへの通知\n特定の条件を満たしたときに、エージェントからマネージャに通知が入るようにするには、Trap（トラップ）メッセージを使います。設問で問われている、L3SWから運用管理者に通知する際に用いるSNMPの通知機能は、この「SNMP Trap」のことです。\n〔条件について〕\n今回のインターネットアクセスの遅延は、「800Mビット／秒を超える大量の通信を繰り返し実行して」いたことが原因だと説明されています。このため原因とされる「800Mビット／秒を超える通信が発生」した際に、管理者に通知する仕組みとするのが望ましいです。管理者はこの通知を受け取った段階で、該当者にPC操作の一時中断を依頼することで、社内全体への影響を防ぐことができます。\n∴名称＝SNMPトラップ（Trap）\n条件＝トラフィック量が800Mビット／秒を超える\n〔\ne\nについて〕\nQoS(Quality of Service)とは通信品質を保証するための技術・手法の総称です。本問では「ファイルサーバのQoS機能」とあることから、ファイルサーバ側で行う通信制御を意味しています。\nファイルサーバがデータを送る相手としては、\"社内LANのPC\"と\"テレワーク環境のPC\"の2つがあります。〔インターネットのアクセス遅延〕に「DMZとインターネットとの間の通信量は少ないが，社内LANとDNZとの間の通信量が非常に多い」とあるように、今回の遅延障害は、2つのうち\"社内LANのPC\"向けの通信で大量のトラフィックが発生したことが原因です。表3を見ると「ファイルサーバ → 社内LANのPC」の通信（18.0%、10.3%、9.2%）が大きな割合を占めており、この仮説が裏付けられています。したがって、この向きの通信を絞ることが効果的な対策となります。\n以上より、ファイルサーバのQoS機能で制限対象とするのは、ファイルサーバから社内LANへのトラフィックと判断できます。\n∴\ne\n＝ウ：ファイルサーバから社内LANへのトラフィック\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm05.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm05.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問5(ネットワーク)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問6　データベース】\n\n販売管理システムの構築に関する次の記述を読んで，設問に答えよ。\nH社は，全国の店舗及びインターネットで釣り具の販売を行っている。これまで販売促進のためにキャンペーンを定期的に実施してきたが，売上に全く結びつかないものもあった。そこで，キャンペーンの機能を強化し，さらにその効率を上げるために，既存の販売管理システムを改修した新しい販売管理システム(以下，新システムという)を構築することになった。\n〔キャンペーンの概要〕\nキャンペーンとは，2週間～3か月間の定められた期間，幾つかの商品に安い売価を設定することで，新規会員の獲得や，他の商品も一緒に購入してもらうことによる売上の向上を目指す活動である。\n新システムで提供するキャンペーンを広報する手段は4種類あり，種別と呼ばれる英字1字で分類される。新システムで提供するキャンペーン種別について，表1に示す。\n各キャンペーンには，目標となる複数の指標と予算を設定し，その実施を複数回に分けて行うことがある。その予算を各種別に配賦する割合を変えることによって目標達成率を上げる工夫が求められる。\nバナー広告とリスティング広告のキャンペーン(以下，Webキャンペーンという)は，キャンペーン単位で広告内容と予算金額を設定してから，Webマーケティングを運営するT社に実施の詳細を委託する。T社からは，広告内容として設定した広告表示位置やキーワードごとに，その広告費用や表示回数，クリック数などの実績を週次で集計したレポートが送付される。\n新システムのE-R図(抜粋)を図1に示す。なお，新システムでは，E-R図のエンティティ名を表名にし，属性名を列名にして，適切なデータ型で表定義した関係データベースによって，データを管理する。\n〔キャンペーン種別ごとの実績の集計〕\n新しいキャンペーンを計画するために，指定したキャンペーンについて，キャンペーン種別ごとの実績として，売上，原価，粗利，実施金額を集計するSQL文を図2に示す。ここで，\":キャンペーン番号\"は指定したキャンペーン番号を表す埋込み変数である。なお，関数COALESCE(A，B)は，AがNULLでないときはAを，AがNULLのときはBを返す。\n〔葉書を送る店舗エリアの見直し〕\n葉書を送る対象となる店舗エリアを，葉書キャンペーンによる会員の購入実績を基に見直すことを考える。対象の店舗における過去1年間に葉書キャンペーンで購入した会員の郵便番号ごとの売上実績数を，売上実績数の降順に出力するSQL文を図3に示す。ここで，\":店舗番号\"は指定した店舗番号を，\":一年前年月日\"は現在から1年前の年月日を表す埋込み変数である。\n〔Webキャンペーン内容の定期的な見直しの検討〕\nWebキャンペーンの効果をより高めるために，T社から送付されるレポートを基に，キャンペーン期間中に広告内容を適宜変更する依頼をT社に出すことを考える。Webキャンペーンの実績を記録するために追加した表の構造を図4に示す。\nレビューを実施したところ，Webキャンペーン実績表は日次で実績を集計する想定になってしまっているので見直す必要がある，との指摘を受けた。\nその後，\n①受けた指摘に対応\nすることで，目的の機能を実装することができた。\n\n【設問1】\n\n図1中の\na\n，\nb\nに入れる適切な属性名及びエンティティ間の関連を答え，E-R図を完成させよ。なお，属性名及びエンティティ間の関連の表記は，図1の凡例に倣うこと。\n(※正誤判定の都合上、主キー属性は{属性名}、外部キー属性は(属性名)と入力してください)\n\n【設問2】\n\n図2中の\nc\n～\ne\nに入れる適切な字句を答えよ。\n\n【設問3】\n\n図3中の\nf\n，\ng\nに入れる適切な字句を答えよ。\n\n【設問4】\n\n本文中の\n下線①\nについて，対応した内容を35字以内で答えよ。",
    "back": "【正解】 店舗エリア郵便番号, →, FROM, LEFT OUTER JOIN, SUM(M.商品個数 * S.商品原価), AND U.キャンペーン種別 = 'H', ORDER BY 売上実績数 DESC, Webキャンペーン実績表の集計粒度を日次から週次に修正する\n\n【解説】\n解説\n〔\na\nについて〕\n店舗エリアエンティティと店舗エリア詳細エンティティが「1対多」の関係をもっていることに注目します。\n1つの店舗が複数もつ要素を本文中から探すと、表1の種別Hの概要に「店舗エリアは，その店舗に来客が見込まれる会員の住居範囲を複数の郵便番号で定めた範囲として定義する」とあります。1つの店舗エリア番号には複数の郵便番号が紐づき、また見直しによる変動があるため、別途店舗エリア詳細エンティティで郵便番号の集合を管理していると考えられます。したがって、郵便番号が空欄aに入る属性となります。\n図1には郵便番号に関連する属性として、店舗エンティティの「店舗郵便番号」、会員エンティティの「会員郵便番号」があり、いずれも「主体＋郵便番号」の形式となっています。単に「郵便番号」としてしまうと区別がつかないため、命名規則に従えば、店舗エリア詳細エンティティがもつ属性は「店舗エリア郵便番号」とするのが妥当です。\n店舗エリア詳細エンティティには店舗エリア番号が同じで、郵便番号が異なる複数の組が存在することになりますから、各組を一意に特定するため、「店舗エリア郵便番号」は主キーとする必要があります。したがって、空欄aには「\n店舗エリア郵便番号\n」が入ります。\n∴\na\n＝\n店舗エリア郵便番号\n〔\nb\nについて〕\n商品エンティティとキャンペーン商品エンティティには共通の値を保持する属性「（キャンペーン）商品番号」があります。この属性「（キャンペーン）商品番号」は、商品エンティティ側では主キーであり、商品を一意に特定します。また、キャンペーン商品エンティティ側では「キャンペーン番号」属性とともに（複合）主キーであり、キャンペーンと商品の組を一意に特定します。\n〔キャンペーンの概要〕に「各キャンペーンには，…，その実施を複数回に分けて行うことがある」とあるように、1つの商品について複数回のキャンペーンを行うことが予定されているため、キャンペーン商品エンティティには同一のキャンペーン商品番号をもつ複数のレコードが存在しえます。よって、商品エンティティとキャンペーン商品エンティティの多重度は「1対多」です。したがって、空欄bには「→」が当てはまります。\n∴\nb\n＝→\n【補足】\nエンティティ間に関係がある場合、片方の主キー属性がもう片方の外部キー属性として存在します。キャンペーン商品エンティティの（複合）主キーは商品エンティティにはなく、逆に商品エンティティの主キーがキャンペーン商品エンティティにあるため、キャンペーン商品エンティティの「キャンペーン商品番号」属性が商品エンティティの主キーである「商品番号」属性を参照する外部キーであることが機械的にわかります。原則として、ある主キーをもつエンティティと、その主キーを外部キーに持つエンティティのカーディナリティ（多重度）は「1対多」です。\n\n---\n\n解説\n図2のSQL文について先に全体像を確認します。()で括られている部分に注目すると、以下の構造になっているとわかります。\n副問合せによる表定義を含み複雑なものに見えますが、実際にはCK、UKの2つの表を結合（ON句）させ、その結果に対しSELECT文を実行しているだけに過ぎません。\n【CKについて】\nキャンペーン実施表から、指定したキャンペーン番号について、キャンペーン種別とその実施金額の一覧を得るものです。\n【UKについて】\n売上表、売上明細表、商品表を結合し、指定したキャンペーン番号について、キャンペーン種別とその合計売上、合計原価の一覧を得るものです。\n〔\nc\nについて〕\n主問合せのSELECT文の直後にあります。SELECT文の基本形は「SELECT 列名など FROM テーブル名」です。主問合せのSELECT文は、CKとUKの結合表を対象としますが、\"SELECT\"と対になる\"FROM\"がないので追加する必要があります。したがって、空欄cには「FROM」が入ります。\n∴\nc\n＝FROM\n〔\nd\nについて〕\n空欄はCKとUKの2つの表の間に位置すること、またON句で両表を結合することがわかっているので、空欄dには結合方法が入ります。すなわち、内部結合（INNER JOIN）、左外部結合（LEFT OUTER JOIN）、右外部結合（RIGHT OUTER JOIN）などのうち、どれが適切かを考えることになります。\n主問合せのSELECT文を見ると、「売上計」や「原価計」がNULLの場合に0へ置き換えるためにCOALESCEが使われています。しかし、UKの副問合せ内だけを見れば、売上明細表の「商品個数」「商品単価」、商品テーブルの「商品原価」がNULLになることはありません。このことから、NULLが発生するのはCKとUKを結合した結果と判断できます。CKとUKとの内部結合であれば、売上計や原価計がNULLにはなり得ないため、この結合は外部結合が必要とわかります。\nまた、本文冒頭に「キャンペーンを定期的に実施してきたが，売上に全く結びつかないものもあった」とあるように、指定したキャンペーンの中には、特定のキャンペーン種別での売上が発生していないものも想定されます。その場合、売上テーブルには該当するレコードが1件も作られません。ここで内部結合にしてしまうと、売上ゼロのキャンペーン種別は結果から抜け落ちてしまい、実施したキャンペーンの実績を確認することができません。\nたとえ売上が発生しなくても、キャンペーン実施表にはそのキャンペーン番号とキャンペーン種別の組が存在しています。売上がなかった種別に関する実績をも結果に出力するためには、実施したキャンペーン種別の一覧であるCKの行をすべて残す必要があり、このためには外部結合が必要です。CKは結合される側の表（左側）となるので、使うのは左外部結合です。したがって、空欄dには「LEFT OUTER JOIN」が入ります（\"OUTER\"は省略可）。\n∴\nd\n＝LEFT OUTER JOIN\n〔\ne\nについて〕\n空欄の直後に\nAS 原価計\nがあるので、空欄eには原価の合計を求める集計関数が入るとわかります。\n空欄eの1つ上では、売上計を求めるのに「売上明細.商品個数と売上明細.商品単価の積」の合計（SUM）が使われています。これをヒントにすると、原価の合計も同様に「商品個数と商品原価の積」を合計すればよいと考えられます。商品個数は売上計と同じく\nM.商品個数\n、商品原価は商品表（別名S）にあるので\nS.商品原価\nを使います。したがって、空欄eには「SUM(M.商品個数 * S.商品原価)」が当てはまります（\"M.\"，\"S.\"は省略可）。\n∴\ne\n＝SUM(M.商品個数 * S.商品原価)\n\n---\n\n解説\n〔\nf\nについて〕\n〔葉書を送る店舗エリアの見直し〕に、図3のSQL文での抽出対象について「❶対象の店舗における❷過去1年間に❸葉書キャンペーンで購入した会員」とあります。WHERE句では\nU.店舗番号 = :店舗番号\nが❶、\nU.売上年月日 >= :一年前年月日\nが❷の要件に対応します。しかし、❸の条件は書かれていないため、空欄fには葉書キャンペーンに絞る条件式が入ります。\n表1から、種別名が「葉書」に対応するキャンペーン種別は「H」であることが確認できます。SQL文に登場する2つのテーブル（売上、会員）のうち、キャンペーン種別列があるのは売上表（別名U）です。したがって、空欄fには「AND U.キャンペーン種別 = 'H'」が当てはまります（\"U.\"は省略可）。\n∴\nf\n＝AND U.キャンペーン種別 = 'H'\n〔\ng\nについて〕\n空欄部はGROUP BY句の後に位置すること、SELECT文を見るとグループ化で指定が必要な列は「会員郵便番号」のみであることから、空欄gにはORDER BYかHAVINGのどちらかが来ると考えられます。\n〔葉書を送る店舗エリアの見直し〕では「売上実績数の降順に出力する」ことが求められています。しかし、図3のSQL文にはこれを満たす文が存在しないため、空欄gにはこれを追加する必要があります。出力順を指定するのはORDER BY句です。\n売上実績数はSELECT句で列名が付けられているので、その列名を指定できます。ORDER BY句では、昇順を指定する場合は\"ASC\"（省略可能）、降順を指定する場合は\"DESC\"を列名の直後につけます。したがって、空欄gには「ORDER BY 売上実績数 DESC」が当てはまります。\n∴\ng\n＝ORDER BY 売上実績数 DESC\n\n---\n\n解説\n受けた指摘というのは「Webキャンペーン実績表は日次で実績を集計する想定になってしまっている」の部分です。\n〔Webキャンペーン内容の定期的な見直しの検討〕からは、T社からのレポートからWebキャンペーン実績を作成するということが読み取れます。〔キャンペーンの概要〕には「T社からは，…実績を週次で集計したレポートが送付される」とあります。レポートは週次の集計単位なのに、それを記録する表が日次（実績年月日）で作られているのは矛盾しています。このため、表の構造を週次に合わせる対応が必要となります。したがって、答えは「Webキャンペーン実績表の集計粒度を日次から週次に修正する」です。\n∴Webキャンペーン実績表の集計粒度を日次から週次に修正する\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm06.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm06.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問6(データベース)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問7　組込みシステム開発】\n\n電動キックボードのシェアリングシステムに関する次の記述を読んで，設問に答えよ。\nG社は，電動キックボード(以下，電動KBという)のシェアリングシステム(以下，本システムという)を開発している。本システムは，利用者に対し，電動KBの貸出し，使用及び返却をさせるものである。本システムを利用する場合には，利用者が事前にスマートフォン(以下，スマホという)に専用アプリケーションプログラム(以下，アプリという)をインストールし，利用者情報を登録して，利用者IDを取得しておく必要がある。電動KBの外観を図1に，本システムの主な構成を図2に，本システムの主な構成要素を表1に示す。\n〔本システムの利用方法〕\n利用開始前の電動KBは，車輪がロックされた状態で，専用の貸出し用及び返却用の駐車スペース(以下，ポートという)に，駐車している。本システムには，複数のポートがあり，各ポートで電動KBの貸出し又は返却を行う。なお，ポート以外の場所では，電動KBの貸出し及び返却を行うことはできない。電動KBの利用手順を表2に示す。\n〔電動KBの状態の遷移〕\n電動KBの状態の遷移を図3に示す。\n〔電動KBの動作概要〕\n電動KBの動作概要を次に示す。\n利用開始前の電動KBは，車輪をロックした待機中状態でポートに駐車している。\n待機中状態で利用者がアプリで\"貸出し\"を選択すると，電動KBはアプリを介した管理サーバからの指示によって車輪のロックを解除して停止中状態になる。\n停止中状態で手押しなどによって0.3km／時以上になると，走行準備状態になる。\n走行準備状態で手押しなどを続けて3km／時以上になると，加速可能状態になる。\n加速可能状態でアクセルを押すと，走行中状態になり次の動作のいずれかを行う。\n現在速度が最高速度未満の場合は，アクセルの操作量に応じて，モーターのトルクの発生を制御する。\n現在速度が最高速度に達した場合は，最高速度表示灯を点灯させ，モーターのトルクを抑制する。\n走行中状態でアクセルを戻すと，加速可能状態になる。\n走行準備状態，加速可能状態，走行中状態で0.1km／時未満が一定時間継続すると停止中状態になる。\n停止中状態で利用者がアプリで\"返却\"を選択したとき，管理サーバは\n(ア)ある情報を確認してから\n，返却の指示を行う。電動KBはアプリを介した管理サーバからの指示によって車輪をロックし，待機中状態になる。\n状態に関係なく，ブレーキレバーを握ると，機械的にブレーキが掛かる。\n〔本システムで使用する主なメッセージ〕\n本システムで使用する主なメッセージを表3に示す。\n〔電動KBの制御部のソフトウェア構成について〕\n電動KBの制御部では，リアルタイム0Sを使用する。制御部の主なタスクの処理概要を表4に示す。\n\n【設問1】\n\n電動KBを手押しからアクセルを押して加速した後，アクセルを戻して惰性で走行したときの状態の遷移を解答群の中から選び，記号で答えよ。\n\n【設問2】\n\n〔電動KBの状態の遷移〕及び〔電動KBの動作概要〕について答えよ。\n図3中の\na\nに入れる適切な条件を答えよ。\n下線(ア)\nについて，ある情報には車体ID及び利用者ID以外に何があるか。本文中の字句を用いて答えよ。なお，スマホと電動KB間はBLE通信が安定的に行える状態である。\n\n【設問3】\n\n電動KBの制御部の主なタスクについて答えよ。\n表4中の\nb\nに入れる適切な電動KBの状態を図3中の字句で，表4中の\nd\nに入れる適切なタスク名を表4中のタスク名でそれぞれ答えよ。\n表4中の\nc\nに入れる適切な情報を答えよ。\n\n【設問4】\n\n電動KBの貸出し・返却の処理について答えよ。\n利用者が電動KBを借りる処理において車輪のロック解除が失敗なく正常に行われた場合に，送受信されるメッセージの流れについて，\ne\n～\ng\nに入れる適切なメッセージ名を解答群の中から選び，記号で答えよ。\n\"貸出し要求\"→\"貸出し指示\"→\"\ne\n\"→\"\nf\n\"→\"\ng\n\"\n利用者がアプリで\"返却\"を選択した後，電動KBは1回目では車輪のロックに失敗し，2回目で車輪のロックに成功した。管理サーバが結果を受信するまでの処理について，次の①及び②に要する時間は何秒かそれぞれ答えよ。答えは小数第3位を四捨五入して，小数第2位まで求めよ。\nここで，管理サーバとアプリ間で一つのメッセージ通信には200ミリ秒掛かり，アプリと電動KB間で一つのメッセージ通信には10ミリ秒掛かるものとする。また，電動KBの車輪をロックする処理に成功した場合1秒，電動KBの車輪をロックする処理に失敗した場合1秒，メッセージ再送までに0.5秒掛かり，その他の管理サーバ，アプリ，電動KBの処理時間は無視できるものとする。\nアプリで\"返却\"を選択してから，管理サーバから\"返却指示\"メッセージを受信するまで\nアプリが，\"返却指示\"メッセージを受信してから，結果が成功の\"車輪ロック応答\"メッセージを受信するまで\n\n---\n【選択肢】\n: -ア　走行準備→加速可能イ　走行準備→加速可能→走行中ウ　走行準備→加速可能→走行中→加速可能エ　走行準備→加速可能→走行中→加速可能→走行準備",
    "back": "【正解】 ウ, 0.1km／時未満が一定時間継続, 位置情報, 停止中, メイン, 電動KBの状態, エ, オ, ア, 0.40, 2.54\n\n【解説】\n解説\n利用者が手押しで速度を上げ、アクセルで加速し、その後アクセルを戻して惰性走行する一連の流れに対し、電動KBの状態がどう遷移するかを本文の仕様に沿ってたどります。\n設問の文章に記載されている操作は、次の3つに分解することができます。\n電動KBを手押しする\nアクセルを押して加速する\nアクセルを戻して惰性で走行する\nまず、手押しで速度が上がったときの遷移です。〔電動KBの概要〕には以下の記述があります。\n停止中状態で手押しなどによって0.3km／時以上になると，走行準備状態になる\n走行準備状態で手押しなどを続けて3km／時以上になると，加速可能状態になる\nこの時点ではアクセルは押していないこと、解答群がすべて「走行準備→加速可能」から始まっていることを考慮すると、電動KBを手押しすることにより「走行準備→加速可能」に遷移することがわかります。\n次に、アクセルを押して加速したときの遷移です。本文中に「加速可能状態でアクセルを押すと，走行中状態になり…」とあるため、アクセスを押すと「加速可能→走行中」へと遷移します。\n最後に、アクセルを戻して惰性で走る場面です。本文では「走行中状態でアクセルを戻すと，加速可能状態になる」としているため、アクセスを戻すと「走行中→加速可能」へと遷移します。\n「エ」にある「加速可能→走行準備」への直接の遷移は、図3にそれを示す矢印が描かれてないことからわかるようにありません。\nしたがって「ウ」が適切な状態遷移となります。\n∴ウ：走行準備→加速可能→走行中→加速可能\n\n---\n\n解説\n〔\na\nについて〕\n空欄aは、走行準備・加速可能・走行中の各状態から、停止中へと遷移する条件です。\n〔電動KBの動作概要〕に「走行準備状態，加速可能状態，走行中状態で0.1km／時未満が一定時間継続すると停止中状態になる」とあり、他に関連する記述が見当たらないことから、本文そのまま「0.1km／時未満が一定時間継続」が答えとなります。\n∴\na\n＝0.1km／時未満が一定時間継続\n〔本システムの利用方法〕には、返却時の制約として次の説明があります。\nポート以外の場所では，電動KBの貸出し及び返却を行うことはできない\n予約した返却ポートに，利用中の電動KBを駐車する\nすなわち、返却は所定のポート上でのみ許可されます。返却ポート以外の場所での返却を防ぐためには、管理サーバは電動KB（正確にはアプリが取得するスマホの）位置情報を見て、その位置が「予約した返却ポート」であるかを判定したうえで返却指示を行う必要があります。\n表3を見ると、停止中状態で利用者がアプリで\"返却\"を選択したときは、管理サーバに対し\"返却要求\"メッセージが送られることがわかります。本メッセージの構成データは「車体ID，利用者ID，位置情報」の3つです。返却の可否を判断する材料となる情報で、車体ID・利用者ID以外のものなので「位置情報」が該当します。\n∴位置情報\n\n---\n\n解説\n〔\nb\nについて〕\n空欄bに入るのは車輪のロックの解除した直後の状態です。\n〔電動KBの動作概要〕に「利用者がアプリで\"貸出し\"を選択すると，…車輪のロックを解除して停止中状態になる」とあり、これ以外にロックを解除するタイミングはないため、「停止中」が答えとなります。\n∴\nb\n＝停止中\n〔\nd\nについて〕\n空欄dには速度計測タスクが、現在速度を通知する先のタスク名が入ります。\n表3の現在速度に関する説明として次の2点があります。\nメインタスクから現在速度及び電池残量の情報を受け取ると，現在速度及び電池残量をディスプレイに表示し，最高速度表示等を制御する（表示タスク）\n現在速度及び電池残量を表示タスクに通知する（メインタスク）\n表示タスクは現在速度の情報を必要としますが、その情報はメインタスクを介して通知される仕様であることが読み取れます。また、メインタスク自体は「電動KBの状態管理」を担うために現在速度の情報を必要とします。この2点より、速度計測タスクが現在速度を通知する先は「メイン」タスクと判断できます。\n∴\nd\n＝メイン\n〔\nc\nについて〕\n空欄cにはメインタスクからモータータスクに通知すべき情報が入ります。\n〔電動KBの動作概要〕より、モーター制御に関連する動作は以下の3点です。\n走行中状態のときのみ、モーターのトルク制御を行う\n現在速度が最高速度未満の場合は、アクセルの操作量によってモーターのトルクの発生を制御する\n現在速度が最高速度に達した場合は、モーターのトルクを抑制する\n表3を見ると、モータータスクにはいくつかの情報が送られてきます。アクセルタスクからは「アクセルの操作量」が、速度計測タスクからは「現在速度」が通知され、これが②③を実現します。したがって、メインタスクからは①を判定するための情報、つまり「電動KBの状態」を通知すればよいです。\n∴\nc\n＝電動KBの状態\n\n---\n\n解説\n車輪ロック解除に関連するメッセージは、\"車輪ロック解除指示\"と\"車輪ロック解除応答\"の2つです。一方、\"車輪ロック指示\"と\"車輪ロック応答\"は返却時の車輪ロック動作で使われるメッセージなので、貸出時には使用されません。よって、残る空欄に入るメッセージは\"貸出し応答\"になると推測できます。\n\"車輪ロック解除指示\"と\"車輪ロック解除応答\"は、アプリと電動KBとの間でやり取りされるメッセージです。\"車輪ロック解除応答\"の構成データには「結果」が含まれるので、解除を指示した後に送信されるメッセージとなります。そのため、\"車輪ロック解除指示\"→\"車輪ロック解除応答\"という先後関係となります。\nまた、\"貸出し応答\"は、アプリから管理サーバに送信されるメッセージです。構成データとして「車輪ロック解除結果」が含まれることから、アプリが電動KBから\"車輪ロック解除応答\"を受け取り、解除を確認した後に送信されることがわかります。\n以上より、メッセージの流れは「貸出し要求」→「貸出し指示」→「e：車輪ロック解除指示」→「f：車輪ロック解除応答」→「g：貸出し応答」となります。\n∴\ne\n＝車輪ロック解除指示\nf\n＝車輪ロック解除応答\ng\n＝貸出し応答\n〔①について〕\nアプリで\"返却\"を選択した場合、次の2つのメッセージが送受信されます。これ以外にはありません。\n返却要求（アプリ→管理サーバ）\n返却指示（管理サーバ→アプリ）\n管理サーバとアプリ間で一つのメッセージ通信には200ミリ秒掛かるので、要する時間は「200ミリ秒×2＝400ミリ秒」。解答単位は秒で、小数第2位まで求めることに注意すると、答えは「0.40秒」です。\n∴0.40（秒）\n〔②について〕\n1回目では車輪のロックに失敗し、2回目で車輪のロックに成功した場合、アプリが\"返却指示\"を受信してから\"車輪ロック\"を受信するまで以下の処理が行われます。\n車輪ロック指示（アプリ→電動KB）\n車輪ロック処理：失敗\n車輪ロック応答（電動KB→アプリ）\nメッセージ再送まで待機\n車輪ロック指示（アプリ→電動KB）\n車輪ロック処理：成功\n車輪ロック応答（電動KB→アプリ）\nアプリと電動KB間のメッセージ通信（1, 3, 5, 7）は10ミリ秒、車両ロック処理（2, 6）は成功・失敗を問わず1秒、メッセージ再送（4）まで0.5秒掛かるとあるので、要する時間は、\n10ミリ秒×4＋1秒×2＋0.5秒＝2.54秒\n0.04秒＋2秒＋0.5秒＝2.54秒\n∴2.54（秒）\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm07.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm07.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問7(組込みシステム開発)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問8　情報システム開発】\n\nエラーハンドリングに関する次の記述を読んで，設問に答えよ。\nQ社は，業務システムの受託開発会社である。Q社は，スーパーマーケットの複数の店舗を運営するB社から，CRM(Customer Relationship Management)システムの開発と運用保守業務を受託した。CRMシステムは各店舗で利用され，顧客からの意見やクレーム，店舗での対応の内容が登録・蓄積される。CRMシステムを運用する際の関係者の一覧を表1に示す。\nQ社は，システムのリリース後に想定される，店舗からの問合せに対する迅速な対応を可能にするために，想定される問合せのパターンと対応方法を事前に整理し，対応の際に必要な要件をシステムの設計に反映させることにした。\n〔CRMシステムの構造〕\nCRMシステムのクラス図(一部)を図1に示す。Abstractcontroller，AbstractService及びAbstractDaoは，それぞれ画面遷移，ビジネスロジック及びデータベースアクセスの共通処理が実装された抽象クラスである。これらのクラスを\na\nしたクラスを作成して，具体的な機能を実装する。ログを出力するにはLoggerクラスを利用する。ログの出力時には\"DEBUG\"，\"ERROR\"などの，ログの種別(以下，ログ種別という)が記録される。図1に示すクラスを使った処理の流れの例として，システムにログインする際のシーケンス図を，図2に示す。\n利用者がログイン画面で認証に必要な情報を入力しログインを実行すると，LoginControlterのログイン実行メソッドが呼び出される。ログイン実行メソッドは，画面から入力された情報をAuthServiceに引き渡す。AuthServiceは，UserDaoに実装されている，利用者情報の検索を行う機能を用いて，認証の判定に必要な利用者情報をデータベースから取得する。AuthServiceは，取得した利用者情報を用いて口グイン認証の判定を行い，結果を返す。\nプログラムの実行中にエラーが発生した際の，例外処理用のクラスとしてExceptionクラスがある。Exceptionクラスは，エラーの詳細情報として，エラーの発生箇所のソースファイル名，行番号，メソッドの呼出し履歴及び直接的な原因を示すメッセージ文字列をもつ。エラー発生時には，エラーの発生箇所でExceptionクラスのオブジェクトを作成し，呼出し元ではそれを使って例外処理を行う。\n〔CRMシステムのエラーの種別の整理とその対応〕\nQ社は，運用中に起き得るエラーの種別(以下，エラー種別という)を整理し，対応方法について検討した。エラー種別と運用担当者の対応を表2に，対応を行うために必要な出力機能及び出力内容と，出力内容を参照する関係者を表3に示す。\n表2，表3についてレビューを行ったところ，次の3点が指摘された。\n表2のシステム障害及びシステムエラーは，利用者の問合せの前にシステムが自動的に検出して運用担当者が対応を開始できるようにすべきである。\n表3の出力内容には，セキュリティの観点における潜在的なリスクがある。\n表3について，エラーに関するログだけでは，開発担当者が原因を調査するための情報としては不足するので，追加の情報を出力する必要がある。\n指摘事項の(1)に対応するために，\n①監視の機能\nを用意することにした。監視の機能は，監視対象の情報を定期的に取得し，エラー発生時の特徴を検出した場合に電子メールで運用担当者に通知する。指摘事項の(2)については，表3の\n②出力内容を一部変更\nすることにした。指摘事項の(3)については，アスペクト指向プログラミングを導入して，プログラムの処理の中で，要所ごとにログを出力することにした。\n〔アスペクト指向プログラミングの導入〕\nレビューの指摘事項の(3)に関連して，利用者が行った操作内容を一律でログに出力することにし，これを実現するためにアスペクト指向プログラミングを導入することにした。\nアスペクト指向プログラミングでは，特定のルールを定義しておくことによって，そのルールに合致する全ての箇所で同じ処理を実行させる。ルールの定義の条件にはクラス名，メソッド名に含まれる文字列のパターンが利用できる。また，特定の条件に合致する場合には実行の対象から除外するように指定することもできる。\nここでは，実装上の制約ができるだけ少なくなるようなルールの定義方法で，画面遷移に関するクラスに実装された全てのメソッドについて，クラス名，メソッド名及び全ての引数の内容をログに出力することにした。これを実現するために，\ne\nを親クラスにもつクラスの\nf\nには必ず特定の文字列のパターンを含み，それ以外のクラスの\nf\nには特定の文字列のパターンを含まないように命名規則を定義した。ただし，秘匿情報や個人情報の保護の観点から，認証に関する情報や，\n③顧客情報を扱う箇所はログに出力しない\nようにした。\nQ社は，表2，表3に関する検討結果をシステムの設計に反映させ，開発を開始した。\n\n【設問1】\n\n本文，図1及び図2中の\na\n～\nc\nに入れる適切な字句を答えよ。\n\n【設問2】\n\n表3中の\nd\nについて，どの関係者に向けた表現として出力をすべきか。表1の関係者から\n全て\n選び答えよ。\n\n【設問3】\n\n本文中の\n下線①\nについて，業務運用中のCRMシステムの何を対象に監視するか。システム障害とシステムエラーのそれぞれについて，最も適切なものを解答群の中から選び，記号で答えよ。\n\n【設問4】\n\n本文中の\n下線②\nについて，変更した出力機能を答えよ。また，その変更の内容を20字以内で答えよ。\n\n【設問5】\n\n〔アスペクト指向プログラミングの導入〕について答えよ。\n本文中の\ne\n，\nf\nに入れる適切な字句を答えよ。\n本文中の\n下線③\nについて，出力しないようにした理由を，20字以内で答えよ。\n\n---\n【選択肢】\n: 障害：-ア　画面に表示されたエラーメッセージイ　データベースの接続確認の結果ウ　電子メール送信履歴エ　ログ種別の文字列オ　ログファイルのサイズエラー：-ア　画面に表示されたエラーメッセージイ　データベースの接続確認の結果ウ　電子メール送信履歴エ　ログ種別の文字列オ　ログファイルのサイズ\n: エラー：-ア　画面に表示されたエラーメッセージイ　データベースの接続確認の結果ウ　電子メール送信履歴エ　ログ種別の文字列オ　ログファイルのサイズ",
    "back": "【正解】 継承, ID, ログイン認証の判定結果, 運用担当者，開発担当者, イ, エ, エラーメッセージ表示, エラーの詳細情報を出力しない, AbstractController, クラス名, ログは開発担当者も参照するから\n\n【解説】\n解説\n〔\na\nについて〕\n本文では、AbstractController などの抽象クラスに共通処理を実装し、それらを基に具体的な機能をもつクラスを作成すると説明されています。抽象クラスを基底として子クラスを派生させる手法は、オブジェクト指向における「継承」に該当します。継承は、既存の親クラス（基底クラス）がもつ属性やメソッドを子クラス（派生クラス）が引き継ぎ、そのうえで独自の機能を追加・拡張できるようにするオブジェクト指向の仕組みです。したがって、空欄aには「継承」が入ります。\n継承は別名「インヘリタンス」とも言いますが、「インヘリタンスした」という動詞の形では普通使われません。このため、本文中の文脈に妥当するのは「継承」の一語に絞られます。\n∴\na\n＝継承\n〔\nb\nについて〕\n図2のシーケンス図では AuthService が UserDao に対して\"検索（\nb\n）\"のメッセージを送っています。本文中に「AuthServiceは，UserDaoに実装されている，利用者情報の検索を行う機能を用いて，認証の判定に必要な利用者情報をデータベースから取得する」とあることから、このメッセージは UserDao（Dao：Data Access Object）から利用者情報を取得するためのものとわかります。\n入力元である LoginController から AuthService へはIDとPasswordが渡されていますが、ログイン認証の判定（パスワードの一致確認）は AuthService が担当します。このため、 Passwordの送信は不要で、 UserDao には利用者を一意に特定するためのIDだけを渡せば足ります。したがって、空欄bには「ID」が入ります。\n∴\nb\n＝ID\n〔\nc\nについて〕\n図2では、AuthService がIDとPasswordを受け取り、UserDao から取得した利用者情報を用いてログイン認証の処理を行う様子が示されています。本文中に「AuthServiceは，取得した利用者情報を用いて口グイン認証の判定を行い，結果を返す」とあるため、AuthService から LoginController へ返されるのは、ログイン認証が成功したか失敗したかという判定結果です。したがって、空欄cには「ログイン認証の判定結果」が入ります。\n∴\nc\n＝ログイン認証の判定結果\n\n---\n\n解説\n〔\nd\nについて〕\n表3より、ログ出力には「エラーの概要，詳細情報及びメソッドの呼出し履歴」が含まれるとわかります。これらの情報は、主に障害発生時の原因分析やトラブルシューティングに使用されます。\n本文中にはログに関係する記述として、以下の2点があります。\n運用担当者：エラー発生時の前後のログをログファイルから切り出して開発担当者に送付する\n開発担当者：運用担当者からログを受け取って原因や回避策の調査を行う\n開発担当者は調査のため、運用担当者は調査資料の送付のためログを参照する必要があります。これに対して、利用者にはログの参照権限を与えるべきではありません。ログにはソースファイル名や呼出し履歴など機密性の高い内部情報が含まれること、利用者が詳細ログを閲覧しても内容を理解できず実務上のメリットもないためです。したがって、空欄dには「運用担当者と開発担当者」が入ります。\n∴\nd\n＝運用担当者，開発担当者\n\n---\n\n解説\n〔システム障害について〕\nシステム障害について、表2では「Webサーバやデータベースサーバの停止，プログラムの異常終了，ネットワーク障害などの原因によって，システム全体の稼働が継続不能になる」状態と定義しています。つまり、稼働不能になる主な要因は、アプリケーション、DB、ネットワークのいずれかがダウンすることです。\nこれらの構成要素を一度に監視する方法として、アプリケーションからDBに対する定期的な疎通確認（死活監視）の実施が有効です。DBに到達できなければネットワーク切断やDBサーバ停止が、SQL 実行に失敗すればアプリケーションの障害が想定され、いずれもシステム障害の原因となります。定期的に疎通確認を行い、異常を検知したときに担当者に通知する仕組みにより、システム障害の自動検出が可能となります。\nしたがって、監視対象とする情報は「イ：データベースの接続確認の結果」が適切です。\n〔システムエラーについて〕\nシステムエラーについて、表2では「主にプログラムの欠陥によって発生する，想定外のエラー。操作の途中でエラーメッセージが表示され，業務を続行できない」状態と定義しています。\n表3「ログ出力」では、プログラムの実行中に想定外のエラーが発生した場合、ログ出力が行われることが明記されています。〔CRMシステムの構造〕には「ログの出力時には\"DEBUG\"，\"ERROR\"などの，ログの種別(以下，ログ種別という)が記録される」とあるため、これをシステムエラーの検知に使用することが可能です。ログを定期的に監視し、ログ種別\"ERROR\"を検知したときに担当者に通知する仕組みにより、システムエラーの自動検出が可能となります。\nしたがって、監視対象とする情報は「エ：ログ種別の文字列」が適切です。\n∴障害＝イ：データベースの接続確認の結果\nエラー＝エ：ログ種別の文字列\n以下はその他の選択肢が不適切な理由です。\nア：画面に表示されたエラーメッセージ\n利用者の端末にだけ表示されるため、ログなどに記録しておかないとシステム的な監視はできません。また、エラーメッセージはシステムエラーだけではなく、業務エラーと入力エラーでも表示されるため、対象数が多すぎて管理面から不向きです。\nウ：電子メール送信履歴\n監視機能が異常を検知した\"結果\"として運用担当者へ通知する経路にすぎず、CRMシステム内で起こる事象ではないため不適切です。\nオ：ログファイルのサイズ\n\"DEBUG\"などの情報ログが大量に出てもログのサイズは増加します。ファイルサイズはエラーの発生とは直接関連しないため不適切です。\n\n---\n\n解説\n指摘事項(2)では「表3の出力内容には，セキュリティの観点における潜在的なリスクがある」ことが問題とされています。表3の出力機能には「ログ出力」と「エラーメッセージ表示」の2つがありますが、ここで問題とされているのは、利用者の画面に表示されるエラーメッセージの内容です。\nエラーメッセージには「Exceptionクラスがもつエラーの詳細情報」が含まれます。詳細情報とは、具体的には「エラーの発生箇所のソースファイル名，行番号，メソッドの呼出し履歴及び直接的な原因を示すメッセージ文字列」であると記述されています。これらの技術的詳細は、システムの内部構造や処理の流れを外部から推測する手がかりとなり、サイバー攻撃のリスクを高めるおそれがあります（利用者の中にハッカーがいないとは限りません）。これらの内部情報はそもそも利用者には不要ですから、機密性確保の観点から、一般利用者に対しては表示しないことが一般的です。したがって、変更内容とは「エラーの詳細情報を出力しない」ようにすることです。\n∴出力機能＝エラーメッセージ表示\n内容＝エラーの詳細情報を出力しない\n\n---\n\n解説\nアスペクト指向プログラミングは、プログラム全体に共通する処理（ログ出力やエラーハンドリングなど）を一箇所にまとめて記述し、必要な箇所に自動的に適用できるようにする開発手法です。従来のオブジェクト指向では分離が難しかったクラスを横断した共通処理の記述が可能であり、保守性や再利用性の向上に役立ちます。\n〔\ne\nについて〕\nログを出力すべき対象は「画面遷移に関するクラスに実装された全てのメソッド」なので、画面遷移クラスの親クラス名が当てはまります。〔CRMシステムの構造〕には、画面遷移を実装するのは Abstractcontroller クラスという説明があり、すべての画面遷移クラスはこれを継承して作成されるため AbstractController を親クラスとして持ちます。したがって、空欄eには「AbstractController」が入ります。\n∴\ne\n＝AbstractController\n〔\nf\nについて〕\n本文では「ルールの定義の条件にはクラス名，メソッド名に含まれる文字列のパターンが利用できる」とあるため、クラス名・メソッド名のいずれかが当てはまります。判断のポイントは「実装上の制約ができるだけ少なくなるようなルールの定義方法」という要件です。\nクラス名で定義した場合「○○Controller」という命名規則で、他のクラスに影響を及ぼすことなく容易にすべての画面遷移クラスを対象とできます。一方でメソッド名による定義の場合、①画面遷移クラスのメソッドは必ずその文字列パターンを含める、②その文字列パターンが他のクラスで使用できない、という命名制限が生じます。このため、適切な実装方法は「クラス名」によるルール定義と判断できます。\n∴\nf\n＝クラス名\n出力されたログは運用担当者と開発担当者が参照します。運用担当者はCRMシステムにアクセスでき、対応に必要な限りで顧客情報を見ることが許容されています。一方で、開発担当者にはCRMシステムの入力情報（顧客の氏名・連絡先等）への参照が許されていません。「顧客情報は，B社の従業員が顧客に連絡するためだけに使用する」とされていること、開発担当者に引き渡す情報は必要最小限とされていることを踏まえると、調査のために不要な顧客情報はログに出力しないように制御する必要があります。これがログに顧客情報を出力しないようにした理由です。したがって「ログは開発担当者も参照するから」「開発担当者に参照されることを防ぐため」などの解答が適切となります。\n∴ログは開発担当者も参照するから\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm08.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm08.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問8(情報システム開発)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問9　プロジェクトマネジメント】\n\nCCPM(Critical Chain Project Management)を用いたプロジェクトのスケジュール管理に関する次の記述を読んで，設問に答えよ。\nZ社は，小売業を営む中堅企業である。社内で10年以上利用してきた販売管理システムの老朽化対策として，販売管理の新システムを構築することになった。\n〔新システム発注先の選定〕\n現行の販売管理システム(以下，現行システムという)は，Z社システム部がZ社内の稼働システム全般の維持管理を委託しているJ社によって開発された。現行システムは，利用部門の業務要求を広く受け入れたことで冗長なシステムになり，費用が膨れてしまった。そこで，Z社システム部は，新システムの構築は現行システムの機能保証にこだわらず，費用を抑える方針とした。\nこの方針の下で検討を進めた結果，新システムとして，販売管理系のSaaSの標準機能を導入(以下，SaaS導入という)し，業務をSaaSの標準機能に極力合わせ，どうしても合わせられない機能に限りZ社独自の業務要求を追加(以下，SaaSアドオンという)することにした。一方で，本稼働後の新システムの維持管理をJ社に委託する予定で，J社には新システムの構築時に，SaaSと連携させる必要がある現行システムの周辺にある関連システム(以下，現行関連システムという)を改修してもらうことに同意を得ている。なお，新システムの構築期間中は，現行システムの機能変更を最小限にとどめることにした。\nZ社システム部のX課長は，販売管理系のSaaSを提供する複数のベンダーにRFI及びRFPを段階的に提出し，それぞれの回答内容を基に発注先候補をK社，L社，M社及びN社に絞った。この4社に提案のプレゼンテーションを依頼し，多基準意思決定分析の加重総和法を用いて発注先候補を評価し，選定することにした。発注先候補を多面的に評価するため，評価項目及び主な評価内容を次のとおりとした。\n費用:\n初期費(SaaS導入費，SaaSアドオン費など)，運用費(SaaSライセンス費，SaaS環境利用料など)。ここで，現行関連システムの改修費及び運用費は，どのSaaSを採用しても同額とする。\n要求充足度:\nZ社の業務要求の充足度。\n保守性:\nSaaSアドオンの維持管理支援ツールの充実度。\n会社実績:\nZ社との取引実績，会社の規模・信頼度，業界での導入実績。\n提案内容:\nプレゼンテーション，RFP記載事項以外の有効な提案の有無。\n各評価項目を5点満点で評価する。評価項目にZ社が重要視する度合いに応じて重みを設定し，評価点数に重みを乗じて再評価し，再評価値を算出する。選定基準として，再評価値の合計が最も大きいベンダーを選定する。ただし，一つでも評価点数が2点以下の評価項目があるベンダーは選定しない。発注先候補の選定評価結果を表1に示す。\n再評価の結果，X課長は，今回の選定基準に従って\na\n社(以下，SaaS提供会社という)を選定し，Z社内で承認された。\n〔開発スケジュールの作成〕\n新システムの構築プロジェクトのPMに任命されたX課長は，部下のY君に開発スケジュールの作成を指示した。Y君は，図1に示すアローダイアグラムを作成した。\nここで，アクティビティ[A]の開始日を1日目とする。各アクティビティの日数は1日単位で数え，依存関係にある先行アクティビティが終了した翌日に後続アクティビティを速やかに開始する。図1中の[B]に関して，最早開始日は[A]を開始してから31日目であり，最遅開始日は\nb\n日目である。\nZ社の過去のプロジェクトでは，所要日数のうち10%の日数をアクティビティごとに安全余裕(以下，バッファという)として設定していた。Z社システム部及び外部委託先の開発担当者(以下，開発担当者という)は，バッファを含んだ所要日数で作業スケジュールを作成し，作業の実施でバッファを不必要に消費する傾向にあった。これが原因で，開発スケジュール全体が遅延したことが度々あった。\nこのような状況を改善し，バッファを含む完了予定日までにプロジェクトを完了させるために，X課長は次のとおりCCPMの考えを取り入れたガントチャート形式の開発スケジュールを作成して，スケジュールを管理するようY君に指示した。\nアローダイアグラムの\n①アクティビティごとに設けられたバッファを削除\nしてクリティカルチェーンを設定する。\nクリティカルチェーンのアクティビティから削除したバッファを合計して\nc\nバッファを設定する。クリティカルチェーンのアクティビティの進捗が遅延した場合はこのバッファを使い，これ以降のアクティビティのスケジュールを，遅延した日数分だけ後ろにずらす。\nクリティカルチェーンにないアクティビティが遅延してもスケジュール全体に影響しないように，クリティカルチェーンにつながるアクティビティの直後に\nd\nバッファを設定する。\nSaaS提供会社のSaaSアドオンはローコード開発が特長で，数日間のオンライン研修を受講すればローコード開発の技術を習得できるということであった。J社は，本稼働後の新システムの維持管理を見据え，現行システムの維持管理要員のうち数名に研修を受講させた。そこで良い感触をつかんだJ社から，\"弊社がSaaSアドオンの設計及び開発を担当すれば，御社の外部委託費用を抑えることができる\"という提案があった。X課長は，元々J社の現行システムの維持管理要員に委託する予定であった[E]，[F]に加え，SaaS提供会社に委託する予定であった[C]，[D]もJ社に委託することにし，J社と新たに準委任契約を締結することに決めた。これによって，J社内で[C]～[F]間の要員シフトの調整が可能になった。\nさらにJ社から，[C]を独立に実施可能な[C1]と[C2]に分割して並行作業し，[D]も同様に[D1]と[D2]に分割して並行作業し，加えて当初予定の2倍の要員を投入して各アクティビティの所要日数を半分にするという提案があった。J社は，J1チーム([C1]及び[D1]を担当)，J2チーム([C2]及び[D2]を担当)，及びJ3チーム([E]及び[F]を担当)の3チーム体制を作り，各バッファの期間を含めて十分な要員を確保することを約束した。これらを反映した開発スケジュールを図2に示す。\nX課長は，要件定義に参加するZ社の利用部門との間で，費用，及びバッファを含む完了予定日を守ることを念頭においた要件定義の進め方を合意し，図2のとおり作業を開始した。\n〔アクティビティの進接遅延発生時の対応〕\nX課長は，週次(作業日ベースで5日ごと)で進捗会議を開催した。進捗会議において，次のとおりアクティビティの進捗が遅延していると報告された。これらのアクティビティ以外は，順調に進捗していた。X課長は，これら2件の遅延報告に対してそれぞれ対策を指示した。\n(ⅰ) 40日目の進捗会議\n遅延報告:\n前日時点で[C1]の進捗が3日ほど遅れている。\n対策:\n4日の遅延で[C1]が終了する見通しとなったので，その4日分は\nd\nバッファを使って作業を続けること。\n(ⅱ) 70日目の進持会議\n遅延報告:\nSaaSアドオン開発のスキルが必要とされる作業において，予期しない技術上の問題が発生したことによって作業量が増大したので，[D2]の進捗が遅延している。最大で12日の遅延となるおそれがあり，\n②その場合，プロジェクトの完了がバッファを含む完了予定目よりも遅れる\nことが懸念される。なお，[D2]の作業手順に問題は見られず，中間成果物の品質は担保されていた。また，並行作業している[D1]は，遅延していないが余裕はない状況である。\n対策:\nこれ以上[D2]の遅延を拡大させないように，J2チームの要員を発生した問題の解決作業に専念させ，それ以外の作業を実施するために\n③早急にリソース視点の対策をとること\n。\n(ⅱ)の対策によって，[D2]の遅延は最小限に抑えられた。[D2]の終了後の[G]は順調に実施され，バッファを含む完了予定日より前にプロジェクトが完了した。\n\n【設問1】\n\n〔新システム発注先の選定〕について答えよ。\nZ社が新システム構築の発注先の選定評価に加重総和法を用いた狙いを25字以内で具体的に答えよ。\n本文中の\na\nに入れる適切な社名を英字1字で答えよ。\n\n【設問2】\n\n〔開発スケジュールの作成〕について答えよ。\n本文中の\nb\nに入れる適切な数字を答えよ。\n本文中の\n下線①\nについて，X課長はこの対策によって個々の開発担当者の作業にどのような効果が期待できると考えたのか。20字以内で答えよ。\n本文中及び図2中の\nc\n，\nd\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n【設問3】\n\n〔アクティビティの進捗遅延発生時の対応〕について答えよ。\n本文中の\n下線②\nについて，対策をせずに最大日数の遅延になった場合，プロジェクトの完了はバッファを含む完了予定日に対して何日遅れるか。数字で答えよ。\n本文中の\n下線③\nについて，対策の内容を25字以内で具体的に答えよ。\n\n---\n【選択肢】\n: キャパシティ\n: 合流\n: 資源\n: プロジェクト",
    "back": "【正解】 費用及び要求充足度を重要視するため, K, 41, バッファを消費しなくなる, エ, イ, 1, J3チームだった要員を[D2]に投入する\n\n【解説】\n解説\n設問文の条件に従い、発注先の選定評価について確認すると〔新システム発注先の選定〕には、以下の記述があります。\nZ社システム部は，新システムの構築は現行システムの機能保証にこだわらず，費用を抑える方針とした\n業務をSaaSの標準機能に極力合わせ，どうしても合わせられない機能に限りZ社独自の業務要求を追加することにした\nZ社は新システムについて、まず方針として\n費用を抑える\nことを明確にしています。同時に、SaaSの標準機能に業務を極力合わせるとしつつ、どうしても合わない部分はアドオンで補うとしており、\n業務要求への適合度\n（要求充足度）を外せない評価軸として据えていることが読み取れます。その他の評価軸について特に言及がありません。\nZ社が採用した加重総和法は、後述の計算例のように、評価項目ごとの点数に評価項目の重みを乗じた値の総和を求め、その多寡によって対象を定量的に評価する方法です。上記2項目の重要度を評価に反映するため、（単純総和方式ではなく）各項目に重みを設定できる加重総和法を採用したと言えます。\n∴費用及び要求充足度を重要視するため\n〔\na\nについて〕\n本文中に記載されている選定ルールは次の2点です。\n評価点数に重みを乗じて再評価し，再評価値を算出する。…再評価値の合計が最も大きいベンダーを選定する\n一つでも評価点数が2点以下の評価項目があるベンダーは選定しない\nまず除外条件の確認です。表1より M社は\"会社実績が2点\"のため、この時点で選定対象外です。K、L、Nはいずれも2点以下がないので選定対象に残ります。\n3社について、項目ごとの評価点数に評価項目の重みを乗じた値の総和を計算します。結果は以下のとおりです。\nK社：4×2 + 4×1.5 + 4×1 + 3×1 + 4×1 = 25.0\nL社：3×2 + 3×1.5 + 3×1 + 4×1 + 4×1 = 21.5\nN社：3×2 + 3×1.5 + 4×1 + 5×1 + 5×1 = 24.5\n再評価値が最大となるのはK社（25.0）です。したがって、空欄aには「K」が入ります。\n∴\na\n＝K\n\n---\n\n解説\n〔\nb\nについて〕\nまず、最早開始日・最遅開始日について確認します。\n最早開始日\n先行作業の完了を前提とし、その作業を最も早く開始できる日\n最遅開始日\nプロジェクト完了を遅らせないことを前提とし、その作業を最も遅く開始できる日\n本プロジェクトのクリティカルパスは「A→C→D→G」です。[B]は[D]の先行作業とされているので、プロジェクトを予定日数で完了するには、[D]が開始するまで（＝A→Cが完了するまで）には[B]が完了している必要があります。\nA→Cの所要日数は「A:30日＋C:40日＝70日目」なので、[D]も70日目までに完了していれば、プロジェクトの完了には影響を与えません。[B]の所要日数は30日ですから、完了日から逆算して「70－30＋1＝41日目」が[B]の最遅開始日となります。したがって、空欄bには「41」が入ります。\n∴\nb\n＝41\nX課長が下線①のようなバッファ管理を行うこととしたのには、次のような状況を踏まえてのことです。\nZ社システム部及び外部委託先の開発担当者(以下，開発担当者という)は，バッファを含んだ所要日数で作業スケジュールを作成し，作業の実施でバッファを不必要に消費する傾向にあった。これが原因で，開発スケジュール全体が遅延したことが度々あった\n『仕事は完成のために与えられた時間まで膨張する』というパーキンソンの法則で知られるように、作業時間に余裕があるとダラつきや追加作業で容易に使い切られてしまうことが世の常です。Z社でも同じ傾向にあることが読み取れます。\nクリティカルチェーン法（CCPM）では、アクティビティごと個別バッファを設けず、全体でバッファで管理することで、この心理的・行動的メカニズムを断ち、担当者が本来の所要時間に集中して仕上げることを促します。以上を踏まえると、X課長はクリティカルチェーン法を採用することで「バッファが不必要に消費されなくなること」を期待したと考えられます。\n∴バッファを消費しなくなる\nなお、設問に「個々の開発担当者の作業に」と条件付けがあるため、答える際は「開発スケジュール全体の遅延回避」や「全体の開発効率向上」ではなく、担当者一人ひとりの作業レベルでの効果を示す必要があります。\nクリティカルチェーン法では、個々の作業にバッファ（安全余裕時間）をもたせず、バッファをプロジェクト全体で管理します。バッファには複数の種類があります。\nプロジェクトバッファ\nプロジェクトのクリティカルパスを守るために、クリティカルチェーンの最後に配置される\n合流バッファ\nクリティカルパス上にない作業の遅れが、クリティカルパス上のタスクに影響を与えることを防ぐために、作業の合流地点に配置される\n資源（リソース）バッファ\n同じリソースを使う作業が複数あるとき、後続タスクが遅れるのを防止するために配置される\n〔\nc\nについて〕\nクリティカルチェーンのアクティビティが遅延した場合に使用されるバッファであること、図2中でクリティカルチェーンの\n最後\nに配置されていることから「プロジェクト」バッファが答えとなります。\n〔\nd\nについて〕\nクリティカルチェーンにないアクティビティが遅延した場合に使用されるバッファであること、図2中で作業の\n合流地点\nに配置されていることから「合流」バッファが答えとなります。\n∴\nc\n＝エ：プロジェクト\nd\n＝イ：合流\n\n---\n\n解説\nまず、図2のスケジュールにおけるプロジェクトバッファの日数を特定します。プロジェクトバッファは「クリティカルチェーンのアクティビティから削除したバッファの合計」と定義されています。\n前述のとおり、図1のアローダイアグラムでは「A→C→D→G」がクリティカルパスでした。しかし、作業CとDが要員の追加投入（クラッシング）で分割されたことにより、図2のクリティカルチェーンは「A→B→D1/D2→G」であることが確認できます。\nZ社では「所要日数のうち10%の日数をアクティビティごとに安全余裕(以下，バッファという)として設定していた」とあるので、各作業のバッファはアローダイアグラムで示された所要日数のうち10％です。プロジェクトバッファは以下のように計算できます。\n[A]：30日×0.1＝3日\n[B]：30日×0.1＝3日\n[D1]/[D2]：(60日÷2)×0.1＝3日\n※人員2倍で半分＝30日\n[G]：20日×0.1＝2日\n合計：3＋3＋3＋2＝11日\nクリティカルチェーン上の[D2]が12日遅れた場合、プロジェクトバッファの11日では吸収できず、完了予定日より「12－11＝1日」の遅れが生じる結果となります。\n∴1（日）\n70日目の遅延は[D2]（J2チーム担当）で発生しており、遅延の原因は作業量の増加です。リソース視点で考えると、人員の不足を補うための追加投入が必要な場面です。\n本文中では「J社内で[C]～[F]間の要員シフトの調整が可能」とあるので、対策として、J1チームまたはJ3チームから、問題の解決作業以外の作業を行う要員を融通してもらうことが考えられます。他のチームの状況を整理します。\n（進捗報告より）並行作業している[D1]]（J1チーム担当）は，遅延していないが余裕はない状況である\n（図2注記2より）J3チームの要員は、[F]の作業終了後に現行システムの維持管理対応に戻る予定である\nこの状況を踏まえると、J1チームから要員を出してもらうのは難しいです。一方で、本文中に「これらのアクティビティ以外は，順調に進捗していた」とあるため、J3チームは70日目時点では作業を終えて維持管理対応に入っていると考えられます。J社は「各バッファ期間を含め十分な要員を確保」しているため、J3チームの予定を変更し、[D2]へ要員を再配分することが可能と考えられます。これがリソース視点の対応方法となります。\n∴J3チームだった要員を[D2]に投入する\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm09.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm09.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問9(プロジェクトマネジメント)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問10　サービスマネジメント】\n\n容量・能力管理に関する次の記述を読んで，設問に答えよ。\nA社は製造業を営む企業で，本社に併設する製造部配下の工場と営業部配下の2か所の営業所をもつ。A社の業績は好調であり，3年後の売上は，現在より2割の増加を見込んでいる。A社情報システム部には，システムの開発と保守を担当する開発課とシステムの運用を担当する運用課がある。運用課の責任者はC課長である。C課長の下でD君は，数名の運用担当者で構成された運用チームのリーダーとして，容量・能力(以下，キャパシティという)管理を含め，運用業務を行っている。\n〔サービスの概要〕\n情報システム部は，製造部に生産管理サービスを，営業部に販売管理サービスを，提供している。生産管理サービスは生産管理システムによって，販売管理サービスは販売管理システムによって実現されている。生産管理サービス及び販売管理サービス(以下，両サービスという)の提供時間帯は，A社の営業時間帯と同じ8時～18時である。製造部及び営業部は，情報システム部との間で両サービスに関するSLAに合意している。SLAでは，サービスレベル目標値の一つとして，オンライン処理の応答時間を\"入力されたトランザクション要求の95%を3秒以内に応答すること\"と定めている。\n運用課は，オンプレミス環境のサーバ1台で，生産管理システム及び販売管理システム(以下，両システムという)を運用している。両システムの概要を表1に示す。\n〔キャパシティ管理の概要〕\n運用課では，次のキャパシティ管理を行っている。\nキャパシティ監視\nキャパシティ監視として，オンライン処理については，サーバのCPU使用率，トランザクション要求件数及び応答時間を監視している。バッチ処理については，サーバのCPU使用率，ストレージの使用率及び処理の終了状態を監視している。これらの監視でイベントを検知した場合には，運用チーム宛てにメッセージが出力される。イベントには三つのイベントタイプがあり，出カメッセージには，そのうち一つを設定する。イベントタイプの概要とイベント監視例を表2に示す。\nキャパシティ計画\n両サービスは，サービス開始から7年が経過している。サービス開始当初から，運用課では，次の手順でキャパシティ計画を策定している。\n製造部と営業部から両サービスに対する将来の利用計画を入手し，両サービスの利用者数，トランザクション要求件数，ストレージ使用量などを需要予測として求め，オンライン処理とバッチ処理のリソースの使用量を見積もる。\n見積もった使用量とサービスレベル目標値を基に，毎年，今後3年間を見通したサービスコンポーネントのキャパシティを計画する。必要に応じて，キャパシティを増強するための方式を計画する。\nなお，本年のキャパシティ計画で\"3年後に現在より2割の売上の増加\"の見込みから求められる需要予測に対して，2年後にはキャパシティが不足することが判明した。現在使用しているサーバ機器などのハードウェアは，既に販売中止となっていてキャパシティの増強ができないので，両システムのシステム更改を検討している。\n〔生産管理サービスで発生したインシデント〕\nある日，販売管理サービスのHバッチの正常終了時刻が13時15分となり，この影響で13時05分から10分間，生産管理サービスの応答時間が遅延するインシデントが発生した。インシデントの発生状況を表3に示す。\nその後，今回のインシデント対応についての振返り会議が開催された。その内容は次のとおりであった。\nHバッチのストレージ使用量が増加した原因は，前日の注文データに大ロ顧客からの一括注文が含まれていたことである。\nインシデント対応としては，両サービスの応答時間の遅延を発生させないために，リソース使用率の状況を注視しながら，Hバッチのデータ量を操作することになる。\nこの対応を行うと，Hバッチの正常終了時刻が13時30分以降となる場合があるので，その場合に備えて\n①翌日の工場での製造に支障が生じないように，運用課が場を設定して製進部と営業部とともに協議を行う\n必要がある。\n振返り会議の内容を受けて，C課長は，今後，Hバッチの処理中にSメッセージが複数回出力されるというイベントを規定した上で，\n②このイベントに適切なイベントタイプを設定すること\nにした。\nC課長は，今回のキャパシティ不足の事象に対して，早急に根本的な対策が必要と考えた。そこで，C課長は，D君に，システム更改の検討を急ぐよう指示した。\n〔クラウドサービスの調査〕\nD君は，システム更改の検討の中で，クラウドサービスについて調査した。クラウドサービスは，利用者のリソースの使用量に応じて柔軟にリソースを追加・削除できる。なお，両システムのミドルウェアの仕様に関する指定があることから，IaaS型のクラウドサービスの採用が適していることを確認した。\nD君は，複数のクラウド事業者にヒアリングし，F社のクラウドサービス(以下，Fクラウドという)を候補として選定した。Fクラウドの概要は次のとおりである。\nFクラウドでは，サーバとストレージのリソースは，利用者の要求に応じて動的に割り当てること(以下，リソースオンデマンドという)ができる。\nFクラウドには，キャパシティに応じてF1からF5までの契約モデルがあり，クラウド利用料が異なる。\nF社からは，リソースオンデマンド用の管理ツールとその利用権限が利用者に与えられる。管理ツールを利用すると瞬時に契約モデルのキャパシティを超えてリソースが増強され，リソース増強に見合ったクラウド利用料が加算される。増強されたリソースが不要になれば，管理ツールを利用して元のキャパシティに戻すことができる。\nD君は，C課長にFクラウドについて説明した。その時のC課長とD君の会話を次に示す。\nC課長:\nHバッチのストレージ使用量の増加に起因する正常終了時刻の遅延を発生させないようにするには，Fクラウドではどのような対応となりますか。\nD君:\n運用チームが\na\nした時点でリソースオンデマンド用の管理ツールを使って，ストレージの容量を増強します。\nC課長:\n了解しました。ただし，\n③Hバッチが正常終了した時点で実施すべきことがある\nので留意してください。\nC課長は，Fクラウドの導入を決定し，これによって現状のキャパシティに関する問題点を解決できると考えた。また，今月の経営会議で新製品の販売を早期化することが決定され，販売管理サービスの需要増加が見込まれた。そこで，C課長はFクラウドの契約モデルについて適切に決定していくプロセスが必要と考え，D君に対して，\"契約モデルを決定していく前提となるので，事業環境の変化を踏まえ，\nb\nを見直すこと。その上で，Fクラウドの特性も踏まえつつ，両サービスの新たな\nc\nを策定すること。\"と指示した。\n\n【設問1】\n\n〔生産管理サービスで発生したインシデント〕について答えよ。\n本文中の\n下線①\nについて，この場で協議する内容は何か。25字以内で答えよ。\n本文中の\n下線②\nについて，どのように設定するのか。15字以内で答えよ。\n\n【設問2】\n\n〔クラウドサービスの調査〕について答えよ。\n本文中の\na\nに入れる適切な内容を，〔生産管理サービスで発生したインシデント〕に記載の字句を用いて，15字以内で答えよ。\n本文中の\n下線③\nについて，実施内容とその理由をそれぞれ20字以内で答えよ。\n本文中の\nb\nに入れる適切な内容を，本文中の字句を用いて，25字以内で答えよ。\n本文中の\nc\nに入れる適切な内容を，本文中の字句を用いて答えよ。",
    "back": "【正解】 ・前日の注文情報に基づく翌日の生産計画 (18文字)・バッチ処理遅延による製造部への業務影響と対策 (22文字), 例外になるように設定する, Sメッセージの出力を認識, 増強したストレージ容量を元に戻す, クラウド利用料が加算されるから, 需要予測に基づくリソースの使用量の見積り, キャパシティ計画\n\n【解説】\n解説\nHバッチ処理が製造に与える影響に関し、本文中には以下の記述があります。\nHバッチの処理結果は，生産管理システムの生産計画案生成バッチ処理（Pバッチ）の入力情報となる\nHバッチの処理結果は，翌日の生産計画に反映する必要があるので，当日の13時30分までに生産管理システムに送信している\n今回検討されたインシデント対応は、応答時間の目標値を遵守するためにリソースの使用量を制限しながらHバッチを実行するというものです。この対応では、応答時間の要件は満たせますが、Hバッチの処理時間が長くなり13時30分までに終わらなくなってしまう課題があります。\n生産管理システムではPバッチが登録されており、13時30分までにHバッチの処理結果が入力されることが前提となっていると考えられます。今回のインシデント対応を実施した場合、13時30分以降にずれ込む可能性があるため、製造部との間で、Pバッチの実行時刻と翌日の生産計画を策定するタイミングについて事前に擦り合わせておく必要があります。\nまた、Hバッチの終了が遅れて生産計画案の作成が後ろにずれ込むと、当日から翌日に向けた段取り・指示・資材手配など、製造現場の業務遂行に支障がでる可能性があります。このため、その影響と対策について協議を行うことが考えられます。\n∴・前日の注文情報に基づく翌日の生産計画\n・バッチ処理遅延による製造部への業務影響と対策\n※模範解答では「生産部」となっていますが、本文中に記述がないため「製造部」の誤りだと思われます。\n設問の論点は、「Hバッチ中にSメッセージ（ストレージ使用率しきい値超え）が複数回出る状況」を、従来どおり\"警告\"のまま扱うのではなく、どのイベントタイプに再定義すべきかです。表2には\"例外\"・\"警告\"・\"情報\"の3つのイベントタイプがあるので、この3つから適切なものを選択します。\n今回のインシデントを整理すると、まず12:40と12:50にSメッセージ（\"警告\"）が発生し、運用側はあらかじめ決められた対応である「バッチを手動で中断→臨時のストレージ割当→再開」の対応を取りました。しかし、その後13:00にCPUが高負荷となり、13:05による応用時間の遅延により\"例外\"のイベントが出力されてからようやくインシデント解決チームが編成されています。結果として、Hバッチの処理遅延と応答時間が低下が生じています。\nJIS Q 20000では、インシデントを「サービスに対する計画外の中断，サービスの品質の低下，又は顧客若しくは利用者へのサービスにまだ影響していない事象」と定義しており、利用者に直接の影響が出ていない段階でも、放置すればサービスに悪影響を及ぼす可能性が高い出来事もインシデントに含まれます。今回の事象を踏まえると、本来はSメッセージが複数回出力されている時点でインシデント（\"例外\"）として扱い、インシデントチームの編成が必要であったと判断できます。したがって、解答は「例外として設定する」となります。\n∴例外になるように設定する\n\n---\n\n解説\n〔\na\nについて〕\nHバッチのストレージ使用量の増加に起因する正常終了時刻の遅延を防ぐために、ストレージの増強を行うタイミングが問われています。\n表3には「運用チームが，ストレージ使用率のしきい値超えを示す\"警告\"のイベント監視のメッセージ(以下，Sメッセージという)…の出力を認識した」とあります。つまり、Hバッチのストレージ使用量の増加はSメッセージの出力により把握が可能です。このタイミングでストレージの容量を増強すれば、処理の遅延を防ぐことができます。\nなお、「Sメッセージを複数回認識のイベント（\"例外\"）が出力されたとき」という解答も考えられますが、このイベントは現行システムでのワークアラウンド的な対応に過ぎません。クラウドサービス移行後は、Sメッセージが1回出力された段階で対応することが、バッチ処理の遅延と応答時間の低下について根本的な解決につながります。\n∴\na\n＝Sメッセージの出力を認識\nFクラウドの概要には次の説明があります。\n管理ツールを利用すると瞬時に…リソースが増強され，リソース増強に見合ったクラウド利用料が加算される\n増強されたリソースが不要になれば…元のキャパシティに戻すことができる\nFクラウドに移行後は、Hバッチの処理中にストレージ不足の兆候（Sメッセージ）が出た場合、運用チームがリソースオンデマンド機能によりストレージを増強します。キャパシティ管理の目標は「需要を満たすのに十分な能力を計画・提供すること」ですから、Hバッチ終了後は、不要になったストレージ容量を元に戻す手順を定めておく必要があります。理由は、追加利用料や遊休リソースの発生を回避するためです。\n∴実施内容＝増強したストレージ容量を元に戻す\n理由＝クラウド利用料が加算されるから\n〔\nb\nについて〕\n販売管理サービスの需要増加の見込みを受けて、Fクラウドの契約モデルの決定に関して見直すべき事項が問われています。\nA社では次の手順でキャパシティ計画を策定しています。\n将来の利用計画を入手し，それを需要予測として求め，オンライン処理とバッチ処理のリソースの使用量を見積もる\n見積もった使用量とサービスレベル目標値を基にキャパシティを計画する\nつまり、需要予測を基にリソースの使用量を算出し、その結果を計画に反映する流れになっています。今回の経営会議の決定により事業環境が変化し、キャパシティ計画の前提となる需要予測も変化するため、それをキャパシティ計画に反映する必要があります。\n見直すべき内容としては、需要予測、リソースの使用量、キャパシティ計画の3つが想定されます。ここで空欄bの直前にある「契約モデルを決定していく前提となる」という記載、また「クラウドサービスは，利用者のリソースの使用量に応じて柔軟に…追加・削除できる」点を踏まえると、3つのうち「リソースの使用量」が最も妥当します。したがって、空欄bには「需要予測に基づくリソースの使用量の見積り」が入ります。\n∴\nb\n＝需要予測に基づくリソースの使用量の見積り\n〔\nc\nについて〕\n現在のキャパシティ計画は、オンプレミス環境を前提としたものです。本文中には「C課長は，Fクラウドの導入を決定した」とありますから、クラウドサービスの利用を前提としたキャパシティ計画へ改める必要があります。\nオンプレミスの『固定容量＋増強は購買・入替えで』という考え方と、クラウドの『需要に応じて柔軟に容量を増減できる』という考え方では、そもそも計画の立て方が大きく異なってきます。そのため、更新ではなく、新規で両サービスのキャパシティ計画を策定する必要があると読み取れます。これは空欄c直前の「新たな」と合致します。したがって、空欄cには「キャパシティ計画」が当てはまります。\n∴\nc\n＝キャパシティ計画\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm10.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm10.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問10(サービスマネジメント)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問11　システム監査】\n\n勤務管理に関連するシステムの監査について，次の記述を読んで，設問に答えよ。\n小売業を営むW社では，本社及び支社の部署，店舗など(以下，部店という)で，合計約3,000人の従業員が勤務している。従業員の勤務日，勤務時間帯などは，所属する部店，職種などによって異なっており，勤務管理システムで管理している。勤務管理システムは，人事管理システム，給与計算システムなどと連携しており，勤務形態の多様化，連携するシステムの改変などに伴って，随時保守が必要である。勤務管理に関連するシステムの概念図を図1に示す。\n内部監査部長は，システム監査チームに対して，勤務管理に関連するシステムを監査するよう指示した。システム監査チームは，X年5月に予備調査を行い，次の事項を把握した。\n〔勤務管理の概要〕\n人事部は，勤務管理規程に基づき，従業員一人当たりの毎月の標準勤務時間を部店別及び職種別に定め，全社勤務時間管理表に記載している。標準勤務時間は，例えば，営業企画部の企画職では，1月180時間，2月165時間，店舗の販売職では，1月140時間，2月130時間，店舗の事務職では，1月160時間，2月150時間などである。\n標準勤務時間を超過した勤務時間(以下，超過勤務時間という)に対しては，給与規程に定めた超過勤務手当が支払われる。\n従業員の毎月の勤務日数，勤務時間などの記録(以下，勤務記録という)は，翌月7日を確定日としている。\nTRに従業員用ICカードを読み取らせることによって，従業員が部店に入室した時刻(以下，TR開始時刻という)及び部店から退室した時刻(以下，TR終了時刻という)がTR管理システムに登録される。\n従業員は，TR開始時刻及びTR終了時刻を参考にして，勤務記録の確定日までに，勤務開始時刻及び勤務終了時刻を勤務管理システムに登録する。\n人事部は，一部の従業員について，X年10月からテレワークでの勤務を認める予定である。テレワークでの勤務の場合，従業員は，PCの稼働開始時刻(以下，PC開始時刻という)及び稼働終了時刻(以下，PC終了時刻という)を参考にして，勤務開始時刻及び勤務終了時刻を勤務管理システムに登録する。\nX年10月からは，勤務形態について，例えば，次のような一定の組合せが認められる。\n8時～12時：部店勤務，13時～17時：テレワーク\n9時～11時：テレワーク，12時～15時：部店勤務，16時～18時：テレワーク\n〔勤務管理に関連するシステムの概要〕\n人事部は，全社勤務時間管理表に基づき，勤務管理システムに標準勤務時間を手作業で登録する。\n勤務管理システムは，TR管理システムからTR開始時刻及びTR終了時刻を日次バッチ処理で取り込み，従業員別の勤務実績画面に表示する。TR開始時刻と勤務開始時刻の差，又はTR終了時刻と勤務終了時刻の差が一定時間以上の場合，勤務実績画面に警告メッセージ(以下，時差確認メッセージという)を表示する。\n勤務管理システムのテレワーク対応では，PC管理システムからPC開始時刻及びPC終了時刻を日次バッチ処理で取り込み，勤務実績画面に表示する予定である。また，時差確認メッセージの表示条件は，\n①PC開始時刻と勤務開始時刻の差，又はPC終了時刻と勤務終了時刻の差が一定時間以上の場合\nなどを想定している。\n従業員の超過勤務時間は，人事管理システムから月次バッチ処理で連携された従業員の所属部店及び職種，人事部が登録した標準勤務時間に基づき，算出される。\n給与計算システムは，勤務記録の確定日の夜間バッチ処理で，勤務記録を勤務管理システムから取り込み，給与支給額を算出する。\n〔勤務管理に関連するシステム障害〕\nW社では，発生したシステム障害について，発生日，事象，重要度，直接原因，根本原因，暫定対応，恒久対応などを障害管理データベースに登録し，随時更新している。\n障害管理データベースを閲覧した結果，X年1月に，勤務管理に関連するシステム障害が発生していたことが分かった。X年2月末日時点における障害管理データベースの登録内容(抜粋)を表1に示す。\nさらに障害管理データベースを閲覧した結果，表1に示すシステム障害と同様の根本原因であるシステム障害がX年4月に再発していた。\n内部監査部長は，システム監査チームから予備調査の結果報告を受けて，X年7月に実施予定の本調査での監査手続について，次のとおり指示した。\n〔内部監査部長の指示〕\n勤務管理システムにおいて，標準勤務時間の登録が\na\nであることから，ITに係る\nb\nが適切に組み込まれているか，確認すること。\n〔勤務管理に関連するシステムの概要〕(3)において，時差確認メッセージの表示条件について，下線①のほかに，\nc\nの\nd\nを想定しているか，確認すること。\n〔勤務管理に関連するシステム障害〕(3)を考慮したとき，\ne\nシステムが，\nf\nを防止するために適切な内容で，\ng\nまでに改修されていたか，確認すること。\n\n【設問1】\n\n〔内部監査部長の指示〕(1)について，答えよ。\n本文中の\na\nに入れる適切な字句を，5字以内で答えよ。\n本文中の\nb\nに入れる適切な字句を，10字以内で答えよ。\n\n【設問2】\n\n〔内部監査部長の指示〕(2)について，答えよ。\n本文中の\nc\nに入れる適切な字句を，5字以内で答えよ。\n本文中の\nd\nに入れる適切な字句を，10字以内で答えよ。\n\n【設問3】\n\n〔内部監査部長の指示〕(3)について, 答えよ。\n本文中の\ne\nに入れる適切な字句を，5字以内で答えよ。\n本文中の\nf\nに入れる適切な字句を，15字以内で答えよ。\n本文中の\ng\nに入れる適切な字句を，10字以内で答えよ。",
    "back": "【正解】 手作業, 入力コントロール, 勤務形態, 一定の組合せ, 人事管理, 従業員の職種の誤登録, X年3月末日\n\n【解説】\n解説\n勤務管理に関連するシステムの運用、保守段階における監査を題材として、システム監査の着眼点と手続きについての基本的な理解が問われています。予備調査で把握された業務とシステムの概要を基にして、監査手続きの内容が問われる流れは例年通りですが、監査実施以前に発生した障害が絡んでいるのは目新しいところです。業務プロセス及び複数システム間のデータの流れは複雑でなく、問題文を丁寧に読み解けば、解答する語句をピックアップできる問題です。設問2に関しては答えを絞りづらい印象です。\n〔\na\nについて〕\n空欄aには「標準勤務時間の登録」に関する語句が入ります。また、空欄aの直後は「であることから」と続くため、「標準勤務時間の登録＝\na\n」となる字句が入ることがわかります。\n本文中から「標準勤務時間の登録」に関する記述を探すと、〔勤務管理に関連するシステム概要〕(1)に「人事部は，全社勤務時間管理表に基づき，勤務管理システムに標準勤務時間を手作業で登録する」と記述されています。予備調査で確認された表1の障害（人事システム）は、人事部の入力ミスが根本原因とされており、手作業での入力がある勤務管理システムに関しても同様のリスク要因があると読み取れます。したがって、空欄aには「手作業」が妥当します。\n∴\na\n＝手作業\n〔\nb\nについて〕\n空欄bには監査手続で確認すべきポイントが入ると考えられます。「a：手作業・・・」に続く文なので、手作業による入力ミスという会計処理上のリスクに対し、適切なリスク対応が業務プロセスに組み込まれているかどうかを検証することになります。\nITに係る業務処理統制の監査では、一般的に次の点が有効に整備・運用されているかの確認を行います。\n入力情報の完全性、正確性、正当性等が確保されているか\nエラーデータの修正と再処理の機能が確保されているか\nマスタ・データの正確性が確保されているか\nシステムの利用に関する認証・操作範囲の限定など適切なアクセス管理がなされているか\n表1によると、人事管理システムでは手作業が原因で発生した障害に対し、「職種に関する入力コントロール」を改修することで恒久対応としています。これは、手作業ミスへの対策として入力コントロールが有効であることを示しています。同じことが勤務管理システムにも当てはまるため、同様の入力コントロールが行われているかをチェックすることになります。したがって、空欄bには「入力コントロール」が妥当します。\n人事管理システムでは、システム改修後のX年4月にも同じような問題が起きており、入力コントロールへの対応が不十分であることが伺えるため、監査では優先的に調べるべきと言えます。\n∴\nb\n＝入力コントロール\n\n---\n\n解説\n〔\nc\nd\nについて〕\n〔内部監査部長の指示〕(2)は時差確認メッセージの表示条件に関するものなので、部店勤務とテレワークの場合でメッセージ表示条件を整理します。\n部店勤務\n：TR開始・終了時刻と勤務入力時刻の差が一定以上の場合\nテレワーク\n：PC開始・終了時刻と勤務入力時刻の差が一定以上の場合\n部店勤務だけ、もしくはテレワークだけで働く場合は、これらの表示条件で問題はありません。しかし、現状の勤務管理システムで従業員が入力するのは\"勤務開始時刻\"と\"勤務終了時刻\"だけであることから、(7)①②のように部店勤務とテレワークを組み合わせた働き方では、次のような問題が起こります。\n【①の場合】\n従業員は勤務開始時刻を8時、勤務終了時刻を17時で登録する。\nTR管理システムからTR時刻（開始13時、終了17時）を取り込んだ際、TR開始時刻と勤務開始時刻が離れているためメッセージが表示される\nPC管理システムからPC時刻（開始8時、終了12時）を取り込んだ際、PC終了時刻と勤務終了時刻が離れているためメッセージが表示される\n【②の場合】\n従業員は勤務開始時刻を9時、勤務終了時刻を18時で登録する。\nTR管理システムからTR時刻（開始12時、終了15時）を取り込んだ際、開始と終了の両方に対してメッセージが表示される\nPC管理システムからPC時刻（開始9時、終了11時）を取り込んだ際、PC終了時刻と勤務終了時刻が離れているためメッセージが表示される。PC管理システムからPC時刻（開始16時、終了18時）を取り込んだ際、PC開始時刻と勤務開始時刻が離れているためメッセージが表示される\nテレワーク勤務はX年10月から始まる予定で、現在（X年5月）時点ではまだ行われていません。もし勤務管理システムが部店勤務とテレワークを組み合わせた働き方を想定していない場合、前述のような警告メッセージが繰り返し表示される可能性があります。内部監査部長が懸念しているのはこの点であると考えられます。\n勤務管理システムをテレワークに対応させるには、1日の中で複数の勤務形態で働く場合に、勤務形態ごとの開始・終了時刻を従業員に入力させ、それを取り込んだ時刻と照合するなど特別な仕組みが必要です。以上より、勤務管理システムのテレワーク対応における時差確認メッセージの表示条件で想定すべきものとは、「勤務形態」が「一定の組合せ」の場合であると結論付けられます。\n∴\nc\n＝勤務形態\nd\n＝一定の組合せ\n\n---\n\n解説\n空欄eには改修の必要があるとされたシステムの名称が、空欄fにはシステム改修の目的が、空欄gにはシステムの改修期限がそれぞれ入ります。\n〔\ne\nf\n〕\n表1を見ると、障害の内容は、給与計算システムで誤った給与支払額が計算されたことです。障害の直接の原因となったのは、勤務管理システムから給与計算システムに連携された超過勤務時間のデータですが、その根本原因は「人事部が、人事システムに一部の従業員の職種を誤登録したこと」とされています。これを受けた恒久対応として、人事管理システムにおいて、従業員の職種に関する入力コントロールの改修が予定されていたことがわかります。\n空欄eに入るのは改修が必要であったシステムの名称なので「人事管理」、空欄fにはシステム改修の目的が入るので障害の根本原因である「従業員の職種の誤登録（を防止）」が妥当します。\n∴\ne\n＝人事管理\nf\n＝従業員の職種の誤登録\n〔\ng\n〕\n障害管理データベースには、従業員の職種に関する入力コントロールはX年3月末日までに改修する予定と登録されていました。しかし〔勤務管理に関連するシステム障害〕(3)では、X年4月にも同様の根本原因であるシステム障害が再発したことが明らかになっています。予定どおりに適切な改修が実施されていれば、再発は起こらなかったはずです。このことから、改修が予定どおり行われていない、または改修内容が不十分だった可能性を疑うことになります。したがって、空欄gには改修の期限とされていた「X年3月末日」が妥当します。\n∴\ng\n＝X年3月末日\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/pm11.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/pm11.html",
    "title": "応用情報技術者過去問題 令和7年春期 午後問11(システム監査)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "論理式P，Qがいずれも真であるとき，論理式Rの真偽にかかわらず真になる式はどれか。ここで，\"￣\"は否定，\"∨\"は論理和，\"∧\"は論理積，\"→\"は含意(\"真→偽\"となるときに限り偽となる演算)を表す。\n\n---\n【選択肢】\nア: ((P→Q)∧(Q→P))→(R→Q)\nイ: ((P→Q)∧(Q→P))→(Q→R)\nウ: ((P→Q)∨(Q→P))→(R→Q)\nエ: ((P→Q)∨(Q→P))→(Q→R)",
    "back": "【正解】 エ\n\n【解説】\nP、Qに真を代入し、次の関係を利用して式を展開していきます。\n真→偽：偽\n真→真、偽→真、偽→偽：真\n((真→真)∧(真→真))→(R→\n真\n)\n＝((真→真)∧(真→真))→(R→偽)\n＝(真∧真)→(R→偽)\n＝真→(R→偽)\nRが真：\"R→偽\"は偽、式全体も\"真→偽\"で偽となります。\nRが偽：\"R→偽\"は真、式全体も\"偽→真\"で\n真\nとなります。\n((真→真)∧(\n真→\n真\n))→(真→R)\n＝((真→真)∧(\n真→偽\n))→(真→R)\n＝(真∧真)→(真→R)\n＝真→(真→R)\nRが真：\"真→R\"は真、式全体も\"真→真\"で\n真\nとなります。\nRが偽：\"真→R\"は偽、式全体も\"真→偽\"で偽となります。\n((真→\n真\n)∨(真→真))→(R→\n真\n)\n＝((真→偽)∨(真→真))→(R→偽)\n＝(偽∨真)→(R→偽)\n＝真→(R→偽)\n「ア」と同じ式となるため誤りです。\n((真→\n真\n)∨(真→\n真\n))→(真→R)\n＝((真→偽)∨(真→偽))→(真→R)\n＝(偽∨偽)→(真→R)\n＝偽→(真→R)\nRが真：\"真→R\"は真、式全体も\"偽→真\"で\n真\nとなります。\nRが偽：\"真→R\"は偽、式全体は\"偽→偽\"で\n真\nとなります。\n左辺が\"偽\"となるため、右辺の真偽に関わらず式全体の結果は常に真となります。したがって正解の式です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q1.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q1.html",
    "title": "応用情報技術者令和7年春期問1 論理演算｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "オブジェクトストレージの特徴として，適切なものはどれか。\n\n---\n【選択肢】\nア: オブジェクトにはユニークな識別子が割り当てられ，識別子を使ってアクセスする。\nイ: オブジェクトの内容を更新する際，上書き更新をする。\nウ: 広域分散を実現するためには，遠隔地のストレージと静止点を設けて同期を行う必要がある。\nエ: ストレージはディレクトリの概念を使った階層構造である。",
    "back": "【正解】 ア\n\n【解説】\nオブジェクトストレージ\nは、従来のファイルやディレクトリと言った階層構造ではなく、オブジェクトという単位でデータを格納・管理する記憶方式です。フラットな構造でスケールアウトが容易なので、非構造型データを大量に保存するデータレイクに適しています。AmazonS3がオブジェクトストレージの代表格です。\n各オブジェクトは、データ本体とともにメタデータと固有の識別子が付与された状態で格納されています。階層構造がないので、①データの複製、移動、分散がしやすい、②効率的にアクセスできる、③ディレクトリ数やデータ数の制限を受けないといった特徴があります。また、オブジェクトストレージには識別子を指定してREST API（HTTP）でアクセスします。このため、利用者は格納場所を覚えておく必要がなく、様々なプラットフォームから共通の手順でデータ操作を行うことができます。\n正しい。オブジェクトごとに一意な識別子（Object ID、UUIDなど）が付与され、その識別子を指定してアクセスします。\n原則としてオブジェクトの上書き更新はできません。データの更新が行われれると、同じキーに対する新しいバージョンのデータとして保存されます。以前のバージョンのデータも削除されることなく保持されるため、過去のデータを後から参照または復元することも可能です。\n分散オブジェクトストレージにおけるデータの同期は、リアルタイムではなく非同期に行われます。データの更新や削除が行われるとバックグラウンドで順次データを転送し、最終的には一致するという「結果整合性」の形をとります。\nオブジェクトストレージはファイルストレージのような階層構造を持たず、全てのオブジェクトがフラットな名前空間に格納されます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q10.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q10.html",
    "title": "応用情報技術者令和7年春期問10 オブジェクトストレージの特徴はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "マルチプロセッサによる並列処理で得られる高速化率(単一プロセッサのときと比べた倍率)Eを，次の式によって評価する。r＝0.9のアプリケーションの高速化率がr＝0.3のものの3倍となるのは，プロセッサが何台のときか。\nE＝\n1\n1－r＋\nr\nn\nここで，\nn：プロセッサの台数(1≦n)\nr：対象とする処理のうち，並列化が可能な部分の割合(0≦r≦1)\nとし，並列化に伴うオーバーヘッドは考慮しないものとする。\n\n---\n【選択肢】\nア: 3\nイ: 4\nウ: 5\nエ: 6",
    "back": "【正解】 エ\n\n【解説】\nプログラムには並列処理が可能な部分とそうでない部分が混在しています。マルチプロセッサによる並列処理では、並列処理が可能な部分が多いほどプロセッサ数の増加による高速化が望めます。つまり、同じプロセッサ台数でも並列化可能な部分の割合（r）によって高速化率は変化ということです。\n本問では、①90%が並列化可能なプログラム（r＝0.9）と、②30%が並列化可能なプログラム（r＝0.3）を想定し、①の高速化率が、②の3倍となるプロセッサ数を問うています。プロセッサ数nを求めるには、設問の式にそれぞれrを代入したものを方程式にすればよいです（r＝0.3のほうは3倍します）。\n3×\n1\n1－0.3＋0.3／n\n＝\n1\n1－0.9＋0.9／n\n3×\n1\n0.7＋0.3／n\n＝\n1\n0.1＋0.9／n\n3×(0.1＋0.9／n)＝0.7＋0.3／n\n0.3＋2.7／n＝0.7＋0.3／n\n2.4／n＝0.4\n2.4＝0.4n\n6＝n\n以上の計算結果より、プロセッサが6台のとき条件を満たすことがわかります。したがって正解は「エ」です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q11.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q11.html",
    "title": "応用情報技術者令和7年春期問11 並列処理で得られる高速化率｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "二つのシステムA，Bの稼働率をそれぞれα\nA\n(0＜α\nA\n＜1)，α\nB\n(0＜α\nB\n＜1)，MTBFをそれぞれMTBF\nA\n，MTBF\nB\n，MTTRをそれぞれMTTR\nA\n，MTTR\nB\nとしたとき，これらの関係として，常に成り立つものはどれか。\n\n---\n【選択肢】\nア: αA＝αBならば，MTBFA＝MTBFBであり，かつMTTRA＝MTTRBである。\nイ: αA＝αBならば，MTTRA／MTBFA＝MTTRB／MTBFBである。\nウ: αA＞αBならば，MTBFA＞MTBFBであり，かつMTTRA＞MTTRBである。\nエ: αA＞αBならば，MTTRA／MTBFA＞MTTRB／MTBFBである。",
    "back": "【正解】 イ\n\n【解説】\n「MTBF＝95、MTTR＝5」と「MTBF＝950、MTTR＝50」のいずれも稼働率95％となるように、稼働率が同じであってもMTBFとMTTRの絶対値が同じであるとは限りません。\n正しい。稼働率αが同じということは、MTBFとMTTRの比が等しいということです。この関係を比例式で表すと、\nMTTR\nA\n：MTBF\nA\n＝MTTR\nB\n：MTBF\nB\nこの式より、\nMTTR\nA\nMTBF\nA\n＝\nMTTR\nB\nMTBF\nB\nが導かれます。\n【別解】\n稼働率を求める式を変形すると以下のようになります。この式より、稼働率αが同じならばMTTR／MTBFは一定になることがわかります。\nα＝\nMTBF\nMTBF＋MTTR\n⇒\nMTTR\nMTBF\n＝\n1－α\nα\n稼働率αが高くても、MTBFとMTTRがともに高いとは限りません。例えば「MTBF＝180、MTTR＝20」は稼働率90％ですが、どちらも小さい「MTBF＝95、MTTR＝5」の稼働率95％に劣ります。\n稼働率はMTBFが長く、MTTRが短いほど高くなるので、稼働率αの高いほうがMTTR／MTBFの値は小さくなります。不等号が逆なので誤りです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q12.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q12.html",
    "title": "応用情報技術者令和7年春期問12 稼働率、MTBF、MTTRの関係｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "図のように3個の装置を並列と直列に組み合わせて構成したシステムがある。装置単体の稼働率と，システムの稼働率の関係を示したグラフはどれか。ここで，3個の装置の稼働率は，全て等しいものとする。\n\n---\n【選択肢】\nア: \nイ: \nウ: \nエ: ",
    "back": "【正解】 エ\n\n【解説】\n装置単体での稼働率をRとした場合、直列に接続されている部分の稼働率は\nR\n2\n、並列に接続されている部分の稼働率は\n1－(1－R)\n2\nとなります。\n設問の構成では、左側2台の装置が並列接続されており、その部分がさらに右側1台の装置と直列接続されているので、システム全体の稼働率αを求める式は、次のとおりです。\nα＝(1－(1－R)\n2\n)×R\n関係性を明らかにするため、装置単体の稼働率が0.1、0.5、0.9のそれぞれの場合についてシステムの稼働率を求めます。\nR = 0.1\n(1－(1－0.1)\n2\n)×0.1 = (1－0.81)×0.1 = 0.19×0.1 =\n0.019\nR = 0.5\n(1－(1－0.5)\n2\n)×0.5 = (1－0.25)×0.5 = 0.75×0.5 =\n0.375\nR = 0.9\n(1－(1－0.9)\n2\n)×0.9 = (1－0.01)×0.9 = 0.99×0.9 =\n0.891\n計算結果より、全てのケースにおいて「システムの稼働率＜装置単体の稼働率」となることがわかります。\n右側の装置が直列に接続され、左側の並列構成部分の稼働率が常に1未満であるため、システム全体の稼働率は装置単体の稼働率よりも低くなると考えることができます。\nしたがって「エ」のグラフが適切です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q13.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q13.html",
    "title": "応用情報技術者令和7年春期問13 稼働率の関係を示したグラフ｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "リアルタイムOSにおいて，実行中のタスクがプリエンプションによって遷移する状態はどれか。\n\n---\n【選択肢】\nア: 休止状態\nイ: 実行可能状態\nウ: 終了状態\nエ: 待ち状態",
    "back": "【正解】 イ\n\n【解説】\nプリエンプション\n(Preemption)とは、実行状態にあるタスクがCPUの使用権を奪われ\n実行可能状態\nに移されることをいいます。\nプリエンプションは、以下のいずれかの状態になると発生します。\n実行状態のタスクより優先度の高いタスクが実行可能状態になる\n実行状態のタスクに割り当てられたCPU使用時間が終了する\nプリエンプションによって遷移する状態は「実行可能状態」です。したがって「イ」が正解です。\nOSがCPUやシステム資源を管理し、CPU使用時間や優先度などによって複数のタスクを実行状態や実行可能状態へ切替えながら実行していくマルチタスク方式をプリエンプション方式といいます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q14.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q14.html",
    "title": "応用情報技術者令和7年春期問14 プリエンプションで遷移する状態｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "仮想記憶管理におけるページ置換えアルゴリズムとしてLRU方式を採用する。主記憶のページ枠が，4000，5000，6000，7000番地(いずれも16進数)の4ページ分で，プログラムが参照するページ番号の順が，1→2→3→4→2→5→3→1→6→5→4のとき，最後の参照ページ4は何番地にページインされているか。ここで，最初の1→2→3→4の参照で，それぞれのページは4000，5000，6000，7000番地にページインされるものとする。\n\n---\n【選択肢】\nア: 4000\nイ: 5000\nウ: 6000\nエ: 7000",
    "back": "【正解】 ウ\n\n【解説】\nLRU\n(Least Recently Used)は、置換え対象の中で\n最後に参照されてからの時間が最も長いページ\nを置換え対象とするアルゴリズムです。\nページ枠の遷移を順を追って考えていきます。下記解説のページ枠は左から順に、4000、5000、6000、7000番地を表すものとします。\n最初の1→2→3→4までは設問の指示どおりにページインします。\n1\n2\n3\n4\n2の参照 - 2は主記憶に存在するので置換えは発生しません。\n5の参照 - 5は主記憶に存在しないので置換えが必要になります。4つのページのうち最も長い時間参照されていないページ（以下、対象ページという）は1なので、1がページアウトされ、5がページインします。\n5\n2\n3\n4\n3の参照 - 3は主記憶に存在するので置換えは発生しません。\n1の参照 - 1は主記憶に存在しないので置換えが必要になります。対象ページは4なので、4がページアウトされ、1がページインします。\n5\n2\n3\n1\n6の参照 - 6は主記憶に存在しないので置換えが必要になります。対象ページは2なので、2がページアウトされ、6がページインします。\n5\n6\n3\n1\n5の参照 - 5は主記憶に存在するので置換えは発生しません。\n4の参照 - 4は主記憶に存在しないのでページ置換えが必要になります。対象ページは3なので、3がページアウトされ、4がページインします。\n5\n6\n4\n1\n操作終了時点でページ4は左から3番目、つまり6000番地にページインしています。したがって「ウ」が正解です。\n下図はページ枠の状態、最後に参照されてからの経過時間、ページ置換えの詳細を示した図解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q15.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q15.html",
    "title": "応用情報技術者令和7年春期問15 LRU方式｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "表はOSSのライセンスごとに，そのOSSを利用したプログラムを配布するとき，ソースコードを公開しなければならないかどうかを示す。a～dに入れるライセンスの適切な組合せはどれか。ここで，表中の\"○\"は公開しなければならないことを表し，\"×\"は公開しなくてもよいことを表す。\n\n---\n【選択肢】\nア: イウエ",
    "back": "【正解】 ア\n\n【解説】\nそれぞれのOSSライセンスの特徴をまとめておきます。\nGPL（General Public License）\nリチャード・ストールマン氏が創設したFSF(Free Software Foundation)が、GNUプロジェクトのために策定したフリーソフトウェアライセンス。ライセンスを受けた利用者に対し、①プログラムを自由に実行すること、②その仕組みを調べて改変すること、③複製物を再頒布すること、④改良したプログラムを公衆に向けて公開すること、という4つの自由を保障する。\nGPLでライセンスされたライブラリに静的／動的にリンクする場合、当該プログラムは二次的著作物とみなされて自動的にGPLの条件が適用されるため、利用者に頒布する際に\nリンク元プログラムにもソースコードの開示義務が生じる\n。非常に強いコピーレフト性をもつ。\nLGPL（Lesser General Public License）\nGPLから派生したライセンスで、非常に厳格なGPLの条件を一部緩和したライセンス。他のプログラムにリンクされることを前提としたライブラリのために作成された。\n改変や再コンパイルの自由、二次著作物を再頒布する際のソースコードの公開などはGPLと同等だが、ライブラリを他のプログラムから動的リンクして使用する場合において以下の条件を満たせば、リンク元プログラムにはLGPLが適用されない。\n動的リンク：リンク元プログラムのリバースエンジニアリングを許可する（禁止する条項を含めてはならない）\n静的リンク：動的リンクの条件に加えて、本体プログラムのソースコードまたはオブジェクトコードを公開する。\nMPL（Mozilla Public License）\nネットスケープコミュニケーションズに策定され、Mozilla Foundationによって管理されている作成されたOSSライセンス。\nGPLと比較した場合、MPLはコピーレフトの適用範囲が限定的であり、より柔軟なライセンス形態とされる。GPLがプログラム全体にソースコードの開示を求めるのに対し、MPLは改変された個別のファイル単位でのソースコードの公開を求める点が、主な相違点である。また、静的／動的リンクするプログラムはライセンス適用の対象外となる。\nBSD\nカリフォルニア大学バークレー校によってBSD UNIXとともに開発されたOSSライセンス。\nソースコードを改変・再頒布することが許可されており、著作権表示、ライセンス条文、無保証である旨の3点をドキュメント等に明記すれば、ソースコードを公開せずにバイナリ形式で頒布することが可能となっている。より「緩やかな」ライセンスであり、商用ソフトウェアへの組込みやライセンス変更を制限しない。\n各ライセンスのプログラムについて、利用方法とソースコードの公開義務をまとめると下表のようになります。\n以上より適切な組合せは「ア」になります。\nOSSには非常に多くのライセンスがあるので、各ライセンスの詳細な内容までは把握しきれないかもしれませんが、GPLは最もコピーレフト性が強い、BSDは緩いくらいは覚えておきましょう。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q16.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q16.html",
    "title": "応用情報技術者令和7年春期問16 OSSライセンスの適切な組合せ｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "Open API Specificationに従ったAPIの定義・開発を支援する機能を提供するOSSはどれか。\n\n---\n【選択肢】\nア: curl\nイ: OpenAM\nウ: Serverspec\nエ: Swagger",
    "back": "【正解】 エ\n\n【解説】\ncurl(カール)は、HTTP/HTTPSのリクエストをコマンドラインから送信するオープンソースのクライアントツールです。多くのOSに標準で搭載されています。\nOpenAMは、認証・認可・フェデレーション等の機能を備え、Web上でシングルサインオン（SSO）を実現するOSSです。多くの認証方式をサポートしています。\nServerspecは、コマンドラインからサーバの設定状態やサービスの稼働状況を自動的に検証するオープンソースのテストツールです。\n正しい。\nSwagger\n(スワッガー)は、Web APIの設計・記述・管理を支援するオープンソースのツール群です。以下のような機能が提供されます。\nSwagger Editor\n：OpenAPI仕様に準拠したAPI定義を作成、編集、視覚化できる\nSwagger UI\n：API定義をもとに生成されたAPIドキュメントをWebブラウザで確認し、探索・テストできる\nSwagger Codegen\n：API定義からクライアント／サーバのコード、APIドキュメントのコードを生成する\n参考URL：e-Gov 法令API Version 2（Swaggerで作成されたAPIドキュメント）\nhttps://laws.e-gov.go.jp/api/2/swagger-ui/\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q17.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q17.html",
    "title": "応用情報技術者令和7年春期問17 Open API Specification｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "8ビットD/A変換器を使って，負でない電圧を発生させる。使用するD/A変換器は，最下位の1ビットの変化で出力が10ミリV変化する。データに0を与えたときの出力は0ミリVである。データに16進数で82を与えたときの出力は何ミリVか。\n\n---\n【選択肢】\nア: 820\nイ: 1,024\nウ: 1,300\nエ: 1,312",
    "back": "【正解】 ウ\n\n【解説】\nD/A変換器では、マイコンやプロセッサなどのデジタル回路がポート（I/O端子）にビット列を書き込むことで、出力を制御します。設問では16進数で82をD/A変換器に書き込んだときの出力電圧が問われています。\nまず、設問の条件を整理すると次のようになります。\nデータ0のとき ⇒ 出力0ミリV\n最下位の1ビット（LSB）の変化で10ミリV変化 ⇒ 分解能\n※\nは10ミリV\n※\nD/A変換器が区別できる最小の電圧差\nD/A変換器の出力電圧は入力されたデジタル値に比例するため、設問のD/A変換器の場合、1を与えれば10ミリV、2を与えれば20ミリVというように、0をベースとして1ビット大きくなるごとに出力電圧は10ミリVずつ増加することがわかります。\n次に、16進数82が0から何ビット大きいかを考えます。16進数82を2進数（ビット列）に変換すると1000 0010となります。これは10進数の130（2\n7\n＋2\n1\n＝128＋2）に相当します。\n16進数82は0ビットから130だけ大きいので、この値が入力された場合の出力電圧は以下のように求められます。\n10ミリV×130＝1,300ミリV\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q18.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q18.html",
    "title": "応用情報技術者令和7年春期問18 D/A変換器｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "産業機器の制御装置として使われるPLCの記述として，適切なものはどれか。\n\n---\n【選択肢】\nア: 自動制御であり，偏差の比例，積分及び微分の3要素で制御する。\nイ: 主としてラダー図を用いたシーケンスプログラムによって制御する。\nウ: 電圧及び電流のアナログ信号をデジタル信号に変換する。\nエ: リレーシーケンス回路のハードウェアによって制御する。",
    "back": "【正解】 イ\n\n【解説】\nPLC\n(Programmable Logic Controller)は、リレーやタイマーを用いた制御回路の代替として開発された産業用の制御装置で、従来はハードウェアで行っていた制御をソフトウェアによって実現できるようにしたものです。一般的には「シーケンサー」と呼ばれますが、これはPLCの代名詞となっている三菱電機のPLCの商品名です。\nPLCのプログラムは、電気制御の論理を視覚的に表現したものであり、ラダー図（リレー回路の論理を模した図）や状態遷移図（工程や動作の段階を表す図）などを用いて記述されます。これにより、回路設計の知識を持つ技術者が、直感的に制御プログラムを作成できるようになっています。\nフィードバック制御の一種であるPID制御の説明です。\n正しい。PLCの説明です。\nA/D変換器の説明です。\nハードウェア制御の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q19.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q19.html",
    "title": "応用情報技術者令和7年春期問19 PLCに関する記述｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "0≦x≦1の範囲で単調に増加する連続関数 ƒ(x) が ƒ(0)＜0≦ƒ(1) を満たすときに，区間内で ƒ(x)＝0 であるxの値を近似的に求めるアルゴリズムにおいて，(2)は何回実行されるか。\n〔アルゴリズム〕\nx\n0\n←0，x\n1\n←1とする。\nx←\nx\n0\n＋x\n1\n2\nとする。\nx\n1\n－x＜0.001ならばxの値を近似値として終了する。\nƒ(x)≧0ならばx\n1\n←xとして，そうでなければx\n0\n←xとする。\n(2)に戻る。\n\n---\n【選択肢】\nア: 10\nイ: 20\nウ: 100\nエ: 1,000",
    "back": "【正解】 ア\n\n【解説】\n設問の手順で連続関数のゼロ点を近似的に求めるアルゴリズムは「二分法」と呼ばれます。簡単に手順を示します。\n関数 ƒ(x) に対して、ƒ(a)＜0、ƒ(b)＞0 となるaとbを選ぶ\nc ←\na＋b\n2\nで区間の真ん中を求める\nƒ(c) を求め、誤差が条件内であればcを近似解とする\nƒ(c)＜0であればa ← c、ƒ(c)＞0であればb ← cとして手順2に戻る\n仮に ƒ(0.3)＝0 としてアルゴリズムを途中までトレースしていくと次のようになります。\n1: x\n0\n← 0，x\n1\n← 1\n2: x ← (0＋1)／2 = 0.5\n3: (1－0.5)＜0.001 は偽なので処理続行する\n4: ƒ(0.5)≧0 は真なので、x\n1\n← 0.5\n//(2)に戻る\n5: x ← (0 + 0.5)／2 = 0.25\n6: (0.5 - 0.25)＜0.001 は偽なので処理続行する\n7: ƒ(0.25)≧0 は偽なので、x\n0\n← 0.25\n8: x ← (0.25 + 0.5)／2  = 0.375\n9: (0.5 - 0.375)＜0.001 は偽なので処理続行する\n10: ƒ(0.375)≧0 は真なので、x\n1\n← 0.375\n//(2)に戻る\n11: x ← (0.25 + 0.375)／2  = 0.3125\n12: (0.375 - 0.3125)＜0.001 は偽なので処理続行する\n13: ƒ(0.3125)≧0 は真なので、x\n1\n← 0.3125\n//以下、続く\nこのアルゴリズムの流れを見ると、2分探索法のようにxの対象範囲を1／2ずつ狭めていっていることがわかります。\n1回目　0≦x≦0.5 (最大誤差0.5)\n2回目　0.25≦x≦0.5 (最大誤差0.25)\n3回目　0.25≦x≦0.375 (最大誤差0.125)\n4回目　0.25≦x≦0.3125 (最大誤差0.0625)\n終了条件は誤差0.001なので、誤差が1／1000未満になるまで(2)～(5)を繰り返すことになります。誤差は初期値を1とし、繰返しごとに2分の1ずつ小さくなるので、処理n回目での誤差は「1／2\nn\n」の式で表すことができます。\n2\n10\n＝1,024 であることを踏まえると、n＝10 のとき誤差0.001（1／1000）未満を達成できます。したがって「ア」が正解です。\n※補足としてJavaScriptによる実行例を示しておきます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q2.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q2.html",
    "title": "応用情報技術者令和7年春期問2 処理の実行回数は何回か｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "FPGAなどに実装するデジタル回路を記述し，論理合成するために使用される言語はどれか。\n\n---\n【選択肢】\nア: DDL\nイ: HDL\nウ: UML\nエ: XML",
    "back": "【正解】 イ\n\n【解説】\nHDL\n(Hardware Description Language)は、デジタル回路の設計や構成をテキストベースで記述できるハードウェア記述言語の総称です。VHDL、Verilog、SystemCなどの種類があります。\nゲートやフリップフロップといった論理素子の接続構造や、クロック信号に応じた動作をテキストで記述できることで、論理回路設計が抽象化されソフトウェアのように扱うことができます。これにより、回路を実装する前のシミュレーション検証が可能になる、モジュール化による保守性・再利用性の向上などのメリットがあります。\nFPGAやASICなどのカスタムハードウェアを構築する際には、HDLを使った設計が標準的な手法となっています。\nData Definition Languageの略。SQL言語のうちデータベースの構造や構成を定義する命令群です。\n正しい。HDLは、デジタル回路の設計や構成をテキストベースで記述できるハードウェア記述言語です。なお論理構成とは、回路の論理式の記述（RTL記述）から回路図を自動生成することをいい、HDLのソースコードを論理合成ツールに与えててネットリストを生成する工程を指します。\nUnified Modeling Languageの略。オブジェクト指向開発で用いられる標準表記法群で、オブジェクト間の関連や動作・構成を表現する13種の図表から構成されています。\neXtended Markup Launguageの略。利用者がタグや属性の名前を自由に定義することができるマークアップ言語です。システム間のデータ交換などに用いられます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q20.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q20.html",
    "title": "応用情報技術者令和7年春期問20 デジタル回路の記述に使用されるもの｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "IoTシステムにおいて，センサーの値をゲートウェイに送信するセンサーノードの消費電流を抑えるため，図のような間欠動作を考える。センサーノードの動作時間は10ミリ秒で，その間は平均して10mAの電流が流れる。待機中は常に0.1μAの電流が流れる。間欠動作の平均電流を1μA以下にするための待機時間として，最も短いものはどれか。ここで，平均電流の値を求める時間は十分に長いものとする。\n\n---\n【選択肢】\nア: 1.1秒\nイ: 11.1秒\nウ: 111.1秒\nエ: 1111.1秒",
    "back": "【正解】 ウ\n\n【解説】\nセンサー動作時には10mAが10ミリ秒流れ、その後の待期時間では0.1μAの電流が流れます。この間欠動作の平均電流は、これらの消費電荷（電流×時間）の合計を時間の合計で割ることで求めることができます。\n平均電流＝\n動作時の電流×動作時間＋待機時の電流×待機時間\n動作時間＋待機時間\n上記の式で示される平均電流を1 μA以下に抑えるための待機時間nは、下記のように方程式で導くことが可能です。本式では10mAを10,000μA、10ミリ秒を0.01秒に換算しています。\n1≧\n10,000×0.01＋0.1×n\n0.01＋n\n1(0.01＋n)≧100＋0.1n\n0.01＋n≧100＋0.1n\n0.9n≧99.99\nn≧111.1\n計算結果より、少なくとも111.1秒の待機時間が必要とわかります。したがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q21.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q21.html",
    "title": "応用情報技術者令和7年春期問21 センサーノードの省電力化｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "ユーザーインタフェースのユーザビリティを評価する手法には，利用者が参加するものと専門家だけで実施するものとがある。利用者が参加する手法と専門家だけで実施手法との適切な組合せはどれか。\n\n---\n【選択肢】\nア: イウエ",
    "back": "【正解】 ウ\n\n【解説】\nユーザビリティに関する標準規格であるJIS Z 8521では、ユーザビリティ(使用性)を「ある製品が，指定された利用者によって，指定された利用の状況下で，指定された目的を達成するために用いられる際の，有効さ，効率及び利用者の満足度の度合い」と定義しています。端的にいえばユーザビリティとは「利用者にとっての使いやすさ」のことです。\nそれぞれのユーザビリティ評価手法は次のようなものです。\nアンケート（質問紙法）\n専門家が用意した質問用紙を多数の利用者に配布し、記入したもらった回答を分析することで評価する手法\n回顧法\n被験者にタスクを実行してもらい、専門家がその行動を観察し、事後の質問への回答とともに分析する手法\n思考発話法\n被験者にタスクを実行してもらい、その操作を行っている間、考えたことや感じたことを口に出してもらうことで利用者の感じ方や思考を分析する手法\n認知的ウォークスルー法\n複数の専門家が、設計仕様書や紙のプロトタイプを見ながら、対象となるユーザーの行動をシミュレーションしていくことで問題点を明らかにしていく手法。人の認知過程を基準にする\nヒューリスティック評価法\n複数の専門家が、設計仕様書や紙のプロトタイプを見ながら、既知の経験則に照らし合わせて問題点を明らかにする手法。ヒューリスティックとは「経験則」の意で、専門家の経験則を基準にする\n5つの評価手法を「利用者が参加する手法」と「専門家だけで実施する手法」に分類すると次のようになります。\n利用者が参加する手法\nアンケート、回顧法、思考発話法\n専門家だけで実施する手法\n認知的ウォークスルー法、ヒューリスティック評価法\nしたがって正しい組合せは「ウ」です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q22.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q22.html",
    "title": "応用情報技術者令和7年春期問22 ユーザビリティの評価手法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "W3Cで仕様が定義され，矩形や円，直線，文字列などの図形オブジェクトをXML形式で記述し，Webページでの図形描画にも使うことができる画像フォーマットはどれか。\n\n---\n【選択肢】\nア: OpenGL\nイ: PNG\nウ: SVG\nエ: TIFF",
    "back": "【正解】 ウ\n\n【解説】\nSVG\n(Scalable Vector Graphics)は、ベクター形式による2次元の画像、図形、テキストなどをXML形式で記述する画像フォーマットです。\nSVGは画像をテキストベースで定義するため、次のような特徴があります。\n拡大・縮小による画質の劣化が生じない（スマートフォンなどの高解像度ディスプレイに最適）\n画像編集専用ソフトウェアを用いずに、テキストエディタでも直接編集が可能\nJavaScriptなどのスクリプト言語を用いて動的な制御が可能\nSVGは、比較的構造が単純で再利用されやすい画像や、インタラクティブ性を必要とする画像に多く活用されています。具体的には、アイコン、ロゴ、ボタン、チャート、グラフ、地図、ダイアグラムなどが挙げられます。これらの用途では、ラスター画像（JPEGやPNGなど）に比べてデータサイズが小さく、通信量や表示速度の観点からも有利です。HTML5でインラインSVGがサポートされたことにより、WebページでのSVGの活用が広がっています。\nOpen Graphics Libraryの略。Linux、FreeBSDなどのPC UNIXに加え、Windows、Mac OS X等クロスプラットフォームで使用できる2D／3DCGを扱うためのAPIです。\nPortable Network Graphicsの略。圧縮による画質の劣化のない可逆圧縮の画像ファイルフォーマットで、GIFよりも圧縮率が高く、現在ではほぼすべてのブラウザでサポートされているためWebページの画像フォーマットとして使用されます。\n正しい。SVGは、XML形式で記述する画像フォーマットです。\nTagged Image File Formatの略。画像データを解像度・色数・カラーモデルなどが異なる複数の形式で1つのファイルに格納できるファイル形式です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q23.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q23.html",
    "title": "応用情報技術者令和7年春期問23 XML形式で記述する画像フォーマット｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "大量のIoTデバイスから送信される大量で，かつ様々な形式のデータを格納可能なデータモデルのうち，行ごとに任意の列数をもち，かつ列ごとに複数の値をもつことによって，柔軟なデータ格納を実現しているデータモデルはどれか。\n\n---\n【選択肢】\nア: グラフ\nイ: ドキュメント\nウ: リレーショナル\nエ: ワイドカラム",
    "back": "【正解】 エ\n\n【解説】\nグラフ型は、グラフ理論に基づき、ノード、エッジ、プロパティの3要素でデータ間の関係性を表現するデータベースです。ネットワーク状の構造となるため、列という概念はありません。\nドキュメント型は、各レコードをXMLやJSONなどのドキュメント形式で格納・管理するデータベースです。列という概念はありません。\nリレーショナルは、2次元の表形式でデータを格納・管理するデータベースです。行と列の概念はありますが、列の数はテーブル内のすべて行で同じです。\n正しい。\nワイドカラム型\nは、キーバリューストア(KVS)を発展させた方式で、キーに対応する値として複数の列グループ（カラムファミリー）を持つ構造のデータベースです。列指向データベースとも呼ばれます。KVSと同様にスキーマレスでありながら、各レコードごとに異なる列を持つことが可能で、カラム単位でのデータ操作にも対応している点で、より柔軟かつ高機能です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q24.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q24.html",
    "title": "応用情報技術者令和7年春期問24 データベースのデータモデル｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "UMLを用いて表した図のデータモデルを関係データベース上に実装する際の解釈のうち，適切なものはどれか。\n\n---\n【選択肢】\nア: \"指定送付先\"を指定する際，\"付加情報\"表のどの行でも選択できる。\nイ: \"付加情報\"表と\"顧客\"表の行数は一致していなければならない。\nウ: \"付加情報\"表には\"顧客\"表に対する参照制約を指定する。\nエ: \"付加情報\"表には\"注文\"表に対する参照制約を指定する。",
    "back": "【正解】 ウ\n\n【解説】\n\"注文\"には、制約として『\"注文\"のインスタンスが指定送付先をもつときは，その\"付加情報\"の注文主と\"注文\"の顧客は一致すること』があります。この制約により、\"注文\"のインスタンスと\"付加情報\"のインスタンスが参照する\"顧客\"は同じであることが要求されます。そのため選択できるのは、注文をした\"顧客\"に関連付けられた\"付加情報\"に限られます。\n\"顧客\"に対する\"付加情報\"のカーディナリティ（多重度）は0以上（＊）です。1つの\"顧客\"が複数の\"付加情報\"をもつことが許容されているため、顧客1行に対し、付加情報が2行以上になるケース、または付加情報がないケース（0行）も存在し得ます。\n正しい。\"顧客\"と\"付加情報\"のカーディナリティは1対多です。つまり、付加情報は1人の顧客と関連をもつことが要求されます。付加情報が単独で存在することは許されず、必ず対応する顧客レコードが存在しなければなりません。この関係性を担保するため、\"付加情報\"表から\"顧客\"表に対する参照制約が設定されます。\n【別解】\n2つのエンティティの関連を関係データベースとして実装すると、主キー側が\"顧客\"表、外部キー側が\"付加情報\"表となります。\"付加情報\"表でには\"顧客\"表を参照する外部キーが定義され、この列に参照制約が指定されます。\n記述とは逆で、参照制約は\"注文\"表から\"付加情報\"表に対して指定します。\n\"注文\"と\"付加情報\"のカーディナリティは多対\"0..1\"です。つまり、1件の注文は0または1つの付加情報と関連をもちます。注文が付加情報をもつ場合、その参照先の付加情報が削除等されるのを禁止しなければなりません。この関係性を担保するため、\"注文\"表から\"付加情報\"表に対して参照制約（NULL可）が設定されます。\n【別解】\n2つのエンティティの関連を関係データベースとして実装すると、主キー側が\"付加情報\"表、外部キー側が\"注文\"表となります。\"注文\"表には\"付加情報\"表を参照する外部キーが定義され、この列に参照制約が指定されます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q25.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q25.html",
    "title": "応用情報技術者令和7年春期問25 データモデルの解釈｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "関係を第2正規形から第3正規形に変換する手順はどれか。\n\n---\n【選択肢】\nア: 候補キー以外の属性から，候補キーの一部の属性に対して関数従属性がある場合，その関係を分解する。\nイ: 候補キー以外の属性間に関数従属性がある場合，その関係を分解する。\nウ: 候補キーの一部の属性から，候補キー以外の属性への関数従属性がある場合，その関係を分解する。\nエ: 一つの属性に複数の値が入っている場合，単一の値になるように分解する。",
    "back": "【正解】 イ\n\n【解説】\n関係の正規化には、一般的に行われる第1正規形から第3正規形までと、特殊な場合に適用されるボイスコッド正規形、第4正規形、第5正規形があります。応用情報技術者試験では第3正規形まで学習しておけば十分です。第■正規形に変換することを、第■正規化と呼びます。\n第1正規化\n繰り返し項目や集合値をもつ属性を排除し、全ての属性が単一値から成るようにする\n第2正規化\n主キーの一部に関数従属\n※\nする属性を別表に分離する\n第3正規化\n非キー属性に関数従属する属性を別表に分離する\n例えば、{\n受注ID\n，商品ID，商品名，顧客ID，顧客名}という関係があるとします。商品名は非キー属性の商品IDから、顧客名は非キー属性の顧客IDから一意に決まります。このように、主キー以外の列が他の非キー属性に依存している場合に、その関係を別表に移したのが第3正規形です。\n{\n受注ID\n，\n商品ID\n，\n顧客ID\n}\n{\n商品ID\n，商品名}\n{\n顧客ID\n，顧客名}\nボイスコッド正規形への変換手順です。\n正しい。第3正規形への変換手順です。\n第2正規形への変換手順です。\n第1正規形への変換手順です。\n※\n関数従属とは、商品ID→商品名のように、ある属性の値が決定したとき他の属性の値が一意に決定される関係のことです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q26.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q26.html",
    "title": "応用情報技術者令和7年春期問26 第3正規形に変換する手順はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "SQL文に示す参照制約が存在する\"商品\"表と\"受注\"表とがある。\"商品\"表の行を削除したとき，削除した行の商品コードと同じ値の商品コードをもつ\"受注\"表の行を自動的に削除するSQL文として，aに入れる字句はどれか。\n〔SQL文〕\n\n---\n【選択肢】\nア: CASCADE\nイ: RESTRICT\nウ: SET DEFAULT\nエ: SET NULL",
    "back": "【正解】 ア\n\n【解説】\n参照制約が設定されているデータベースでは、主キーを含む行が削除されたり、更新されたりすると、参照関係が崩れることがあります。DBMSでは、参照整合性が損なわれるデータ操作が行われたときに、どのような形で参照整合性を回復するかを、外部キー制約のON DELETEやON UPDATEに指定しておくことができます。指定できる動作は次の5種類です。\nCASCADE\n参照先のデータが更新・削除されると、対応する外部キーの値も自動的に更新・削除される\nRESTRICT\n参照制約違反となるデータの更新・削除を拒否する\nNO ACTION（デフォルトの動作）\n処理の終了時に参照整合性を確認し、違反していれば更新・削除を拒否する\nSET NULL\n参照先のデータが更新・削除されると、対応する外部キーの値にNULLが設定される\nSET DEFAULT\n参照先のデータが更新・削除されると、対応する外部キーの値にデフォルト値が設定される\n表定義を見ると、\"受注\"表の\"商品コード\"列は、\"商品\"表の\"商品コード\"列を参照していることがわかります。参照先の\"商品\"表の行が削除された場合、\"受注\"表の対応する行も\n自動的に削除\nしたいので、適切な動作は「CASCADE」です。\nしたがって「ア」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q27.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q27.html",
    "title": "応用情報技術者令和7年春期問27 SQL文の参照制約の削除規則｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "和両立である関係RとSがある。R∩Sと等しいものはどれか。ここで，－は差演算，∩は共通集合演算を表す。\n\n---\n【選択肢】\nア: (R－S)－(S－R)\nイ: R－(R－S)\nウ: R－(S－R)\nエ: S－(R－S)",
    "back": "【正解】 イ\n\n【解説】\n和両立\n(union compatible)とは、2つの関係の型が適合している様子をいいます。具体的には次の2つをともに満たす関係をいいます。\n次数（属性数・列数）が等しい\n対応する属性同士のドメイン（値の型・範囲）が等しい\n以下は和両立である2つの関係です。\n集合演算のうち和・差・共通は、2つの関係が和両立であることが前提となっています。\nR∩Sをベン図で表すと以下の集合になるため、選択肢の集合演算の中で結果が同じになるものを探します。\n結果がR∩Sと同じになるため正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q28.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q28.html",
    "title": "応用情報技術者令和7年春期問28 R∩Sと等しいものはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "無線LANのアクセスポイントやIP電話機などに，LANケーブルを利用して給電も行う仕組みはどれか。\n\n---\n【選択肢】\nア: PLC\nイ: PoE\nウ: UPS\nエ: USB",
    "back": "【正解】 イ\n\n【解説】\nPower Line Communicationsの略。電力線を通信回線としても利用する技術です。通信信号と電力を異なる周波数帯で多重化した合成信号を1本のケーブルで送り、受信側ではコンセントに接続したアダプタで信号を分離する仕組みです。\n正しい。\nPoE\n(Power over Ethernet)は、イーサネットのLANケーブルを通じて電力を供給する技術です。屋外に設置されるネットワークカメラや、天井や壁に設置される無線LANアクセスポイントのように、電源コンセントがない又は電源配線が難しい場合に利用されます。利用にはPoEに対応した機器が必要です。\nUninterruptible Power Supplyの略。落雷などによる突発的な停電が発生したときに自家発電装置が電源を供給し始めるまでの間、サーバに電源を供給する役目をもつ無停電電源装置です。\nUniversal Serial Busの略。現在最も普及している周辺機器接続のためのインタフェースです。バスパワー給電機能がありますが、LANケーブルではなくUSBケーブルを使用します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q29.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q29.html",
    "title": "応用情報技術者令和7年春期問29 LANケーブルを利用して給電も行う仕組み｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "AIにおける機械学習の過程において，過学習と疑われたときの解消方法として，最も適切なものはどれか。\n\n---\n【選択肢】\nア: 訓練した時と同じ精度を出すために，訓練データをテストデータとして使用する。\nイ: 精度を高めるために，元の訓練データに加工を施し，訓練データの量を増やす。\nウ: 予測した結果に近づけるために，モデルをより複雑にする。\nエ: より多くの未知のデータに対して予測できるように，汎化性能を下げる。",
    "back": "【正解】 イ\n\n【解説】\n過学習\n(オーバーフィッティング)は、機械学習のモデルが訓練データに過剰に適合してしまった状態を指します。\nモデルが過学習に陥ると、訓練データに対しては良い精度を示しますが、未知のデータに対する予測精度が低下し、汎用性がないシステムとなってしまいます。過学習は、訓練データが少ない場合やモデルの複雑度が高い場合に特に起きやすくなります。\n機械学習では、データセットを訓練用・検証用・テスト用の3つのサブセットに分けて使うのが基本です。テスト用（本試験用）には訓練に使用していない未知のデータを使用します。訓練データをテストデータとして使えば高い精度を示すのは当然で、過学習の解消にはなりません。\n正しい。元の訓練データを変換・加工してデータ数を水増しする手法は、データ拡張と呼ばれ、少ないデータセットでも機械学習を可能とするものです。モデルが多様なパターンを学習できるようになるため、過学習が抑制され、汎化能力の高いモデルを構築できます。データ拡張は過学習を防ぐ有効な手段の一つです。\nモデルの複雑さを上げると、訓練データには良く適合しますが、未知のデータには対応しにくくなります。過学習を悪化させる方向に作用するため不適切です。\n汎化性能とは『未知のデータにどれだけ対応できるか』を示す指標です。過学習とはモデルが訓練データに過剰適合してしまい未知のデータに対応できない状態、すなわち汎化性能が低い状態を指します。汎化性能を下げるということは、過学習を助長するため不適切です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q3.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q3.html",
    "title": "応用情報技術者令和7年春期問3 過学習と疑われたときの解消方法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "MTU(Maximum Transmission Unit)が1,500バイトに設定されたIPv4ネットワークで2,000バイトのデータをTCPを用いて送信するときに，二つ目に送信されるパケットに含まれるデータは何バイトか。ここで，TCPヘッダー長は20バイト，IPへッダー長は20バイト，イーサネットのヘッダー長とトレーラー長は，それぞれ14バイトと4バイトとする。また，データを複数パケットに分割して送信するときは，先に送信するパケットに格納できる上限までデータを含めて送信するものとする。\n\n---\n【選択肢】\nア: 500\nイ: 540\nウ: 580\nエ: 598",
    "back": "【正解】 イ\n\n【解説】\nMTU\n(Maximum Transmission Unit)は、ノードが隣接したネットワークへ、1フレーム（1回の通信）で転送できる最大のデータサイズのことです。MTUはデータリンク層のプロトコルによって異なり、イーサネットでは1,500バイト、FDDIでは4,324バイト、ATMでは9,180バイトとなっています。\nMTUに含まれるのは、データリンク層においてMACフレームでカプセル化される範囲、すなわちデータリンク層より上位のデータである「TCPヘッダー＋IPヘッダー＋ペイロード」です。設問では、MTUが1,500バイト、TCPヘッダー長とIPへッダー長がともに20バイトなので、1つ目のパケットで送信されるペイロードは「1,500－40＝1,460バイト」です。次の2つ目のパケットに含まれるペイロードは残りの「2,000－1,460＝540バイト」となります。\nしたがって「イ」が正解です。\n【補足】\nTCPでは通信を始める際、MTUからTCPヘッダーとIPヘッダーのサイズを差し引いてMSS(Maximum Segment Size)を計算します。送信しようとするデータがMSSを超える場合、送信側ホストは、MSSに収まるように適宜データを複数のIPパケットに分割して送信します。この分割処理は「フラグメンテーション」と呼ばれます。受信側ホストでは、分割されたパケットが再び一つにまとめられ上位層に渡されます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q30.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q30.html",
    "title": "応用情報技術者令和7年春期問30 MTUとペイロード長｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "次のルーティングテーブルをもつルータが宛先IPアドレス 192.168.1.1 のパケットを受信したとき，選択されるネクストホップはどれか。ここで，宛先IPアドレスの条件を満たす宛先ネットワークが複数あるときは，それらのうちで，サブネットマスクが最も長い宛先ネットワークのネクストホップを選択する。\n\n---\n【選択肢】\nア: 10.1.0.1\nイ: 10.1.0.2\nウ: 10.1.0.3\nエ: 10.1.0.4",
    "back": "【正解】 エ\n\n【解説】\nルーティングテーブル内に宛先アドレスに合致するエントリが複数ある場合、ルータは、アドレスプリフィックスが最長のエントリを選択します。この検索の仕組みを「最長一致（ロンゲストマッチ）」といいます。\n宛先アドレス 192.168.1.1 を各エントリと比較すると、以下のように全てのエントリに合致します。\n0.0.0.0/0\n全てのアドレスに一致するデフォルトルート\n192.168.0.0/16\n192.168.1.1 -\n11000000 10101000\n00000001 00000001\n192.168.0.0 -\n11000000 10101000\n00000000 00000000\n192.168.1.0/24\n192.168.1.1 -\n11000000 10101000 00000001\n00000001\n192.168.1.0 -\n11000000 10101000 00000001\n00000000\n192.168.1.0/26\n192.168.1.1 -\n11000000 10101000 00000001 00\n000001\n192.168.1.0 -\n11000000 10101000 00000001 00\n000000\n4つのエントリのうち、プレフィックス長が最大であるのは一番下の 192.168.1.0/26 ですから、このエントリが最長一致の原則に従って選択されます。このためネクストホップは 10.1.0.4 となります。\nしたがって「エ」が正解です。\nなお、宛先が 0.0.0.0/0 である一番上のエントリは、ルーティングテーブル内に合致するものがないときに選択されるデフォルトルートの指定です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q31.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q31.html",
    "title": "応用情報技術者令和7年春期問31 ネクストホップはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "あるサブネットでは，ルータやスイッチなどのネットワーク機器にIPアドレスを割り当てる際，割当て可能なアドレスの末尾から降順に使用するルールを採用している。このサブネットのネットワークアドレスを 10.16.32.64/26 とするとき，10番目に割り当てられるネットワーク機器のアドレスはどれか。ここで，ネットワーク機器1台に対して，このサブネット内のアドレス1個を割り当てるものとする。\n\n---\n【選択肢】\nア: 10.16.32.54\nイ: 10.16.32.55\nウ: 10.16.32.117\nエ: 10.16.32.118",
    "back": "【正解】 ウ\n\n【解説】\nIPv4アドレス 10.16.32.64/26 の「/26」はプレフィックス長が26であることを示します。つまり、先頭から26ビット目までがネットワークアドレス、残りの6ビットがホストアドレス部です。ビット表現でネットワークアドレス部とホストアドレス部の区別を表すと次のとおりです。\n6ビットで表現可能なビット列は 000000～111111 ですが、このうち全ビットが\"0\"のネットワークアドレスと全ビットが\"1\"のブロードキャストアドレスはホストアドレスとして使うことができません。したがって、割当て可能なホストアドレスの範囲は 000001～111110、その末尾は 111110 になります。\nこの末尾のアドレスを10進表記で表すと、次のように 10.16.32.126 です。\n10.16.32.126 を末尾から1番目のアドレスとすると、そこから 126→125→124→…と降順に数えて10番目のアドレスは 10.16.32.117 となります。したがって正解は「ウ」です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q32.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q32.html",
    "title": "応用情報技術者令和7年春期問32 ネットワーク機器のアドレスはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "TCP/IPネットワークで，データ転送用と制御用とに異なるウェルノウンポート番号が割り当てられているプロトコルはどれか。\n\n---\n【選択肢】\nア: FTP\nイ: POP3\nウ: SMTP\nエ: SNMP",
    "back": "【正解】 ア\n\n【解説】\nウェルノウンポート番号\nとは、16ビットのポート番号 0～65535 のうち、よく利用される特定のアプリケーション用に予約されている 0～1023 までの番号のことです。ウェルノウン(well-known)は、英語で「よく知られている、有名な」という意味の形容詞です。システムポートとも呼ばれます。\n情報処理技術者試験でも出題可能性がある、下記のプロトコルとポート番号の組みについては押さえておきましょう。\nHTTP　80/TCP\nHTTPS　443/TCP\nFTP　20/TCP、21/TCP\nSSH　22/TCP\nSMTP　25/TCP\nPOP3　110/TCP\nDNS　53/TCP、53/UDP\nNTP　123/UDP\n正しい。FTPではデータの転送用に「20/TCP」、制御用に「21/TCP」が割り当てられています。\n制御用(21/TCP)は、ファイルをダウンロードするGET(RETR)やアップロードのPUT(STOR)などのコマンド送信と、その応答をやり取りするためのコネクション、データ転送用(20/TCP)は、制御用のコネクションとは別にデータの転送処理が発生する度に確立されるコネクションです。\nPOP3が使用するポートは「110/TCP」だけです。\nSMTPでは通常のメール転送用に「25/TCP」、メールソフトからメールサーバに届けるときの送信専用の宛先ポート(サブミッションポート)に「587/TCP」を使用します。\nSNMPではマネージャ側からエージェントに通知するときに「161/UDP」、逆にエージェント側からマネージャに通知するときに「162/UDP」を使用します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q33.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q33.html",
    "title": "応用情報技術者令和7年春期問33 ウェルノウンポート番号｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "30kバイトのJPEGファイルを電子メールに添付するとき，実際の転送データはおよそ何kバイトになるか。ここで，添付ファイルはMIME base64を用いてエンコーディングされるものとする。\n\n---\n【選択肢】\nア: 20\nイ: 30\nウ: 40\nエ: 60",
    "back": "【正解】 ウ\n\n【解説】\nbase64\nは、任意のデータを6ビットずつに区切り、それぞれを 0-9、a-z、A-Z、+、/ の64種類の文字に対応させて変換するエンコード方式です。電子メールのようにASCII文字のみが利用可能な環境などで、バイナリデータやマルチバイト文字を扱うために用いられています。\nbase64の変換手順は次のとおりです（参考）。\n元データ：文字列の\"JPEG\"\nJPEG ⇒ 01001010 01010000 01000101 01000111\n元データを6ビットずつに区切る。6ビットに満たない部分は0で埋める\n010010，100101，000001，000101，010001，11\n0000\n4つごと対応する文字に変換する。4文字に満たない部分は=で埋める\nSlBF，Rw\n==\n連結する\nSlBFRw==\nbase64エンコーディングを行った場合、6ビットがそれぞれ1文字（8ビット）に変換されるため、データ量は「8÷6＝\n4\n3\n倍」に増加します。設問では元データが30kバイトなので、エンコード後のデータ量は「30×\n4\n3\n＝40kバイト」となります。\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q34.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q34.html",
    "title": "応用情報技術者令和7年春期問34 base64エンコーディング｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "デジタル庁，総務省及び経済産業省が策定した\"電子政府における調達のために参照すべき暗号のリスト(CRYPTREC暗号リスト)\"を構成する暗号リストの説明のうち，適切なものはどれか。\n\n---\n【選択肢】\nア: 推奨候補暗号リストとは，CRYPTRECによって安全性及び実装性能が確認された暗号技術のうち，市場における利用実績が十分であるか今後の普及が見込まれると判断され，当該技術の利用を推奨するもののリストである。\nイ: 推奨候補暗号リストとは，候補段階に格下げされ，互換性維持目的で利用する暗号技術のリストである。\nウ: 電子政府推奨暗号リストとは，CRYPTRECによって安全性及び実装性能が確認された暗号技術のうち，市場における利用実績が十分であるか今後の普及が見込まれると判断され，当該技術の利用を推奨するもののリストである。\nエ: 電子政府推奨暗号リストとは，推奨段階に格下げされ，互換性維持目的で利用する暗号技術のリストである。",
    "back": "【正解】 ウ\n\n【解説】\nCRYPTREC暗号リスト\nは、暗号技術検討会および関連委員会（CRYPTREC：クリプトレック）により、電子政府での使用に際しての安全性および実装性能が確認された暗号のリストです。\n\"政府機関の情報セキュリティ対策のための統一基準\"では、政府機関の情報システムに使用する電子暗号および電子署名のアルゴリズムとして、可能な限りCRYPTREC暗号リストにあるアルゴリズムを採用する運用ルールを定めることが必要とされています。\nCRYPTREC暗号リストには次の3つの種別があります。\n電子政府推奨暗号リスト\nCRYPTRECにより安全性および実装性能が確認された暗号技術について、市場における利用実績が十分であるか今後の普及が見込まれると判断され、当該技術の利用を推奨するもののリスト\n推奨候補暗号リスト\nCRYPTRECにより安全性および実装性能が確認され、今後、電子政府推奨暗号リストに掲載される可能性のある暗号技術のリスト\n運用監視暗号リスト\n実際に解読されるリスクが高まるなど、推奨すべき状態ではなくなった暗号技術のうち、互換性維持のために継続利用を容認するもののリスト。互換性維持以外の目的での利用は推奨しない\n推奨候補暗号リストは、今後の電子政府推奨候補であるアルゴリズムのリストです。\n互換性維持目的で利用する暗号技術のリストは、運用監視暗号リストです。\n正しい。電子政府推奨暗号リストの説明です。\n互換性維持目的で利用する暗号技術のリストは、運用監視暗号リストです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q35.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q35.html",
    "title": "応用情報技術者令和7年春期問35 CRYPTREC暗号リスト｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "Webサーバのログを分析したところ，Webサーバへの攻撃と思われるHTTPリクエストヘッダーが記録されていた。次のHTTPリクエストヘッダーから推測できる，攻撃者が悪用しようとしていた可能性が高い脆弱性はどれか。ここで，HTTPリクエストヘッダー中の\"%20\"は空白を意味する。\n〔HTTPリクエストヘッダーの一部〕\nGET /cgi-bin/submit.cgi?user=;cat%20/etc/passwd HTTP/1.1\nAccept: */*\nAccept-Language: ja\nUA-CPU: x86\nAccept-Encoding: gzip，deflate\nUser-Agent: (省略)\nHost: test.example.com\nConnection: Keep-Alive\n\n---\n【選択肢】\nア: HTTPヘッダーインジェクション(HTTP Response Splitting)\nイ: OSコマンドインジェクション\nウ: SQLインジェクション\nエ: クロスサイトスクリプティング",
    "back": "【正解】 イ\n\n【解説】\nHTTPリクエストヘッダーのうちで注目すべき部分は\n?user=;cat%20/etc/passwd\nです。\ncat\nはUNIX系のOSにおいてファイルの内容を出力するコマンドであり、\n/etc/passwd\nはユーザーのアカウント情報（ユーザー名・パスワード等）が記録されているファイルへのパスです。このため、\ncat%20/etc/passwd\nはシステムが管理するユーザーのアカウント情報の取得を意図したものと判断できます。\n仮にWebアプリケーション内でOSのシェルを起動する関数\n※\nを使用し、これにuserパラメータの値をそのまま実行時引数として渡した場合、OSのシェルには次のような文字列が与えられることになります。\n本来実行されるコマンド名 ;cat /etc/passwd\n;\nは命令の区切りを意味するため、上記の文字列は次の2つの命令として解釈されます。\n本来実行されるコマンド名\ncat /etc/passwd\nこの結果\ncat /etc/passwd\nが実行され、ブラウザの結果画面に秘密情報であるアカウント情報が表示されてしまうことになります。\nこの攻撃は、Webアプリケーションに任意のOSコマンドを実行させることを意図しているため、対応する脆弱性はOSコマンドインジェクションとなります。したがって「イ」が正解です。\nHTTPヘッダーインジェクションは、利用者に返されるHTTPレスポンスの内容に、任意のヘッダーフィールドやボディ部を混入させる攻撃です。対象となるのはHTTPレスポンスヘッダーを動的に組み立てるWebアプリケーションです。\n正しい。OSコマンドを含むため、OSコマンドインジェクションの脆弱性を狙う攻撃です。\n;\n以外にも、\n| & ` ( )\nなどは別コマンドの実行に使われるものとして特に警戒する必要があります。\nSQLインジェクションの場合、攻撃コードにSQLの断片が含まれます。\nXSSの場合、攻撃コードにJavaScriptの断片が含まれます。\n※\nPerlの\nexec\nopen\n、PHPの\nexec\npassthru\nproc_open\nshell_exec\nsystem\n、Pythonの\nos.system\nsubprocess.call\nなどが該当します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q36.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q36.html",
    "title": "応用情報技術者令和7年春期問36 HTTPリクエストから推測できる攻撃｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "暗号機能を実装したIoT機器における脅威のうち，サイドチャネル攻撃に該当するものはどれか。\n\n---\n【選択肢】\nア: 暗号化関数を線形近似する式を導き，その線形近似式から秘密情報の取得を試みる。\nイ: 機器が発する電磁波を測定することによって秘密情報の取得を試みる。\nウ: 二つの平文の差とそれぞれの暗号文の差の関係から，秘密情報の取得を試みる。\nエ: 理論的にあり得る復号鍵の全てを機器に入力して秘密情報の取得を試みる。",
    "back": "【正解】 イ\n\n【解説】\nサイドチャネル攻撃\nは、対象の動作状況を観察し、漏洩電磁波・電力消費等のサイドチャネル情報から暗号鍵推定等を行う非破壊型解析攻撃の総称です。サイドチャネル(Side Channel)には、非正規の入出力経路という意味があります。\n具体的な攻撃方法としては、故障利用攻撃、タイミング攻撃や電力解析攻撃、電磁波解析攻撃などがあります。\n故障利用攻撃\nデバイスに限定的な障害を故意に与え、デバイスの計算誤りから秘密情報を解析する手法\nタイミング攻撃\n暗号処理のタイミングが暗号鍵の論理値に依存して変化することに着目し、暗号化や復号に要する時間の差異を統計的に解析して暗号鍵を推定する手法\n電力解析攻撃\n消費電力の変化に着目して鍵や処理内容の解析を試みる手法\n電磁波解析攻撃（テンペスト攻撃）\n機器が発する電磁波を測定することによって秘密情報の取得を試みる手法\n暗号化関数の線形近似式を発見することを基本とした「線形解読法」の説明です。\n正しい。サイドチャネル攻撃の一つである「電磁波解析攻撃」の説明です。\n入力値の差分が出力値の差分にどのような影響を与えるかを分析して解読を試みる「差分解読法」の説明です。\nブルートフォース攻撃(総当たり攻撃)の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q37.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q37.html",
    "title": "応用情報技術者令和7年春期問37 サイドチャネル攻撃に該当するもの｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "PKIを構成するOCSPを利用する目的はどれか。\n\n---\n【選択肢】\nア: 誤って破棄してしまった秘密鍵の再発行処理の進捗状況を問い合わせる。\nイ: デジタル証明書から生成した鍵情報の交換がOCSPクライアントとOCSPレスポンダの間で失敗した際，認証状態を確認する。\nウ: デジタル証明書が失効しているかどうかの状態を問い合わせる。\nエ: 有効期限が切れたデジタル証明書の更新処理の進捗状況を確認する。",
    "back": "【正解】 ウ\n\n【解説】\nOCSP\n(Online Certificate Status Protocol)は、リアルタイムでデジタル証明書の失効情報を検証し、有効性を確認するプロトコルです。\nクライアントは、確認対象となるデジタル証明書のシリアル番号をOCSPレスポンダに送信し、有効性検証の結果を受け取ります。この仕組みを利用することで、クライアント自身が定期的にCRL（証明書失効リスト）を取得・検証する手間を省くことができます。\nしたがって「ウ」が正しい記述です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q38.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q38.html",
    "title": "応用情報技術者令和7年春期問38 OCSPを利用する目的はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "欧米などの企業，組織で行われている\"セキュリティクリアランス\"の事例はどれか。\n\n---\n【選択肢】\nア: インターネットと重要な秘密情報を取り扱う組織内ネットワークとを，物理的に分離する。\nイ: 重要な秘密情報へのアクセス権を付与されたアカウントを定期的に調べ，不要な場合は削除する。\nウ: 重要な秘密情報を取り扱う部署に配属される予定の個人の適性を評価する。\nエ: 離席時に机の上の重要な秘密情報を含む書類や媒体を片付ける。",
    "back": "【正解】 ウ\n\n【解説】\nセキュリティクリアランス\nは、国家や特定の組織が機密情報を取り扱う者（予定者を含む）に対して、その人物が情報を適切に扱う信頼性を有しているかどうかを調査し、一定の基準を満たすと判断された場合にのみ、機密情報へのアクセスを許可する制度です。\n国家機密や重要情報の漏えいリスクを最小限に抑えることが実施の目的であり、調査対象は、本人および家族の経歴、家族構成、犯罪歴、薬物使用歴、精神疾患、飲酒習慣、経済的状況など多岐におよびます。\n日本では、防衛・外交・スパイ活動防止・テロ防止の4分野に関して重要な情報を特定秘密を指定し、それを扱うものに対する適正評価を義務づける「特定秘密保護法」、経済安全保障上重要とされる情報を秘密として指定し、同じく適正評価を義務づける「重要経済安保情報保護活用法」が制定されています。これらの法律における適正評価がセキュリティクリアランスの典型例です。民間企業においても、研究開発や知的財産等の機微な情報の漏えいを防ぐため、企業が独自に導入している例があります。\nしたがって、個人に対して適性評価を行う「ウ」の記述が適切です。\nエアギャップに関する記述です。\nアカウント管理に関する記述です。\n正しい。セキュリティクリアランスの説明です。\nクリアデスクに関する記述です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q39.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q39.html",
    "title": "応用情報技術者令和7年春期問39 セキュリティクリアランスの事例はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "リアルタイム性が求められる組込みシステムにおいて，システムへの入力に対するリアルタイムな応答のうち，最も適切なものはどれか。\n\n---\n【選択肢】\nア: OSを使用しないで応答する。\nイ: 定められた制限時間内に応答する。\nウ: 入力された順序を守って応答する。\nエ: 入力時刻を記録して応答する。",
    "back": "【正解】 イ\n\n【解説】\nリアルタイム処理は、使用可能な資源が制限されている状態において、入力やイベントに対し、指定された時間内（デッドライン）に結果を出力することに着目した制御工学の概念です。「即時処理」とも呼ばれます。リアルタイム処理を実現するためのシステムが、\nリアルタイムシステム\n(Real-time System)です。\nリアルタイムシステムでは、時間資源の保護や実行時間の予測可能性の提供に特化したRTOS(Real-time OS)により管理されます。RTOSなしにリアルタイム性を確保するのは困難です。\n正しい。リアルタイムシステムでは、設定されている制限時間内に処理を終了することが要求されます。例として、自動車のエアバック制御、交通管制、医療機器、産業用ロボットの制御などがあります。いずれも正しく動作するだけでは不十分で、指定された時間内に処理を終えることが極めて重要なシステムです。\nリアルタイムシステムでは、処理の順序よりも時間的制約の遵守が重要です。緊急性の高い処理を優先して実行する必要があるため、到着順方式ではなく優先度方式のタスクスケジューリングが用いられます。\n\"リアルタイム\"というのは時刻を正しく記録することではありません。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q4.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q4.html",
    "title": "応用情報技術者令和7年春期問4 リアルタイムシステム｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "ソフトウェアの情報セキュリティ対策のうち，SBOM(Software Bill Of Materials)管理ツールを用いることができるものはどれか。\n\n---\n【選択肢】\nア: ソフトウェアでの利用者認証に用いるアカウントの一元管理\nイ: ソフトウェアについての脆弱性管理\nウ: ソフトウェアのソースコードについてのバージョン管理，アクセス制御及び改ざん防止\nエ: ソフトウェアのソースコードのバックアップとマルウェア混入防止",
    "back": "【正解】 イ\n\n【解説】\nSBOM\n(Software Bill Of Materials：エスボム)は、ある製品に含まれるソフトウェアに含まれるすべてのコンポーネントについて、それらの名称、バージョン・ビルド情報、ライセンス情報、依存関係、その他関連情報を含めて、機械処理可能なリストにしたものです。\n脆弱性管理では、どのソフトウェアにどのバージョンのOSSやライブラリが含まれているかの把握が必須です。SBOMの作成・管理により、確認された脆弱性をもつコンポーネントが使用されているかどうか、その影響度・影響範囲の特定、ソフトウェアアップデートの必要性の判断等を効率的に行えるようになるため、SBOMはソフトウェアの脆弱性管理のためのツールとしても利用されています。\nしたがって「イ」が適切です。\nユーザーアカウントや認証に管理には使用されません。本肢はID管理システムなどで行うべき対策です。\n正しい。SBOMツールを用いたセキュリティ対策です。\nソースコード自体の管理には使用されません。本肢はバージョン管理システムで行うべき対策です。\nソースコード自体の管理には使用されません。本肢はアンチマルウェアソフトなどで行うべき対策です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q40.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q40.html",
    "title": "応用情報技術者令和7年春期問40 SBOM管理ツールを用いることができるもの｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "cookieにSecure属性を設定しなかったときと比較した，設定したときのWebブラウザの動作として，適切なものはどれか。\n\n---\n【選択肢】\nア: cookieに設定された有効期間を過ぎると，Webブラウザがcookieを無効化であると判断する。\nイ: URL内のスキームがhttpsのときだけ，Webブラウザからcookieが送出される。\nウ: WebブラウザがアクセスするURL内のパスとcookieに設定されたパスのプレフィックスが一致するときだけ，Webブラウザからcookieが送出される。\nエ: WebブラウザではJavaScriptによるcookieの読出しが禁止される。",
    "back": "【正解】 イ\n\n【解説】\nSecure属性\nは、cookieの動作を制御する属性のひとつで、これが付与されたcookieは\nHTTPS\nによる暗号化通信、すなわちアクセス先のURLが「https://～」である場合のみWebブラウザからサーバに送信されるようになります。平文でやり取りされるHTTP通信「http://～」ではcookie送信を禁止することで、cookie情報の漏えい、セッションIDの盗聴によるセッションハイジャックなど被害を防ぎます。\nしたがって適切な動作は「イ」です。\nまた、cookieを発行する際に指定できる属性には\"Secure\"の他に以下の属性があります。\nDomain\n- cookieを送信するドメインを指定する\nPath\n- cookieを送信するURLディレクトリを指定する\nExpires\n- cookieの有効期限を指定する\nHttpOnly\n- JavaScriptからのアクセスを禁止する\nSameSite\n- サイトをまたがるリクエストの際のcookie送信を制御する\nExpires属性の動作です。\n正しい。Secure属性の動作です。\nPath属性の動作です。\nHttpOnly属性の動作です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q41.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q41.html",
    "title": "応用情報技術者令和7年春期問41 Secure属性を付けたときの動作｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "Webアプリケーションソフトウェアの開発におけるOSコマンドインジェクション対策はどれか。\n\n---\n【選択肢】\nア: SQL文の組立ては全てプレースホルダで実装する。\nイ: シェルを起動できる言語機能を利用した実装を避ける。\nウ: 直接メモリにアクセスできる言語機能を利用した実装を避ける。\nエ: 利用者が入力したファイル名にディレクトリが含まれていないかのエラーチェックを実装する。",
    "back": "【正解】 イ\n\n【解説】\nOSコマンドインジェクション\nは、ユーザー入力をOSに発行するコマンドの一部として使用するWebアプリケーションに対して、OSコマンドを含む不正な入力を与えることで、サーバ上で不正なOSコマンドを実行させる攻撃手法です。本来は許可されないコマンドが実行されることにより、不正なファイル操作、外部プログラムの実行、重要情報の窃取などの被害が発生するおそれがあります。\n多くのプログラミング言語には、引数として指定された文字列をOSのシェルに渡して実行させる関数等が存在します。例えば、PHPの\nexec\n、Perlの\nopen\n、Pythonの\nsubprocess.call\nなどが該当します。外部からの入力値を適切に検証せずにこれらの関数を使用している場合、攻撃者に任意のコマンドを実行されるリスクがあります。\nSQLインジェクション対策です。\n正しい。OSコマンドインジェクションは、OSコマンドの実行が可能な関数等を利用している場合に生まれる脆弱性なので、これらのシェルを起動できる言語機能を利用しないことが根本的な対策となります。\nバッファオーバーフロー対策です。\nディレクトリトラバーサル対策です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q42.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q42.html",
    "title": "応用情報技術者令和7年春期問42 OSコマンドインジェクション対策はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "VPNで使用されるプロトコルであるIPsec，L2TP，TLSの，OSI基本参照モデルにおける相対的な位置関係はどれか。\n\n---\n【選択肢】\nア: A\nイ: B\nウ: C\nエ: D",
    "back": "【正解】 ウ\n\n【解説】\nそれぞれのセキュアプロトコルの特徴と位置する階層は次のとおりです。\nIPsec（IP Security）\nIP(Internet Protocol)を拡張してセキュリティを高めたプロトコルで、改ざんの検知、通信データの暗号化および送信元の認証などの機能を、OSI基本参照モデルのネットワーク層レベル(TCP/IPモデルではIP層)で提供する。認証プロトコルAHや認証／暗号化プロトコルESPを含む\nL2TP（Layer 2 Tunneling Protocol）\nPPPなどのフレームをIPヘッダーでカプセル化することで、ルータを越えた複数の拠点間でフレームのやり取りを実現するトンネリングプロトコル。暗号化の機能はないため必要に応じてIPsecと併用する必要がある。\"レイヤー2\"の名称どおり、OSI基本参照モデルの第2層のデータリンク層で動作する\nTLS（Transport Layer Security）\n通信の暗号化、デジタル証明書を利用した改ざん検知、ノード認証を含む統合セキュアプロトコル。その名のとおりOSI基本参照モデルのトランスポート層で動作する\nIPsecはIPが属するネットワーク層(第3層)、L2TPはデータリンク層(第2層)、TLSはトランスポート層(第4層)にするので、適切な位置関係は上層から TLS→IPsec→L2TP の順です。したがって「C」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q43.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q43.html",
    "title": "応用情報技術者令和7年春期問43 IPsec，L2TP，TLSの位置関係｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "パスワードクラックの対策のうち，ストレッチングに該当するものはどれか。\n\n---\n【選択肢】\nア: あらかじめ利用者だけが知っている質問と答えをシステムに登録しておき，普段と異なるログイン方法の場合に追加で質問を行う。\nイ: 一定時間内にパスワードを一定回数誤ったとき，それ以降のログインを試行できないようにする。\nウ: パスワードの照合のためのハッシュ値を，パスワードに対してハッシュ化を繰り返して，求める。\nエ: パスワードの照合のためのハッシュ値を，パスワードに利用者IDごとに異なる文字列を付加してからハッシュ化して，求める。",
    "back": "【正解】 ウ\n\n【解説】\nストレッチング\nは、パスワードのハッシュ化を1回で終わらせず、元データに対して数千～数万回のハッシュ計算を繰り返すことで、パスワードの保護を強化する手法です。主にレインボー攻撃などのオフラインで行われるパスワードクラックへの対策として実施されます。\nハッシュ関数の一方向性によりハッシュ値から元データを復元することは困難です。しかし、多数の試行が可能なオフライン攻撃では、いつかは同じハッシュ値を出力する元データが特定されてしまうという問題があります。ストレッチングは、元データにたどり着くために必要な計算量を大幅に増加させることができ、これにより現実的な時間内でパスワードクラックが成功するのを困難にします。仮に1つのハッシュ値を解析するために必要な時間が10時間だとすると、1万回のハッシュ化を行っている場合、解析までにかかる時間は10万時間（約11年）となります。\nしたがって「ウ」の記述が適切です。\n秘密の質問とリスクベース認証の説明です。\nロックアウトの説明です。\n正しい。ストレッチングの説明です。\nソルトの説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q44.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q44.html",
    "title": "応用情報技術者令和7年春期問44 ストレッチングはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "デザインレビューの目的はどれか。\n\n---\n【選択肢】\nア: 設計工程内で，設計工程の成果物の問題点を発見する。\nイ: 品質保証部門が，全成果物の出荷の可否を判定する。\nウ: 品質保証部門によるプログラムのサンプリング検査によって，設計者では気付かない品質上の問題点を発見する。\nエ: プロジェクトマネジメントのプロセス上の問題点を発見する。",
    "back": "【正解】 ア\n\n【解説】\nデザインレビュー\nは、システム開発の各設計工程において、設計仕様書やプロトタイプの内容を確認して問題点や改善点を発見するための活動です。システムに実装される機能、システム方式、インタフェース、UI、セキュリティなどが適切に設計されているかどうかを検証します。\nデザインレビューの目的は、システムの欠陥をなるべく早い段階で発見し是正し、後戻りリスクを最小限に抑えることです。開発コストの増加や納期遅れの防止、プロダクトの最終的な品質を高めるために非常に重要なプロセスです。\nしたがって適切な記述は「ア」です。\n正しい。デザインレビューの目的です。\n出荷判定の目的です。\nプログラムの探針テストの目的です。\nプロジェクトのマネジメントレビューの説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q45.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q45.html",
    "title": "応用情報技術者令和7年春期問45 デザインレビューの目的はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "システムをバージョンアップするとき，システムの稼働環境を二つ用意しておき，一方の環境で現バージョンのシステムを稼働させた状態のままで他方の環境のシステムをバージョンアップし，ロードバランサーなどを使って稼働環境を切り替える。これによって，切替えに伴うシステムのダウンタイムを短くするとともに，バージョンアップしたシステムで不具合が発生したときには，元のバージョンに切り戻す時間を短くすることができる。この手法を何というか。\n\n---\n【選択肢】\nア: ブルーグリーンデプロイメント\nイ: ホットスタンバイ\nウ: ホットスワップ\nエ: ローリングアップデート",
    "back": "【正解】 ア\n\n【解説】\n正しい。\nブルーグリーンデプロイメント\nは、同じ構成のブルー環境（旧バージョン）とグリーン環境（新バージョン）の2つを用意しておき、ロードバランサーのトラフィックを切り替えることによって新バージョンへの移行を図る手法です。もし不具合が起きた場合は、即座に旧環境へ切り戻すことが可能であり、ダウンタイムの最小化と安全なリリースを両立することができます。CI/CDの継続的リリースにおいて、デプロイを無停止・低リスクで行うために利用されています。\nホットスタンバイは、予備系にも主系と同じシステムを起動し、データを同期をしておくことで、障害発生時に即座に予備系に切り替えることができる障害復旧方式です。\nホットスワップは、コンピュータの電源を入れたままハードウェア部品の着脱・交換を可能とする機能です。ホットプラグとも呼ばれます。\nローリングアップデートは、システム全体を一斉にアップデートするのではなく、サーバやコンテナごと段階的に新バージョンに入れ替えていく方式です。サービスを停止せずに更新可能で、問題があった場合にはロールバックで旧バージョンに戻すこともできます。ただし、トラフィックを切り替えるだけのブルーグリーンデプロイメントと比べて、切戻しに要する時間は長くなります。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q46.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q46.html",
    "title": "応用情報技術者令和7年春期問46 バージョンアップの適用手法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "ソフトウェアの保守性を定量評価する指標として，適切なものはどれか。\n\n---\n【選択肢】\nア: (運用期間中に発生した不具合件数)÷(プログラムの規模)\nイ: (適正規模の基準を満たすプログラムの数)÷(プログラムの総数)\nウ: (テスト実施済みの分岐の数)÷(プログラムの総分岐数)\nエ: (プログラムの推定総エラー数)－(摘出エラー数)",
    "back": "【正解】 イ\n\n【解説】\n保守性\n(Maintainability)は、ソフトウェア製品の修正しやすさを示す品質特性です。\nそのシステム／ソフトウェアを正常に運用するために行う保全作業、障害の解析と復旧、システム移行といった「保守活動」に必要な労力の程度を示し、保守性が高いほど、こうした運用後の作業を効率的に行えるシステムと評価されます。保守性の評価指標としては、MTTR（平均修復時間）、プログラムの行数、構造の複雑性、変更容易性、モジュール結合度、コメント率などがあります。\n発生不具合密度を示す式なので、ソフトウェアの信頼性を示す指標と言えます。\n正しい。ソフトウェアの規模が拡大すると、ソースコードの量や構成要素が増加して複雑さが増します。複雑性が高まると、データやモジュール間の依存関係が強くなって、1つの変更や修正の影響する範囲を把握するのが難しくなります。逆にプログラムの規模を小さく分割しすぎても管理が難しくなります。このようにプログラムの規模と保守性の間には関連があるので、適正規模のプログラムの割合によりソフトウェアの保守性を測ることができます。\nテストカバレッジを示す式なので、ソフトウェアテストの網羅度を示す指標と言えます。\n残存バグ数を示す式なので、ソフトウェアテストの進捗を示す指標と言えます。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q47.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q47.html",
    "title": "応用情報技術者令和7年春期問47 保守性の評価指標｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "XP(Extreme Programming)のプラクティスの一つであるものはどれか。\n\n---\n【選択肢】\nア: 構造化プログラミング\nイ: コンポーネント指向プログラミング\nウ: ビジュアルプログラミング\nエ: ペアプログラミング",
    "back": "【正解】 エ\n\n【解説】\nエクストリームプログラミング\n(XP：Extreme Programming)は、1990年代後半、Kent Beck氏らによって提唱されたソフトウェア開発手法で、アジャイルソフトウェア開発と称される一連の手法の先駆けとなったものです。『プログラマーは人間である』という思想のもと、叩き台となるプログラムを早期に開発し、短いサイクルで頻繁にテストとリリースを繰り返すことで、顧客の要求への対応力と生産性を高め、リスクを軽減することを目的としています。\nXPでは、ソフトウェア開発に有益である要素を4つのカテゴリ、19のプラクティスとして定義していますが、そのうち一つが「ペアプログラミング」です。これは二人一組で実装を行い、1人が実際のコードをコンピュータに打ち込み、もう1人はそれをチェックしながら補佐するという役割を随時交代しながら作業を進めるという手法です。\nペアプログラミングを行うことで、細々した問題解決に要する時間が短くなる、常にコードレビューを行うことができる、集中力が持続する、コードの詳細を理解したメンバーが常に2人以上いることで後々のコード共有に役立つ、などの多彩な効果を得ることができるとされています。\n構造化プログラミングは、1970年代に登場したプログラミング手法であり、「順次・分岐・反復」という3つの基本制御構造に従ってプログラムを構成する方法論です。\nソフトウェアを再利用可能な「コンポーネント」として構成する考え方です。1970年代から提唱されはじめ、1990年代にソフトウェアコンポーネントのアーキテクチャとして定着しました。\nテキストではなく、アイコンやブロック、図形などの視覚要素を使ってプログラミングを行う手法です。ScratchやLabVIEWなどがこれに該当します。\n正しい。ペアプログラミングは、XPの代表的なプラクティスのひとつです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q48.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q48.html",
    "title": "応用情報技術者令和7年春期問48 XP(Extreme Programming)｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "分散システムの脆弱性を実験によって発見する手法であるカオスエンジニアリングには，五つの原則がある。この原則のうちの三つは，\"定常状態における振る舞いの仮説を立てる\"，\"実世界の事象を多様化させる\"，\"継続的に実行できるよう実験を自動化する\"である。あと二つの原則の組みはどれか。\n\n---\n【選択肢】\nア: \"開発環境で実験を行う\"，\"影響範囲を局所化する\"\nイ: \"開発環境で実験を行う\"，\"影響範囲を広く捉える\"\nウ: \"本番環境で実験を行う\"，\"影響範囲を局所化する\"\nエ: \"本番環境で実験を行う\"，\"影響範囲を広く捉える\"",
    "back": "【正解】 ウ\n\n【解説】\nカオスエンジニアリング\n(Chaos Engineering)は、システムが本番環境における不安定な状態に耐える能力へ自信を持つためにシステム上で実験を行う訓練方法です。Netflixが導入したことで注目されるようになった手法です。\nサービスが多数連携して動作する大規模な分散型のシステムの本番環境において、実際に小規模の障害（サーバダウンや応答遅延など）を意図的に発生させ、システムの挙動がどのように変化するのかを測定します。定常状態を保つことできれば、システムの挙動はより確実と言えます。定常状態を乱す脆弱性が発見された場合は、そのシステムの動作が顕著に現れる前に改善の目標を立てます。\nカオスエンジニアリングの5つの原則は次のとおりです（内容は要約）。\n定常状態における振る舞いの仮説を立てる\nシステムの内部属性ではなく、測定可能なシステム出力（スループットやエラーレートなど）に着目し、定常状態の挙動を仮定する。目的はシステムが機能しているかを検証することである\n実世界の事象は多様である\nハードウェア障害・ソフトウェアの不具合・急激なトラフィック変化など、現実世界の事象を反映する変数を導入し、その影響度や発生頻度に応じて事象に優先順位をつける\n本番環境で検証を実行する\nシステムは環境やトラフィック状況によって挙動が異なり、また利用状況は常に変わるため、本番環境のトラフィック上で直接検証する\n継続的に実行する検証の自動化\n手動の検証は非効率なため、実験は自動化し、継続して実行する\n影響範囲を局所化する\nエンジニアには本番環境での検証による被害を最小限に抑える責任と義務がある\n残る2つは\"\n本番\n環境で実験を行う\"、\"影響範囲を\n局所化\nする\"です。したがって「ウ」の組合せが正解です。\n参照URL: カオスエンジニアリングの原則\nhttps://principlesofchaos.org/ja/\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q49.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q49.html",
    "title": "応用情報技術者令和7年春期問49 カオスエンジニアリングの5つの原則｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "A，B，Cの順序で入力されるデータがある。各データについてスタックへの挿入と取出しを1回ずつ行うことができる場合，データの出力順序は何通りあるか。\n\n---\n【選択肢】\nア: 3\nイ: 4\nウ: 5\nエ: 6",
    "back": "【正解】 ウ\n\n【解説】\nA，B，Cの出力順序としては「3!＝6種類」があります。それぞれが出力可能であるかを検証します。\nA，B，C\npush(A) → pop → push(B) → pop → push(C) → pop の順序で出力可能です。\nA，C，B\npush(A) → pop → push(B) → push(C) → pop → pop の順序で出力可能です。\nB，A，C\npush(A) → push(B) → pop → pop → push(C) → pop の順序で出力可能です。\nB，C，A\npush(A) → push(B) → pop → push(C) → pop → pop の順序で出力可能です。\nC，A，B\npush(A) → push(B) → push(C) → pop → pop ❌\n※Cの出力後、Bより先にAを出力することができないため無理な順序です。\nC，B，A\npush(A) → push(B) → push(C) → pop → pop → pop の順序で出力可能です。\n以上より、データの出力順序は5通りになります。したがって「ウ」が正解です。\nスタックの構造上、後からpushされた要素を出力した後、その要素より2つ以上前にpushされた要素を続けて出力することはできません。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q5.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q5.html",
    "title": "応用情報技術者令和7年春期問5 データの出力順序は何通りあるか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "スクラムにおいて繰り返し実行するイベントのうち，ステークホルダに作業の結果をプレゼンテーションして，プロダクトゴールに対する進捗について話し合い，必要に応じてスコープを調整するイベントはどれか。\n\n---\n【選択肢】\nア: スプリントプランニング\nイ: スプリントレビュー\nウ: デイリースクラム\nエ: レトロスペクティブ",
    "back": "【正解】 イ\n\n【解説】\nスクラムガイドによれば、スプリント実施の際に行うべきイベントには、スプリントプランニング、デイリースクラム、スプリントレビュー、スプリントレトロスペクティブの4つがあります。\nスプリントプランニングは、スプリントの起点となるミーティングです。プロダクトバックログの中から、そのスプリントで開発する機能を決定し、作業の計画を立てます。\n正しい。\nスプリントレビュー\nは、スプリントの終了時にスプリントの成果を検査し、今後の適応を決定する活動です。主要なステークホルダーに成果物をプレゼンテーションし、プロダクトゴールに対する進捗について話し合います。\nデイリースクラムは、開発チーム全員の活動や進捗を共有するために、スプリント実施中に毎日10～15分程度行われる確認・調整のための会議です。昨日やったこと、今日やること、障害になっていることを各人が話す形式で行われます。コミュニケーションを改善し、障害物を特定し、迅速な意思決定を促進するために行われます。\nレトロスペクティブは、スプリントの最後に実施したスプリント全体を振り返る活動です。次のスプリントを見据えて、上手くいったこと、上手くいかなかったこと、それに対する改善法・解決法を話し合います。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q50.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q50.html",
    "title": "応用情報技術者令和7年春期問50 スクラム開発のイベント｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "プロジェクトマネジメントにおける\"プロジェクト憲章\"の説明はどれか。\n\n---\n【選択肢】\nア: プロジェクトの実行，監視，管理の方法を規定するために，スケジュール，リスクなどに関するマネジメントの役割や責任などを記した文書\nイ: プロジェクトのスコープを定義するために，プロジェクトの目標，成果物，要求事項及び境界を記した文書\nウ: プロジェクトの目標を達成し，必要な成果物を作成するために，プロジェクトで実行する作業を階層構造で記した文書\nエ: プロジェクトを正式に認可するために，ビジネスニーズ，目標，成果物，プロジェクトマネージャ，及びプロジェクトマネージャの責任・権限を記した文書",
    "back": "【正解】 エ\n\n【解説】\nプロジェクト憲章\nは、プロジェクトの背景や目的、実施要綱、方針などを最上位レベルで明記し、当該プロジェクトを正式に立ち上げる際に作成される文書です。\nプロジェクト憲章は、プロジェクトに対する組織のコミットメントを示します。プロジェクトマネージャに任命された人が草案を作成し、関係各所に申請して承認を受けます。この承認によりプロジェクト活動が正式に認可され、組織の資源を使用する権限がプロジェクトマネージャに与えられます。\nしたがって「エ」が正解です。\nプロジェクトマネジメント計画書の説明です。\nプロジェクトスコープ記述書の説明です。\nWBS(Work Breakdown Structure)の説明です。\n正しい。プロジェクト憲章の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q51.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q51.html",
    "title": "応用情報技術者令和7年春期問51 プロジェクト憲章｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "EVMを使用してマネジメントをしているプロジェクトで，進捗に関する指標値は次のとおりであった。このプロジェクトに対する適切な評価と対策はどれか。\n〔進捗に関する指標値〕\nCPI(コスト効率指数)：0.9\nSPI(スケジュール効率指数)：1.1\nBAC(完成時総予算)に基づくTCPI(残作業効率指数)：1.2\n\n---\n【選択肢】\nア: コストが予算を超えているが，スケジュールには余裕があり，残作業のコスト効率を計画よりも上げる必要はないので，CPIに基づいて完成までに必要なコストを予測する。\nイ: コストが予算を超えているので，完成時総予算を超過するおそれがあるが，スケジュールには余裕があるので，残作業のコスト効率を上げる対策を検討するか，コンティンジェンシー予備費の使用を検討する。\nウ: コストには余裕があるが，スケジュールが予定より遅れており，残作業のコスト効率を計画よりも上げる必要があるので，ファストトラッキングなどを用いたスケジュール短縮を検討するとともに，コンティンジェンシー予備費の使用を検討する。\nエ: コストには余裕があるので，残作業のコスト効率を計画よりも上げる必要はないが，スケジュールが予定より遅れているので，クラッシングなどを用いたスケジュール短縮を検討する。",
    "back": "【正解】 イ\n\n【解説】\nEVMで使用される各指標の意味は次のとおりです。CPIとSPIはどちらも効率性を表す指標なので、高いほど良好であると覚えておきましょう。\nCPI（Cost Performance Index）\n実コストに対する予算コストの割合（EV／AC）。1.0は予算どおり、CPI＞1.0は予算未満、CPI＜1.0はコスト超過を意味する\nSPI（Schedule Performance Index）\n当初計画に対する進捗実績の比率（EV／PV）。1.0は計画どおり、SPI＞1.0は計画より進んでいる、SPI＜1.0は計画より遅れていることを意味する\nBAC（Budget At Completion）\nプロジェクト完成させるための総予算額\nTCPI（To Complete Performance Index）\nBACやEACなどの目標を達成するために、残りの作業に求められるコスト効率\n設問の指標値を見ると、CPIが1.0未満のためコストは『予算超過』の状態にあります。一方、SPIが1.0を上回っているためスケジュールは『計画より進んでいる』と判断できます。予算内でプロジェクトを達成するためには、残作業を当初の1.2倍（TCPI=1.2）のコスト効率で進めなければならないという状況です。\nTCPI=1.2より、残作業は計画値の1.2倍のコスト効率で進めなければなりません。よって、「コスト効率を計画よりも上げる必要はない」というのは明らかに誤りです。\n正しい。適切な評価と対策です。現時点のコストが予算を超えているので、プロジェクトを計画どおりに終了させるためには、コスト超過への対策を講じる必要があります。①コスト増を吸収するためにコスト効率（生産性）を高める対策を講じる、②コンティンジェンシー予備費をコスト超過の部分に充てる、のどちらもコスト超過への対処策として適切です。\nコストは超過、スケジュールは計画より進んでいます。どちらも逆に説明しているので誤った評価です。\nコストは超過、スケジュールは計画より進んでいます。どちらも逆に説明しているので誤った評価です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q52.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q52.html",
    "title": "応用情報技術者令和7年春期問52 EVM｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "プロジェクトの期間を短縮する方法のうち，クラッシングに該当するものはどれか。\n\n---\n【選択肢】\nア: 作業の前後関係を組み直し，実施する順番を変える。\nイ: 作業を分析し，同時に実施できる部分を複数の作業に分割し，並行して実施する。\nウ: 先行作業の一部の成果物が完成した時点で，後続作業を開始する。\nエ: プロジェクトの外部から要員を調達し，クリティカルパス上の作業に投入する。",
    "back": "【正解】 エ\n\n【解説】\nプロジェクト期間を短縮する方法は、クラッシングとファストトラッキングに大別されます。\nクラッシング\nアクティビティに追加資源を投入し、所要期間を短縮することでスケジュールの短縮を図る方法\nファストトラッキング\n開始当初の計画では直列に並んでいた作業を同時並行的に行ったり、作業の前後を入れ替えたりすることで期間短縮を図る方法\nファストトラッキングに該当します。\nファストトラッキングに該当します。\nファストトラッキングに該当します。\n正しい。要員(資源)を追加投入しているのでクラッシングに該当します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q53.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q53.html",
    "title": "応用情報技術者令和7年春期問53 クラッシングに該当するものはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "あるシステム開発プロジェクトのシステムテストにおけるテスト密度及び欠陥密度の値は，図に示した領域①～領域④のうち，領域④の範囲内であった。品質管理基準に照らして評価すると，行うべき活動として最も適切なものはどれか。ここで，このプロジェクトの品質管理基準では，定量評価の基準として，表に従ってテスト密度及び欠陥密度の基準値を設定した上で，テスト密度は基準値の80%以上であること，かつ，欠陥密度は基準値の80%以上120%未満であることと定めている。\n\n---\n【選択肢】\nア: 欠陥密度は基準を満たしているが，システムの品質に問題がないか，欠陥の妥当性を確認する。\nイ: システムの欠陥が多いので，検出した欠陥の原因を分析した上で，システムの品質改善に取り組む。\nウ: システムの欠陥を十分に検出できていない懸念があるので，テストの観点に漏れがないかなど，テストケースの妥当性を確認する。\nエ: テスト密度が不足しているので，システムの規模に見合うテストケース数以上となるように，テストケースを追加する。",
    "back": "【正解】 ウ\n\n【解説】\n設問のように、テスト密度と欠陥密度の2つの軸を用いたマトリクスで、ソフトウェアテストの妥当性を定量的に評価する手法は\nゾーン分析\nと呼ばれます。\n領域④は次のように特徴づけられる領域です。\nテスト密度：基準値20件×80％＝16件以上なので、品質基準を満たしている\n欠陥密度：基準値0.1件×80%＝0.08件未満なので、品質基準を満たしていない\nそれぞれの領域は次のような特徴をもちます。\n領域③に対して行うべき活動です。領域④は欠陥密度の基準を満たしていません。\n領域②に対して行うべき活動です。領域④は検出された欠陥が少ないことで基準を満たしていません。\n正しい。領域④に対して行うべき活動です。\n欠陥の検出率が少ない場合、本当に品質が高いこともありますが、テストの内容や効率に問題があって欠陥を検出できていない可能性もあります。このため、テスト内容や効率などの点検が必要です。\n領域①に対して行うべき活動です。領域④はテスト密度の基準を満たしています。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q54.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q54.html",
    "title": "応用情報技術者令和7年春期問54 システムテストにおける品質管理｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "あるサービスでは〔サービス可用性のSLA〕に基づき，サービス可用性の目標値の遵守状況を月ごとに測定して評価している。ある月の実績値は99.3%だった。この月にサービス可用性の目標値を達成するためには，サービス停止時間は，最低，何時間少なければよかったか。\n〔サービス可用性のSLA〕\nサービス可用性の目標値：99.5%以上\nサービス提供時間帯：7時～22時\nサービス提供日数：20日／月\n\n---\n【選択肢】\nア: 0.4\nイ: 0.6\nウ: 1.3\nエ: 1.95",
    "back": "【正解】 イ\n\n【解説】\n対象月におけるサービス可用性は99.3％であり、目標値の99.5％を0.2ポイント下回っています。可用性99.5％は、計画サービス時間全体のうち停止が0.5％以下と同じ意味なので、サービス停止時間の割合を現在の0.7％から0.2ポイントだけ削減できれば目標値を達成できます。\nサービス提供時間は1日当たり7～22時の15時間、20日／月なので、1カ月の計画サービス時間は、\n15時間×20日＝300時間\n300時間の0.2％に相当する時間は、\n300時間×0.2％＝0.6時間\nしたがって「イ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q55.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q55.html",
    "title": "応用情報技術者令和7年春期問55 サービスの可用性評価｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "A社は，自社がオンプレミスで運用している業務システムを，クラウドサービスへ段階的に移行する。段階的移行では，初めにネットワークとサーバをIaaSに移行し，次に全てのミドルウェアをPaaSに移行する。A社が行っているシステム運用作業のうち，この移行によって不要となる作業の組合せはどれか。\n〔A社が行っているシステム運用作業〕\n業務システムのバッチ処理のジョブ監視\n物理サーバの起動，停止のオペレーション\nハードウェアの異常を警告する保守ランプの目視監視\nミドルウェアへのパッチ適用\n\n---\n【選択肢】\nア: イウエ",
    "back": "【正解】 ウ\n\n【解説】\nIaaS\n(Infrastructure as a Service)では、物理サーバやネットワークなどのインフラがサービスとして提供され、それらの維持管理はサービス提供者が行います。\nPaaS\n(Platform as a Service)では、アプリケーションを開発し、稼働するための環境がサービスとして提供され、それらの維持管理はサービス提供者が行います。\nアプリケーションの運用はA社で行います。\n物理サーバの起動・停止は、\nIaaS\nの業者が行うので不要となります。\nハードウェア監視も、\nIaaS\nの業者が行うので不要となります。\nミドルウェアのパッチ適用は、\nPaaS\nの業者が行うので不要となります。\nしたがって「ウ」の組合せが適切です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q56.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q56.html",
    "title": "応用情報技術者令和7年春期問56 クラウドサービスへの移行で不要になる作業｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "サービスの継続的改善で，改善の達成目標を設定して活動するとき，\"サービスの提供やマネジメントの成功に重要な要因\"を特定したものを何というか。\n\n---\n【選択肢】\nア: CSF\nイ: KGI\nウ: KPI\nエ: OKR",
    "back": "【正解】 ア\n\n【解説】\n正しい。\nCSF\n(Critical Success Factor)は、\"重要成功要因\"とも呼ばれ、企業やプロジェクトの目標を達成する上で決定的な影響を与える要因のことです。「成功の鍵」となる要素であるため、リソースを優先的に投入する対象となります。\nKey Goal Indicatorの略で重要目標達成指標のこと。企業目標やビジネス戦略の遂行によって達成すべき到達目標(Goal)を、測定可能な数値で表したものです。\nKey Performance Indicatorの略で重要業績評価指標のこと。ビジネス戦略の目標達成に向けて実施される業務プロセスに関し、その実行状況を定量的に把握・評価するために設定される指標です。\nObjectives and Key Resultsの略で\"目標と主要な結果\"のこと。組織やチームが目指すべき目標（Objectives）と、その達成度を測定するための定量的な成果指標（Key Results）をセットで定め、目標達成に向けた進捗を継続的に管理・評価するためのフレームワークです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q57.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q57.html",
    "title": "応用情報技術者令和7年春期問57 サービスの継続的改善｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "システム監査におけるウォークスルー法の説明として，適切なものはどれか。\n\n---\n【選択肢】\nア: 機密データの保管状況に関する資料及び文書類を入手し，内容を点検する。\nイ: システムの運用状況について，関係者に口頭で問い合わせ，回答を入手する。\nウ: データの生成から入力，処理，出力，利活用までのプロセス，及び組み込まれている一連のコントロールを確認する。\nエ: テストデータを監査対象プログラムで処理し，期待した結果が出力されるかどうかを確かめる。",
    "back": "【正解】 ウ\n\n【解説】\nシステム監査基準(令和5年)では、監査手続の手法として、チェックリスト法、ドキュメントレビュー法、インタビュー法、ウォークスルー法、突合・照合法、現地調査法、コンピュータ支援監査技法（テストデータ法・監査モジュール法）等を挙げています。\nウォークスルー法は、システム監査基準ガイドラインver1において次のように定義されています。\nウォークスルー法\nデータの生成から入力、処理、出力、利活用までのプロセス及び組み込まれている一連のコントロールを確認する技法\nこの監査技法の目的は、業務プロセスの流れとその中で機能している統制（コントロール）を、実データや書面をもとに追跡・検証することにあります。設定されたコントロールがどのように実装・運用されているかを確認する上で重要です。\nしたがって「ウ」が適切な記述です。\nドキュメントレビュー法の説明です。\nインタビュー法の説明です。\n正しい。ウォークスルー法の説明です。\nテストデータ法の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q58.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q58.html",
    "title": "応用情報技術者令和7年春期問58 ウォークスルー法の説明はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "システム監査における\"監査手続\"として，最も適切なものはどれか。\n\n---\n【選択肢】\nア: 監査計画の立案や監査業務の進捗管理を行うための手続\nイ: 監査結果を受けて，監査報告書に監査人の結論や指摘事項を記述する手続\nウ: 監査項目について，十分かつ適切な証拠を入手するための手続\nエ: 監査テーマに合わせて，監査チームを編成する手続",
    "back": "【正解】 ウ\n\n【解説】\n監査手続\nとは、システム監査人が監査意見を裏付けるための十分かつ適切な\n監査証拠を入手するために実施する手続\nのことです。予備調査と本調査に分けて実施されます。\n監査手続に際しては、チェックリスト法、ドキュメントレビュー法、インタビュー法、突合・照合法、現場調査法、コンピュータ支援監査技法などがあり、一般的には複数の手法を組み合わせて実施します。監査手続で入手した監査証拠は、システム監査報告書に記載する監査結論の裏付けとなります。\nしたがって正解は「ウ」です。\n\"監査計画の策定\"に該当します。\n\"監査報告書の作成\"に該当します。\n正しい。監査手続は、監査の結論を裏付けるための監査証拠を入手するプロセスです。\n\"監査業務の体制構築\"に該当します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q59.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q59.html",
    "title": "応用情報技術者令和7年春期問59 監査手続はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "図の2分探索木に1と0の二つの要素を順に追加したAVL木として，適切なものはどれか。\n\n---\n【選択肢】\nア: \nイ: \nウ: \nエ: ",
    "back": "【正解】 ウ\n\n【解説】\nAVL木\nは、2分探索木の特徴に加え、どの節（ノードともいう）についても「左部分木と右部分木の高さの差が1以下」という条件を満たす平衡な木構造です。木の高さを一定に保つ自己平衡性をもつため、木の偏りが生じる通常の2分探索木と比べて、探索回数を安定させることができます。\nAVL木が満たすべき条件は以下のとおりです。\n各節から出る枝の数は最大で2\n各節が持つデータは、その節から出る左部分木にあるどのデータよりも大きく、右部分木のどのデータよりも小さい\n各節の左部分木と右部分木の高さの差が1以下\nまず要素1を追加します。要素1は上記②の性質により、要素2の左部分木として配置されます。この時点では、どの節においても左部分木と右部分木の高さの差は1以下に保たれています。\n次に要素0を追加します。要素0は上記②の性質により、要素1の左部分木として配置されます。0の追加により、要素2、3、5において左右の部分木の高さの差が2となり、AVL木の平衡条件に反する状態となります。\n0のように平衡条件を満たさないノードが存在する場合、AVL木では平衡状態を保つように回転操作が行われます。回転とは、バランスが崩れる原因となっている部分木の1つのノードを上にし、別のノードを下にすることで順序を維持したまま再構成する操作です。\n回転は葉に近い要素から順に行われるため、0-1-2の部分木がその対象となり、1を節点とし、0が左部分木、2が右部分木となるように再構成されます（右回転）。これにより、高さの差が1以下を満たします。\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q6.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q6.html",
    "title": "応用情報技術者令和7年春期問6 AVL木｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "システム管理基準(令和5年)における，ユーザ受入テストに関する監査のチェックポイントとして，適切なものはどれか。\n\n---\n【選択肢】\nア: 構築された情報システムに，業務要件が適切に反映されていることを確認するために，利用者の立場からテストされていること\nイ: 情報システムの稼働後に，IT戦略における目標を達成しているかどうかを確認するために，客観的な情報に基づいてテストされていること\nウ: 利用者からのシステム要件が適切に反映されていることを確認するために，情報システムの全ての構成要素について，中間成果物も含めてレビューされていること\nエ: 利用者が情報システムを利用できるようにするために，情報システムの移行後に，移行結果について，本番環境が利用可能かどうかレビューされていること",
    "back": "【正解】 ア\n\n【解説】\nシステム管理基準(令和5年)では、ユーザ受入テストの目的と範囲を「業務要件を情報システムに適切に反映していることを確認するために、利用者の立場からテストする」と定め、次の2つを達成目標に位置づけています。\n実装および統合された情報システムについて、業務要件が満足されている\nユーザ受入テストで発見された不具合が適切に改善されている\nユーザ受入テストの管理活動の例は以下のとおりです。\nユーザ受入テスト計画\nユーザ受入テストの範囲、手順、関連システムおよびサービス、および制約を明確にし、スケジュールを調整する\nユーザ受入テスト結果のレビュー\n情報システムが業務要件を充足していることを示す裏付けを入手し、レビューする\nユーザ受入テスト結果の文書化と承認\nユーザ受入テストの結果を文書化し、承認を得る\n不具合の改善\nユーザ受入テストで発見された不具合および改善結果を記録し、不具合の改善状況をフォローアップする\n正しい。\"ユーザ受入テスト\"に関する監査のチェックポイントです。\n\"稼動後評価と報告\"に関する監査のチェックポイントです。\n開発したシステムの\"検証\"に関する監査のチェックポイントです。\n\"本番環境への移行\"に関する監査のチェックポイントです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q60.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q60.html",
    "title": "応用情報技術者令和7年春期問60 ユーザ受入テストに関する監査｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "DX認定制度における認定基準に含まれている事項はどれか。\n\n---\n【選択肢】\nア: 経営ビジョン及びDX戦略を策定して対外発信を行うことに加えて，ビジネスモデルの革新などデジタル技術活用の成果目標も既に達成していること\nイ: 経営ビジョン及びビジネスモデルの方向性を公表するとともに，策定したビジネスモデルを実現するための方策として，DX戦略を公表していること\nウ: 申請対象が，中小企業基本法で定められた中小企業であること\nエ: デジタルガバナンス・コード3.0の全項目に対応していること",
    "back": "【正解】 イ\n\n【解説】\nDX認定制度\nは、情報処理の促進に関する法律に基づき、デジタルガバナンス・コードの基本的事項に対応する企業（DXに取り組んでいる企業）を国が認定する制度です。認定を受けた事業者は、Webサイトや名刺等にDX認定のロゴマークを使用することができます。認定は2年ごとの更新制です。\nデジタルガバナンス・コードとは、デジタル技術による社会変革を踏まえて経営者に求められる対応をまとめた指針です。2025年5月現在の最新版3.0では、次の項目ごとに基本的事項（柱となる考え方、認定基準）、望ましい方向性が示されています。\n1．経営ビジョン・ビジネスモデルの策定\n2．DX戦略の策定\n3．DX戦略の推進\n3-1．組織づくり\n3-2．デジタル人材の育成・確保\n3-3．ITシステム・サイバーセキュリティ\n4．成果指標の設定・DX戦略の見直し\n5．ステークホルダーとの対話\nDXの達成度合いを測るものではありません。DX戦略の達成度を測る指標について公表していることが認定基準となります。\n正しい。経営ビジョンおよびビジネスモデルの方向性、所定の事項を含むDX戦略の両方を公表していることが認定基準の一つとなっています。\n個人、法人、企業規模等を問わず、全ての事業者を対象とします。\nデジタルガバナンス・コードは項目ごとに「基本的事項」と「望ましい方向性」が示されています。DX認定で審査されるのは「基本的事項」への対応状況に限られます。\n※DX認定では、Webサイトなどの公開文書を通じて「デジタル技術を活用して企業がビジネス変革に取り組むための\n準備が整っている状態\n」であることが審査されます。あくまでも「これからDXに取り組む企業」といったレベル感です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q61.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q61.html",
    "title": "応用情報技術者令和7年春期問61 DX認定制度の認定基準｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "A社は，ソリューションプロバイダから，顧客に対するワントゥワンマーケティングを実現する統合的なソリューションの提案を受けた。この提案が該当するソリューションとして，最も適切なものはどれか。\n\n---\n【選択肢】\nア: CRMソリューション\nイ: HRMソリューション\nウ: SCMソリューション\nエ: 財務管理ソリューション",
    "back": "【正解】 ア\n\n【解説】\nワントゥワンマーケティング\nとは、顧客1人ひとりの嗜好やニーズに合わせて個別に対応を変化させて展開されるマーケティング活動です。市場シェアの拡大よりも、顧客との好ましい関係を築き、長期にわたって自社製品を購入する顧客の割合を高めることに重点を置くことで、1人の顧客から得られる生涯利益（LTV：Life Time Value）を最大化することを目的としています。\nワントゥワンマーケティングを展開するには顧客1人ひとりの詳細かつ網羅的な情報が欠かせません。CRM(Customer Relationship Management)システムは、顧客に関するあらゆる情報を統合管理して企業活動に役立てる経営システムですので、ワントゥワンマーケティングの目的に合致しています。\nしたがって「ア」が正解です。\n正しい。CRMは、連絡先情報、購買履歴、コンタクト履歴などを記録し、顧客との関係を効率的に管理するためのソリューションです。\nHuman Resource Managementの略。人事資源管理のためのソリューションです。\nSupply Chain Managementの略。生産・在庫・購買・販売・物流などの一連の業務の流れを一元管理するためのソリューションです。\n会計業務を管理するためのソリューションです。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q62.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q62.html",
    "title": "応用情報技術者令和7年春期問62 適切なソリューションはどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "クラウドサービスなどの提供を迅速に実現するためのプロビジョニングの説明はどれか。\n\n---\n【選択肢】\nア: 企業の情報システムの企画，設計，開発，導入，保守などのサービスを，一貫して又は工程の幾つかを部分的に提供する。\nイ: 業種や事業内容などで共通する複数の企業や組織が共同でデータセンターを運用して，それぞれがインターネットを通して各種サービスを利用する。\nウ: 自社でハードウェア，ネットワークなどの環境を用意し，業務パッケージなどを導入して利用する運用形態にする。\nエ: 利用者の需要を予想し，ネットワーク設備やシステムリソースなどを計画的に調達して強化し，利用者の要求に応じたサービスを提供できるように備える。",
    "back": "【正解】 エ\n\n【解説】\nプロビジョニング\nは、ITシステムの運用に必要なハードウェア、ソフトウェア、ネットワーク、ユーザーアカウントなどをあらかじめ準備・セットアップし、利用可能な状態にする一連の作業を指します。Provisioningは「準備、供給」といった意味をもつ英単語です。\nクラウドサービスでは、利用者が必要とするタイミングで必要とするだけのコンピュータ資源を利用できる必要があります。そのため、提供側では需要の変動をあらかじめ予測し、必要となるシステムリソースを計画的に準備・配備しておくことが求められます。このような事前のリソース確保や構成作業を指す概念が「プロビジョニング」であり、クラウドのスケーラビリティを技術的に支える仕組みです。\nしたがって「エ」が適切な記述です。\nシステムインテグレーション（SI）サービスの説明です。\nコミュニティクラウドの説明です。\nオンプレミスの説明です。\n正しい。プロビジョニングの説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q63.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q63.html",
    "title": "応用情報技術者令和7年春期問63 プロビジョニングの説明はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "製品Xと製品Yを販売している企業が，見積作成と提案書作成に掛かる業務時間を，それぞれ20%削減できるシステムの構築を検討している。Activity-Based Costingを用いて，次の条件が洗い出された。本システム構築による製品Xの見積作成と製品Xの提案書作成に関する月間総人件費削減効果は幾らか。\n〔条件〕\n製品Xの見積作成に掛かる月間業務時間は，50時間\n製品Xの提案書作成に掛かる月間業務時間は，50時間\n製品Yの見積作成に掛かる月間業務時間は，100時間\n製品Yの提案書作成に掛かる月間業務時間は，400時間\n製品Xと製品Yの見積作成に掛かる月間総人件費は，60万円\n製品Xと製品Yの提案書作成に掛かる月間総人件費は，360万円\n見積作成と提案書作成は，それぞれ人件費単価が異なる部門が担っている。\n製品Xと製品Yの見積作成に掛かる人件費単価は，同じである。\n製品Xと製品Yの提案書作成に掛かる人件費単価は，同じである。\n\n---\n【選択肢】\nア: 4万円\nイ: 8万円\nウ: 12万円\nエ: 14万円",
    "back": "【正解】 ウ\n\n【解説】\nActivity-Based Costing\n(ABC：活動基準原価計算)は、企業内で行われる様々な「活動」を定義し、それぞれの活動量に応じて計算したコストを製品やサービスに割り当てることで、原価をより正確に把握するための方法です。\n作業ごとの人件費単価が同じなので、総人件費を業務時間で割って人件費単価を求めます。\n見積作成に係る人件費単価\n60万円÷(50時間＋100時間)＝0.4万円\n提案書作成に係る人件費単価\n360万円÷(50時間＋400時間)＝0.8万円\n新システム構築により、製品Xの見積作成時間は「50時間×80%＝40時間」に、提案書作成時間は「50時間×80%＝40時間」になるため、製品Xについての削減効果は、\n0.4万円×10時間＋0.8万円×10時間＝12万円\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q64.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q64.html",
    "title": "応用情報技術者令和7年春期問64 月間総人件費削減効果は幾らか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "システム管理基準(令和5年)によれば，企画プロセスにおけるビジネス分析の達成目標の一つとして，適切なものはどれか。\n\n---\n【選択肢】\nア: あるべきビジネスモデル及び業務プロセスによって生じる問題やメリットが明確にされている。\nイ: 関連する情報システム及び情報システムの構成要素間のインタフェースが特定されている。\nウ: 重要な情報システムの遂行能力・性能・稼動率などの実績の測定量が明確にされている。\nエ: 優先順位付けされた要望が業務要件として明確にされ，利用者及び関係者と合意されている。",
    "back": "【正解】 ア\n\n【解説】\nシステム管理基準(令和5年)によれば、企画プロセスの実施内容は「経営戦略及びIT戦略で定められた目標を達成するために必要な情報システムの開発体制を整備し、ビジネスモデル及び業務要件を明確にして、設計作業を行う」ことです。次の4つの子プロセスから構成されます。\nビジネス分析\n業務要件定義\nシステム要件定義\n基本設計\n詳細設計\n実現可能性及び効果の分析\nビジネス分析\nは、利用部門とIT部門が連携して利用者の立場からビジネスを分析し、あるべきビジネルモデルとそれを実現するソリューションを選定するプロセスとされています（共通フレーム2013の企画プロセスに対応）。次の4つの達成目標が定義されています。\nあるべきビジネスモデル及び業務プロセスが明確にされている\nあるべきビジネスモデル及び業務プロセスによって生じる問題やメリットが明確にされている\nシステムソリューションの候補が特定されている\nあるべきビジネスモデルの実現可能性及び効果を分析して、システムソリューションの候補が選定されている\n正しい。システム化の前提となる新しいビジネルモデルの構築に関する事項なので、ビジネス分析の達成目標です。\nシステムのインタフェースに関する事項なので、基本設計の達成目標です。\nシステムの性能に関する事項なので、システム要件定義の達成目標です。\n業務要件の定義に関する事項なので、業務要件定義の達成目標です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q65.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q65.html",
    "title": "応用情報技術者令和7年春期問65 システム管理基準｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "ベンダーX社に対して，表に示すように要件定義フェーズから運用テストフェーズまでを委託したい。X社との契約に当たって，\"情報システム・モデル取引・契約書＜第二版＞\"に照らし，各フェーズの契約形態を整理した。a～dの契約形態のうち，準委任型が適切であるとされるものはどれか。\n\n---\n【選択肢】\nア: a，b\nイ: a，d\nウ: b，c\nエ: b，d",
    "back": "【正解】 イ\n\n【解説】\n情報システム・モデル取引・契約書\nは、ユーザーとベンダーのあるべき理想的なモデルを提示し、情報システムのライフサイクルプロセスの中で、『ユーザーとベンダーの間でどのようなことを決定し、どのようなことを情報共有すればよいか』についての統一的な指針を目指して策定されたガイドラインです。\n準委任契約\nは、仕事の完成を目的とする請負契約と異なり、委託された仕事の実施自体を目的とする契約形態です。受託者は善良な管理者の注意をもって委任事務を処理する義務（善管注意義務）を負うものの、仕事の完成についての義務は負いません。主に業務分析や要件定義、運用テスト工程などの成果物が特定されていない状況で結ばれます。\n情報システム・モデル取引・契約書では、フェーズの分類と対応する契約類型を以下のように規定しています。\n要件定義と運用テストは「準委任型」の契約、システム内部設計とシステム結合は「請負型」の契約が適切とされています。したがって「a，d」の組合せが適切です。\n参考URL: 情報システム・モデル取引・契約書＜第二版＞\nhttps://www.ipa.go.jp/digital/model/model20201222.html\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q66.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q66.html",
    "title": "応用情報技術者令和7年春期問66 情報システム・モデル取引・契約書｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "市場成長率と相対的市場シェアから，市場と企業との関係を分析し，自社製品や事業についての最適な資源配分方針を求めるための手法はどれか。\n\n---\n【選択肢】\nア: 3C\nイ: BSC\nウ: PPM\nエ: SWOT",
    "back": "【正解】 ウ\n\n【解説】\n3C分析は、マーケティング分析に必要不可欠である顧客(Customer)、自社(Company)、競合他社(Competitor)の3つの視点から、自社の置かれている状況を分析する手法です。\nBalanced Score Cardの略。企業のビジョンを明確化し戦略を実現するために、「財務」「顧客」「業務プロセス」「学習と成長」という4つの視点から業績を評価・分析する手法です。\n正しい。\nPPM\n(Products Portfolio Management)は、市場成長率と市場占有率の2軸からなるマトリックスを用いて、自社の製品や事業を4つの象限（花形、金のなる木、問題児、負け犬）に分類し、それぞれの現状を分析することで、経営資源の最適配分や今後の戦略立案に役立てる手法です。\nSWOT分析は、企業内外の要因を、S(Strength：強み)、W(Weakness：弱み・弱点)、O(Opportunity：機会)、T(Threat：脅威)の4つに分類することで、企業の置かれている経営環境を分析する手法です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q67.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q67.html",
    "title": "応用情報技術者令和7年春期問67 市場成長率と市場シェアで分析する手法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "プライスライニング戦略はどれか。\n\n---\n【選択肢】\nア: 消費者が選択しやすいように，複数の価格帯に分けて商品を用意する。\nイ: 商品の品質の良さやステータスを訴えるために意図的に価格を高く設定する。\nウ: 商品本体の価格を安く設定し，関連消耗品の販売で利益を得る。\nエ: 新商品に高い価格を設定して早い段階で利益を回収する。",
    "back": "【正解】 ア\n\n【解説】\nプライスライニング戦略\nは、価格ライン戦略とも呼ばれ、3,000円(普及品)、5,000円(中級品)、10,000円(高級品)というように数段階の価格帯に分けて商品展開することをいいます。ネクタイ、スーツ、お中元やお歳暮売場などでよく見られます。価格によって品質やグレードが明確になっているので、消費者側には自分が求めているものを選択しやすいという利点があります。2つの価格帯だけ用意する場合は「ハイロープライシング」、3つの価格帯を用意する場合は「松竹梅戦略」などとも呼ばれます。\nしたがって「ア」の説明が適切です。\n正しい。プライスライニング戦略の説明です。\n威光（名声）価格戦略の説明です。「高いものは品質もいいだろう」という心理を利用するもので、ブランド品や化粧品によく見られます。\nキャプティブ価格戦略の説明です。キャプティブ(Captive)とは捕虜の意味で、プリンター本体を安く売ってインクで利益を上げる、携帯電話を安く売って通信料金で利益を上げる、ゲーム機本体を安く売ってゲームソフトを高く売るなどの例があります。\nスキミングプライス戦略の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q68.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q68.html",
    "title": "応用情報技術者令和7年春期問68 プライスライニング戦略はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "カーシェアビジネスをビジネスモデルキャンバスに当てはめた。bに該当するものはどれか。なお，ア～エはa～dのいずれかに該当する。\n〔カーシェアビジネス〕\nカーディーラーから車両を調達し，維持メンテナンスしながら，その車両を提携駐車場に保管・準備する。\n必要なときだけ車両を使いたい人が登録する会員制度を構築し，会員から月会費を徴収する。\n会員向けのWebサイトで，会員に使いたい車両や利用時間などを予約してもらい，会員に対して車両の時間貸しを行い，利用料を徴収する。\n〔ビジネスモデルキャンバス〕\n\n---\n【選択肢】\nア: 月会費，利用料\nイ: 車両\nウ: 車両の時間貸し\nエ: 必要なときだけ車両を使いたい人",
    "back": "【正解】 ウ\n\n【解説】\nビジネスモデルキャンバス\nは、あらゆるビジネスモデル（どのように顧客に価値を創造し、顧客に届けるかを論理的に記述したもの）を9つの観点から分析するフレームワークです。\nビジネルモデルを共通のフレームワークで表すことにより、既存ビジネスモデルの分析・比較や新規ビジネスモデルの策定などに役立てることができます。1ページにすべての要素を記述するので、文章で長々とビジネスモデルを記述するのと比較して、作成の容易さ、共有のしやすさ、簡潔性などの優位性があります。\n月会費・利用料は、ビジネルが得る収入の形なのでR$(Revenue Streams：収益の流れ)に記入します（d）。\n車両は、ビジネスの実行に必要な資産なのでKR(Key Resources：リソース)に記入します（a）。\n正しい。車両の時間貸しは、ビジネスが顧客に対して行う価値提案そのものなのでVP(Value Propositions：価値提案)に記入します（b）。\n必要なときだけ車両を使いたい人は、ビジネスのターゲットとなる顧客層なのでCS(Customer Segments：顧客セグメント)に記入します（c）。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q69.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q69.html",
    "title": "応用情報技術者令和7年春期問69 ビジネスモデルキャンバス｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "fact(n)は，非負の整数nに対してnの階乗を返す。fact(n)の再帰的な定義はどれか。\n\n---\n【選択肢】\nア: if n＝0 then return 0 else return n×fact(n－1)\nイ: if n＝0 then return 0 else return n×fact(n＋1)\nウ: if n＝0 then return 1 else return n×fact(n－1)\nエ: if n＝0 then return 1 else return n×fact(n＋1)",
    "back": "【正解】 ウ\n\n【解説】\nnの階乗（n!）は、1からnの全ての整数の積です。それぞれの関数定義に対して引数 4 を与えてみて、4の階乗の結果である「4×3×2×1＝24」が得られるかどうかで正誤を判別します。\nfact(4)\n＝4×fact(3)\n//n＞0\n＝4×3×fact(2)\n//n＞0\n＝4×3×2×fact(1)\n//n＞0\n＝4×3×2×1×fact(0)\n//n＞0\n＝4×3×2×1×0\n//n＝0\n＝0\nfact(4)\n＝4×fact(5)\n//n＞0\n＝4×5×fact(6)\n//n＞0\n＝4×5×6×fact(7)\n//n＞0\n・・・以降、無限ループとなり計算できません。\nfact(4)\n＝4×fact(3)\n//n＞0\n＝4×3×fact(2)\n//n＞0\n＝4×3×2×fact(1)\n//n＞0\n＝4×3×2×1×fact(0)\n//n＞0\n＝4×3×2×1×1\n//n＝0\n＝\n24\nfact(4)\n＝4×fact(5)\n//n＞0\n＝4×5×fact(6)\n//n＞0\n＝4×5×6×fact(7)\n//n＞0\n・・・以降、無限ループとなり計算できません。\nしたがって正しい関数定義は「ウ」です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q7.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q7.html",
    "title": "応用情報技術者令和7年春期問7 階乗を求める再帰関数｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "フリーミアムの特徴はどれか。\n\n---\n【選択肢】\nア: Webサイト内の広告だけを収益源としているので，サービスの維持・拡大が困難である。\nイ: 全ての利用者に広く課金するモデルである。\nウ: 有料と無料の境界が明確になっていて，高度な機能や充実した内容など有料のサービスの優位性がはっきりしている。\nエ: 利用者ごとに掛かるコストが大きいので，少数の利用者が限定的に使うような場合にだけ，より高い効果が見込める。",
    "back": "【正解】 ウ\n\n【解説】\nフリーミアム\nは、フリー（無料）とプレミアム（割増料金）を合わせた造語で、基本的なサービス・製品は無料で提供し、さらに高度な機能や特別な機能については料金を課金するビジネスモデルです。サービス・製品に触れる敷居を下げて、新規の顧客が入ってくる間口を広げる最大化戦略を採りつつ、有料戦略を組み合わせて利益を確保しようとするものです。\nインターネットサービスにおけるビジネスモデルとしては一般的で、オンラインストレージ（基本は無料で利用可能だが、容量の追加や高機能には課金が必要）、動画・音楽配信系サービス（視聴は無料だが広告付き、有料で広告非表示等）、他にもSNS・コミュニケーションツール系、学習・開発・制作系のSaaSなど様々なサービスで見られる形態です。\n当サイトは基本無料ですが、有料のメンバーシップ制度でメンバー向けに特別な機能を提供しているので、フリーミアムのビジネスモデルということになります。\nフリーミアムは広告によるマネタイズに加え、有料利用者に対する直接的な課金も収益源とします。\nフリーミアムは「無料＋一部課金ユーザー」という構造が特徴です。大多数の利用者は無料で利用し、一部のユーザーが有料機能を購入する形となります。\n正しい。フリーミアムは無料版で基本的な利便性を提供しながら、さらなる付加価値を有料版で提供します。有料機能に十分な魅力があり、ユーザーに『利用したい』と思わせることが成功の鍵となります。\nデジタルサービスはその特有の性質により、追加ユーザーが増加しても限界費用（ユーザー1人あたりの追加コスト）が極めて小さい点が特徴です。有料プランに移行するのは少数のユーザーに限られるため、多数の無料ユーザーを獲得することがフリーミアム戦略の前提となります。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q70.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q70.html",
    "title": "応用情報技術者令和7年春期問70 フリーミアムの特徴はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "クラウドで学習し，エッジデバイスで推論する機械学習ベースのエッジAIにおいて，エッジデバイスで行われる推論処理として，適切なものはどれか。\n\n---\n【選択肢】\nア: 一定の環境の中で試行錯誤を行い，行動に報酬を与えることで学習するプロセス\nイ: 学習したモデルに従い，実際にデータの識別などを行うプロセス\nウ: 識別などを行うためのモデルを，正解のラベルを付けたデータによって作成するプロセス\nエ: 識別などを行うためのモデルを，正解のラベルを付けないデータによって作成するプロセス",
    "back": "【正解】 イ\n\n【解説】\nエッジAI\nは、エッジコンピューティングの一形態で、クラウド上のサーバで重い学習処理を行い、その成果物であるモデルを端末の位置する機器（エッジデバイス）に搭載させて軽量な推論処理を行わせるアーキテクチャです。\nサーバ上で推論を行った結果を返す従来の仕組みと比べて、通信に要する時間や通信量を削減でき、また通信が不安定な場面でも動作するため、即時性の求められる処理で有効です。\n学習プロセス（強化学習）に該当します。\n正しい。機械学習における「推論」は、学習済みのモデルを使って、未知のデータに対して予測や分類などを行う処理を指します。「学習」に比べて処理が軽い「推論」をエッジデバイス上で行わせるのが、エッジAIの基本構造です。\n学習プロセス（教師あり学習）に該当します。\n学習プロセス（教師なし学習）に該当します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q71.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q71.html",
    "title": "応用情報技術者令和7年春期問71 エッジAI｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "スマートファクトリーで使用されるAIを用いたマシンビジョンの目的として，適切なものはどれか。\n\n---\n【選択肢】\nア: クラウドに蓄積した入出荷データを用いてAIが需要予測し，生産数を最適化する。\nイ: 作業者が装着したVRゴーグルにAIが作業状況に応じたガイドを表示することによって，作業効率を向上させる。\nウ: 設計変更内容をAIによって整理し，製造現場に正確に伝達する。\nエ: 人間の目視検査をAIが代替し，検査効率を向上させる。",
    "back": "【正解】 エ\n\n【解説】\nマシンビジョン\nは、産業用機械に搭載されたカメラによって対象物を認識し、あらかじめ決められた処理を行うシステムです。工場で製造中のモノを画像として捉えて全自動で目視検査する、駐車場で車のナンバーをみて入出庫を管理するといった使われ方をしています。\nマシンビジョンは、機械の目にあたるカメラ、カメラ信号をソフトウェアが処理できるようデジタル変換するフレームグラバー、光源、合否判定を行うAIなどのソフトウェアで構成されています。人間の目視検査では細かい部分までわからずダメな部分を見逃す可能性があるのに対し、マシンビジョンなら高精度でミスのない判別が可能となります。良品・不良品判定をはじめ、番号などの読み取りや傷や色の調査、大きさの測定、ゴミの分別などさまざまな目的で使用されています。\nしたがって「エ」が正解です。\nマシンビジョンは画像処理・物体認識など視覚的な情報を扱うものであり、データ分析による予測処理はその範疇に含まれません。\nXR(Extended Reality)に関する記述です。\nマシンビジョンは機械が人に代わって視覚的な情報を扱う技術であり、設計情報の整理や伝達は担当しません。\n正しい。マシンビジョンの目的です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q72.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q72.html",
    "title": "応用情報技術者令和7年春期問72 マシンビジョン｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "コンピテンシーモデルの説明はどれか。\n\n---\n【選択肢】\nア: 権限行使と命令統制による労務管理を批判し，目標管理制度や経営参加制度などによる動機付けが有効であるとしたもの\nイ: 最適なリーダーシップの唯一のスタイルは存在せず，望ましいリーダーシップのスタイルは，状況に応じて異なるとしたもの\nウ: 人材の評価や育成の基準とするために，恒常的に成果に結び付けることができる個人の行動や思考特性を定義したもの\nエ: 人間の基本的欲求を低次から，生理的欲求，安全の欲求，所属と愛の欲求，承認の欲求，自己実現の欲求としたもの",
    "back": "【正解】 ウ\n\n【解説】\nコンピテンシーモデル\nは、業務で高い成果を上げる人に共通する行動特性や思考傾向を「コンピテンシー」として抽出・体系化した人材評価モデルです。アメリカの心理学者デイヴィッド・C・マクレランドによって提唱されました。\n本モデルは、組織における人材採用、評価、配置、育成といった人事領域で広く導入されており、現代の人材マネジメントにおける中核的な手法の一つとされています。従来の学業成績や知能検査などの指標では職務遂行能力を的確に予測できないという課題に対し、実際の職務成果と強く結び付く特性を重視することで生まれた考え方です。\nしたがって「ウ」が適切な記述です。\nピーター・ドラッカーの目標管理制度（MBO）の説明です。\nハーシィ＆ブランチャードの状況対応リーダーシップ理論等の説明です。\n正しい。コンピテンシーモデルの説明です。\nマズローの自己実現理論（欲求の5段階説）の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q73.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q73.html",
    "title": "応用情報技術者令和7年春期問73 コンピテンシーモデルの説明はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "様々な需要予測モデルのもととなっている時系列モデルに関する記述として，適切なものはどれか。\n\n---\n【選択肢】\nア: 移動平均法では，平均する期間を長くするほど，短期的な需要の変化の影響が大きくなる。\nイ: 移動平均法は，長期的な需要のトレンドを把握するのには向かないが，直近の需要の変化を把握するのには向いている。\nウ: 指数平滑法では，平滑化定数の値が0%に近いほど直前の実績値を重視し，100%に近いほど過去の実績値を重視する。\nエ: 指数平滑法は，過去の実績値よりも直近の実績値を用いるほど予測の精度が向上すると考えられる場合に有効な手法である。",
    "back": "【正解】 エ\n\n【解説】\n時系列モデル\nは、時間の経過に伴って変化するデータを分析・予測するための統計的手法です。時間順に記録されたデータの動きを分析し、将来の値を推定する際に用いられます。売上や気温、株価、アクセス数など様々な予測に使用されています。\n代表的な時系列モデルには、移動平均法、指数平滑法、自己回帰モデル（ARモデル）、移動平均モデル（MAモデル）、それらを組み合わせたARIMAモデルがあります。移動平均法と指数平滑法は最も基本的なモデルです。\n移動平均法\n直前の一定期間のデータの単純平均を求め、短期的な変動を抑えながら傾向を把握する\n例）過去3日間の売上が 100、120、130 の場合、3日間の単純移動平均は、\n予測値＝(100＋120＋130)÷3＝116.67\n指数平滑法\n移動平均法の一種であり、直近の一定期間のデータについて、直前のデータほど指数関数的に高い重みを置いて平均を算出する\n例）平滑化定数α＝0.4、前回の予測値＝110、今回の実績値＝130 の場合、\n予測値＝130×0.4＋110×(1－0.4)＝118\n移動平均法では、集計対象とする期間が長くなるほど短期的の変化の影響は小さくなります。対象データ数が多ければ、一つひとつのデータが全体に与える影響は相対的に小さくなるためです。\n移動平均法では、短期的な変動の影響が平滑化されるため、長期的なトレンドの把握に適しています。一方で、直近の実績値に対する反応が鈍くなるため、短期的な需要の変化を捉えるには不向きです。\n指数平滑法で設定される平滑化定数（α）は、直前の実績値を取り込む割合を示します。このため記述とは逆に、平滑化定数が1に近いほど直前の実績値を重視し、0に近いほど過去の予測値を重視することになります。\n正しい。指数平滑法は、直近のデータに重みを置いて予測を行うため、需要が急変しやすい環境や、過去の傾向が陳腐化しやすい場合に効果を発揮します。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q74.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q74.html",
    "title": "応用情報技術者令和7年春期問74 時系列モデルに関する記述はどれか｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "引き出された多くの事実やアイディアを，類似するものでグルーピングしていく収束技法はどれか。\n\n---\n【選択肢】\nア: NM法\nイ: ゴードン法\nウ: 親和図法\nエ: ブレーンストーミング",
    "back": "【正解】 ウ\n\n【解説】\nNM法は、類比思考法によるアイディア発想法で、①課題を決める、②キーワードを決める、③類比を発想する、④アナロジーの背景を探る、⑤テーマと背景を結び付けてアイデアを出す、⑥解決案にまとめる、という手順で行うものです。名称の由来は、この技法を考案した中山正和氏のイニシャルです。\nゴードン法は、ブレーンストーミングと同じく多様なアイディアを発想するためのグループ討議法です。異なるのは議論の本来のテーマを知っているのが司会者だけという点です。参加者にはテーマよりも抽象的な課題について自由に討論してもらうことで視野を広げ、固定観念にとらわれない柔軟な発想を生まれやすくしています。\n正しい。親和図法(KJ法)は、あるテーマに基づいて集めたデータを相互の関連によってグループ化することで、項目を整理する手法です。複雑に絡み合った問題やまとまっていない意見、出されたアイディアなどを整理したりまとめたりするために用いられます。\nブレーンストーミングは、多様なアイディアを幅広く集めるために、批判禁止・自由奔放・質より量・便乗歓迎というルールで行うグループ討議の手法です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q75.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q75.html",
    "title": "応用情報技術者令和7年春期問75 アイディアをグルーピングする技法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "表から，卸売業A社と小売業B社の財務指標を比較したとき，卸売業A社について適切な記述はどれか。\n\n---\n【選択肢】\nア: 売上高，総資産の額がともに低く，総資産回転率も低い。\nイ: 売上高営業利益率が高く，総資産営業利益率も高い。\nウ: 営業利益，総資産の額がともに低く，総資産営業利益率も低い。\nエ: 総資産回転率が高く，総資産営業利益率も高い。",
    "back": "【正解】 エ\n\n【解説】\n総資産回転率、総資産営業利益率、売上高営業利益率については以下のとおりです。\n総資産回転率\n総資産に対する売上高の割合であり、「売上高÷総資産」の算式で求める（単位は\"回\"）。\n総資産営業利益率\n総資産に対する営業利益の割合であり、「営業利益÷総資産」の算式で求める\n売上高営業利益率\n売上高に対する営業利益の割合であり、「営業利益÷売上高」の算式で求める\nA社、B社それぞれの財務指標は以下のように計算できます。\n【A社】\n総資産回転率　800÷100＝8回\n総資産営業利益率　20÷100＝20%\n売上高営業利益率　20÷800＝2.5%\n【B社】\n総資産回転率　1,000÷900≒1.11回\n総資産営業利益率　90÷900＝10%\n売上高営業利益率　90÷1,000＝9%\n総資産回転率は「A社:8回、B社:1.11回」でA社のほうが高いです。よって、記述は誤りです。\n売上高営業利益率は「A社:2.5%、B社:9%」でB社のほうが高いです。よって、記述は誤りです。\n総資産営業利益率は「A社:20%、B社:10%」でA社のほうが高いです。よって、記述は誤りです。\n正しい。総資産回転率は「A社:8回、B社:1.11回」、総資産営業利益率は「A社:20%、B社:10%」で、いずれもA社のほうが高くなっています。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q76.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q76.html",
    "title": "応用情報技術者令和7年春期問76 財務指標の比較｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "売上高が7,000万円のとき，200万円の損失，売上高が9,000万円のとき，600万円の利益と予想された。売上高が8,000万円のときの変動費は何万円か。ここで，売上高が変わっても変動費率は変わらないものとする。\n\n---\n【選択肢】\nア: 3,200\nイ: 4,000\nウ: 4,800\nエ: 5,600",
    "back": "【正解】 ウ\n\n【解説】\n固定費と変動費率は一定ですから、売上高が7,000万円から9,000万円になったときの利益の増加分は、すべてが限界利益に相当します。\n売上高の2,000万円の増加により、増えた限界利益は「600－(▲200)＝800万円」です。一方、変動費の増加分は「2,000－800＝1,200万円」と計算できます。\n変動費率は「1,200÷2,000＝0.6」なので、売上高が8,000万円のときの変動費は、\n8,000×0.6＝4,800（万円）\nしたがって「ウ」が正解です。\n【別解】\n売上、費用および損益には次の関係があります。\n損益＝売上高－固定費－変動費\n上記の式中の変動費は「売上高×変動費率」で算出しますから、以下の式で表すことができます。\n損益＝売上高－固定費－(売上高×変動費率)\nこの式に売上高が7,000万のケースと9,000万円のケースの値を代入して式を立てます。\n－200＝7,000－固定費－7,000×変動費率\n600＝9,000－固定費－9,000×変動費率\nこの連立一次方程式の下の式から上の式を引くと、固定費が消えて変動費率がわかります。\n800＝2,000－2,000×変動費率\n2,000×変動費率＝1,200\n変動費率＝0.6\n変動費率は売上高に占める変動費の割合ですから、売上高8,000万円のときの変動費は、\n8,000×0.6＝4,800（万円）\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q77.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q77.html",
    "title": "応用情報技術者令和7年春期問77 変動費は何万円か｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "著作権法及び関連法令によれば，生成AIを利用して画像を生成する行為又はその生成物の利用が著作権侵害にあたるか否かに関して，適切な記述はどれか。\n\n---\n【選択肢】\nア: AIが既存の著作権で保護されている画像をデータセットとして学習している場合は，そのAIを利用して画像を生成すると，いかなる場合も著作権侵害になる。\nイ: AIを利用して生成した画像が著作権で保護された既存の画像と類似しており，それを公開した場合，著作権侵害となる可能性がある。\nウ: AIを利用して生成した画像は，AIが自動的に創作したものであるため，いかなる状況でも著作権の対象外となり，著作権侵害の懸念は生じない。\nエ: AIを利用して生成した画像は，生成した本人の私的使用に限って，利用が認められており，商業利用を行った場合は，いかなる場合も著作権侵害となる。",
    "back": "【正解】 イ\n\n【解説】\n機械学習の学習データとして他人の著作物を使うことは、原則としては著作物の利用に該当します。しかし、AI／IoT／ビッグデータ等による技術革新や経済発展を妨げることのないように、著作権法では著作権者の権利を一部制限する規定を置いています（2018年改正法）。\n具体的には、著作物の利用が自らまたは他人の鑑賞等を目的としない場合には、必要と認められる限度において、原則として著作者の許諾なく著作物を利用することができます。明文で認められている行為は次の3つです。\n技術の開発や実用化のための試験に供する場合\nAI開発\n・学習、ビッグデータ分析、リバースエンジニアリングなど、情報解析の用に供する場合\nキャッシュやバックアップなど、人の視覚による認識を伴わないコンピュータ処理の用に供する場合\nまた、AIによって生成されたコンテンツについては、著作権法の原則どおり、既存の著作物との間に\n類似性\n・\n依拠性\nの両方が認められることが侵害の要件となります。\n既存の著作物を学習データとして利用する行為は、原則として著作権法で認められています。学習に利用したということだけをもって、著作権侵害とはなりません。\n正しい。AIで生成したコンテンツが、既存の著作物と同一または類似していて、かつ既存の著作物に依拠している場合、その利用が著作権の侵害行為となる可能性があります。\n既存の著作物と類似性・依拠性が認められる場合、または著作権者の利益を不当に害することとなる場合など、生成コンテンツの利用が著作権侵害となる可能性があります。\n適法なAI生成コンテンツを利用することについては制限されません。業務利用であっても著作権の侵害とはなりません。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q78.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q78.html",
    "title": "応用情報技術者令和7年春期問78 生成AIと著作権法｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "資金決済法における暗号資産に関する記述として，適切なものはどれか。\n\n---\n【選択肢】\nア: 暗号資産交換業者は，情報の安全管理や広告勧誘規制などの行為規制は受けるが，資本金額や純資産額などの財務的規制は受けない。\nイ: 暗号資産は，不特定の者に対して使用でき，電子的に記録され，移転できるものであり，法定通貨又は法定通貨建ての資産ではないが，法定通貨と相互に交換できる。\nウ: 暗号資産は，ブロックチェーン技術を用いて集中管理されており，法定通貨と同様，銀行などの金融機関で入手・交換できる。\nエ: 利用者の保有する暗号資産の残高や取引は，発行者によって利用者ごとに管理されているので，利用者は保有している暗号資産を発行者の指定する加盟店だけで使用できる。",
    "back": "【正解】 イ\n\n【解説】\n暗号資産交換業者として登録を受けるためには、資本金の額が1,000万円以上であること、債務超過の状態にないことが要件の一つとなっています。また、行為規制として情報の安全管理、広告、情報提供、資産の分別管理などが義務付けられています。\n正しい。資金決済法によれば、暗号資産は以下の要件全てを満たす財産的価値と定義されています。『不特定の者を相手方として購入・売却（法定通貨との交換）ができる』ことが暗号資産の要件の一つです。\n物品・サービスの代金として不特定の者に対して使用でき、\n法定通貨と相互に交換できる\n電子的方法で記録され、インターネットを通じて移転できる\n法定通貨や法定通貨建ての資産（プリペイドカード等）ではない\n暗号資産の基盤技術であるブロックチェーンは「分散型台帳」を実現するものです。暗号資産の台帳はP2Pネットワークを通じて分散管理されます。また、暗号資産は暗号資産交換業者を通じて売買します。銀行などの金融機関では直接入手・交換できません。\n暗号資産の残高や取引履歴はブロックチェーン上で記録され、ウォレットを通じて移転されます。不特定の者に移転することができるのが暗号資産の性質であり、取引の相手方は発行者の指定する加盟店に限られません。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q79.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q79.html",
    "title": "応用情報技術者令和7年春期問79 暗号資産に関する記述｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "同じ命令セットをもつコンピュータAとBがある。それぞれのCPUクロック周期，及びあるプログラムを実行したときのCPI(Cycles Per Instruction)は，表のとおりである。そのプログラムを実行したとき，コンピュータAの処理時間は，コンピュータBの処理時間の何倍になるか。\n\n---\n【選択肢】\nア: 132\nイ: 12\nウ: 2\nエ: 8",
    "back": "【正解】 ウ\n\n【解説】\nCPI\n(Cycles Per Instruction)は、CPUが1命令を実行するのに必要となる平均クロック数を表します。CPUクロック周期はクロックが発生する時間間隔なので、1命令を処理するのに要する時間は「CPUクロック周期×CPI」で求めることができます。\nコンピュータAとBの1命令の平均処理時間は、それぞれ以下のとおりです。\nA： 1ナノ秒×4.0CPI＝4ナノ秒\nB： 4ナノ秒×0.5CPI＝2ナノ秒\nコンピュータAが1命令の処理に要する時間はコンピュータBの2倍ですから、同じプログラムを実行すれば、Aの処理時間はBの2倍になります。\nしたがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q8.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q8.html",
    "title": "応用情報技術者令和7年春期問8 クロック周期とCPI｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "欧州へ電子部品を輸出するには，RoHS指令への対応が必要である。このRoHS指令の目的として，適切なものはどれか。\n\n---\n【選択肢】\nア: 家電製品から有用な部分や材料をリサイクルし，廃棄物を減量するとともに，資源の有効利用を推進する。\nイ: 機器が発生する電磁妨害が，無線通信機器及びその他の機器の正常な動作を妨げるレベルを超えないようにする。\nウ: 大量破壊兵器の開発及び拡散，通常兵器の過剰備蓄に関わるおそれがある場合など，国際社会の平和と安全を脅かす輸出行為を防止する。\nエ: 電気電子製品の生産から処分までの全ての段階で，有害物質が環境及び人の健康に及ぼす危険を最小化する。",
    "back": "【正解】 エ\n\n【解説】\nRoHS指令\n(ろーずしれい)は、EUが発効した電気電子機器の製造段階における特定有害物質の使用制限に関する規則です。特定有害物質とは、鉛、水銀、カドミウム、六価クロムなど合計10物質で、最終的に埋立てや焼却で処分されるときに人体への悪影響がないように、これらの含有率を最大許容濃度以下にすることを定めています。\nEU加盟国の製造業者は本指令に従った製品を市場に出さなければならず、EU加盟国の輸入業者には、本指令に準拠する電気電子機器であるかどうかを適切に評価するための適合性評価手順を製造業者が実行していることを確認する義務があります。そのため、EUに電子部品を輸出する国内製造業者はRoHS指令に対応する必要があります。\nしたがって「エ」の記述が適切です。\nWEEE指令の目的です。\nEMC指令の目的です。電気電子機器を欧州に輸出する際に適合させる必要があります。\n外国為替及び外国貿易法に基づく安全保障輸出管理（リスト規制やキャッチオール規制）の目的です。\n正しい。RoHS指令の目的です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q80.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q80.html",
    "title": "応用情報技術者令和7年春期問80 RoHS指令の目的｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "DMAコントローラーの説明として，適切なものはどれか。\n\n---\n【選択肢】\nア: MPUでは時間が掛かる積和演算を，高速に行う。\nイ: 仮想メモリ機能，メモリ保護機能などのメモリ管理機能を提供する。\nウ: 動作クロックに合わせてカウントするカウントレジスタをもち，それによって時間の経過を保持する。\nエ: メモリと入出力装置，又はメモリとメモリとの間でのデータ転送を，MPUを介さずに行う。",
    "back": "【正解】 エ\n\n【解説】\nDMA\nは「Direct Memory Access」の名称が表すとおり、入出力装置がCPUを介さずにメモリとの間で直接データを転送を行う方式です。\nDMAコントローラー\nは、CPUに代わって周辺機器とメモリとの間のデータ転送を制御する専用ハードウェアです。\n通常はデータのやり取りはCPUが関与して行われますが（チャネル制御方式）、DMA制御方式ではCPUが他の処理を行いながら、HDDその他の周辺機器とメモリの間のデータ転送が可能なので、CPUの負荷が軽減され、全体の処理効率が向上します。一般的なコンピュータでも広く利用されている基本的な技術です。\nしたがって「エ」が適切な記述です。\nDSP(Digital Signal Processor)やFPUの説明です。DMAはデータ転送を制御する装置で、一般的な演算処理は行いません。\n※積和演算(せきわえんざん)は、複数の数の乗算（積）を行い、それらを足し合わせる演算です。\nメモリ管理ユニット(MMU：Memory Management Unit)の説明です。DMAコントローラーは内蔵するメモリアドレスレジスタによりアドレス計算を行いますが、仮想アドレス変換やページングなどの高度なメモリ管理機能は備えていません。\nサイクルカウンターの説明です。DMAコントローラーは内蔵するバイトカウントレジスタにより転送データ量を管理しますが、時間の経過を記録・保持する機能はありません。\n正しい。DMAコントローラーの説明です。\n\n(出典: https://www.ap-siken.com/kakomon/07_haru/q9.html)",
    "source": "https://www.ap-siken.com/kakomon/07_haru/q9.html",
    "title": "応用情報技術者令和7年春期問9 DMAコントローラー｜応用情報技術者試験.com",
    "period": "令和7年春期"
  },
  {
    "front": "【問1　情報セキュリティ】\n\nWebサイトのセキュリティに関する次の記述を読んで，設問に答えよ。\nF社は，日用雑貨を製造・販売する中堅企業である。このたび，販路拡大を目的として自社製品を販売するWebサイト(以下，本システムという)を新規に開発した。本システムは，D社クラウドサービス上に構築しており，Webサーバとデータベース(以下，DBという)サーバから成り，D社クラウドサービスが提供するファイアウォール(以下，FWという)及びWebアプリケーションファイアウォール(以下，WAFという)を経由してインターネットからアクセスされる予定である。\n本システムの開発環境のネットワーク構成(抜粋)を図1に示す。なお，本システムはリリース前であり，F社開発環境の特定のIPアドレスからだけアクセスできるようにFWで制限している。\n本システムの主な仕様を次に示す。\n会員登録時に自動で発行される会員番号と会員が設定したパスワードをログインフォームに入力してログインする。商品の購入はログイン後に行う。\nパスワードとして使用できる文字は，英数字に一部の記号を加えた70種類である。\nパスワードは，6字以上16字以下で設定する。\n会員テーブルは，会員番号，メールアドレス，パスワードのハッシュ値，姓，名，住所，電話番号の7フィールドで構成されている。\n①パスワードのハッシュ値は，会員が設定したパスワードをハッシュ関数によってハッシュ化したものである\n。\nF社情報セキュリティ部のG部長は，本システムのリリース前にペネトレーションテストを実施することを決定し，H主任をリーダーに任命した。H主任は，セキュリティベンダーであるU社に本システムのペネトレーションテストの実施を依頼した。ペネトレーションテストは，U社内のPCからインターネット，FW及びWAFを経由して本システムにアクセスする経路で実施した。\nペネトレーションテスト期間中は，FW及びWAFに対して次の変更を行った。\nFWに対する変更\n通信を許可するアクセス元IPアドレスとして，ペネトレーションテストに用いるU社のIPアドレスを追加する。\nWAFに対する変更\n攻撃を検知した際には，通信の遮断は行わず，検知したことだけを記録する。\n〔ペネトレーションテストの結果〕\nペネトレーションテストの結果，次の手順(以下，本シナリオという)で会員のパスワードが推測されて，不正にアクセスされてしまうことが確認された。\n②SQLインジェクション攻撃によって会員テーブルのデータを取得する\n。このとき取得した会員テーブルのデータ(抜粋)を表1に示す。\nレインボーテーブル攻撃によって，手順1で取得した会員テーブル中のパスワードのハッシュ値から元のパスワードを推測する。\n推測したパスワードを利用して，会員になりすまして本システムにログインする。\n稼働中のシステムのログインフォームに対してパスワードを総当たりで試行する\na\n攻撃では，システム側で試行回数に制限を設けて対策することができるが，レインボーテーブル攻撃ではそれができない。\nH主任は，本システムの修正方針を整理するために，SQLインジェクション攻撃及びレインボーテーブル攻撃への対策を検討することにした。なお，ペネトレーションテスト期間中にWAFでSQLインジェクション攻撃が検知できていたが，\n③仮に対策の一つが破られても他の対策で攻撃を防ぐという考え方\nに基づき，攻撃への対策をWAFだけに頼らず本システム自体でも行うことにした。\n〔SQLインジェクション攻撃への対策の検討〕\n本システムのソースコードを調査したところ，一部の処理で外部からの入力値をそのままSQL文に埋め込んでいる箇所が存在していた。そこで，対策として，\nb\nを利用する方式を採用することにした。この方式では，外部からの入力値が埋め込まれる箇所を専用の記号に置き換えたSQL文の雛形をあらかじめ作成しておき，専用の記号で置き換えた箇所にDB管理システム側で外部からの入力値を割り当てる。\n〔レインボーテーブル攻撃への対策の検討〕\n本システムでは会員のパスワードをハッシュ化して保存しているが，パスワードそのものにハッシュ関数を1回適用しただけであったので，レインボーテーブル攻撃に対して脆弱であった。そこで，パスワードをハッシュ化する際に，次の三つの処理を組み合わせて実施することにした。\nソルトを用いた処理\nパスワードをハッシュ化する際に，ソルトを付加した上でハッシュ化する。\nソルトとして，会員ごとに異なるランダムな文字列を用意し，会員テーブルに格納する。\n④ペッパーを用いた処理\nパスワードをハッシュ化する際に，ペッパーを付加した上でハッシュ化する。\nペッパーとして，全ての会員に共通のランダムな文字列を用意し，Webサーバ内の外部からアクセスできない安全な領域に格納する。\nストレッチング\nハッシュ関数を複数回適用する。\nさらに，ハッシュ化処理の変更に加えて，会員が設定可能なパスワード長を10字以上64字以下に変更した。本システムにおいて，パスワード長が10字の場合，6字の場合と比べてパスワードとして使用可能な文字列のパターン数が\nc\n倍になるのでレインボーテーブル攻撃がより困難になる。\nH主任は，これらの対策を取りまとめてG部長に報告し，承認された。\n\n【設問1】\n\n本文中の\n下線①\nについて，会員のパスワードをハッシュ関数でハッシュ化して保存することは，情報漏えいの脅威に対してメリットがある。それは，ハッシュ値にどのような特性があるからか。25字以内で答えよ。\n\n【設問2】\n\n本文中の\n下線②\nについて，会員テーブルのデータが漏えいした場合，情報セキュリティの3要素のどれが直接的に侵害されたといえるか。漢字3字で答えよ。\n\n【設問3】\n\n本文中の\na\n，\nb\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n\n【設問4】\n\n本シナリオによって，表1に示す会員テーブルのデータが窃取され，会員番号\"21717202\"の会員のパスワードが推測され不正アクセスを受けたとすると，推測されたパスワードを利用して不正アクセスを受けるおそれが最も強い他の会員は誰か。該当する会員の会員番号を解答群の中から選び，記号で答えよ。\n\n【設問5】\n\n本文中の\n下線③\nの考え方を，漢字4字で答えよ。\n\n【設問6】\n\n〔レインボーテーブル攻撃への対策の検討〕について答えよ。\n本文中の\n下線④\nについて，ペッパーを付加してハッシュ化することで本シナリオにおいてレインボーテーブル攻撃が困難になる理由を，ソルトを用いた処理との違いに着目して35字以内で答えよ。\n本文中の\nc\nに入れる適切な数を，x\ny\nのような指数を用いた表記で答えよ。\n\n---\n【選択肢】\n: エスケープ\n: 許可リスト\n: サニタイズ\n: 中間者\n: ブルートフォース\n: プレースホルダ\n: リプレイ",
    "back": "【正解】 ハッシュ値からパスワードの割出しは難しい, 機密性, オ, カ, イ, 多層防御, 会員テーブルの窃取だけではペッパーを得ることができないから, 704\n\n【解説】\n解説\nハッシュ関数で生成されたハッシュ値は、不可逆性、衝突耐性、決定性という3つの重要な特性があります。\n不可逆性\nハッシュ値から元のパスワードを復元することが非常に困難である\n衝突耐性\n入力が異なれば高確率で異なるハッシュ値が生成される\n決定性\n入力が同じであれば常に同じハッシュ値が生成される\nこのうち、特に「不可逆性」が、情報漏えい対策として重要な役割を果たします。\nパスワードをハッシュ化せずに平文のまま保存していると、システムが攻撃を受けた際、パスワードが直接漏えいし、不正アクセスのリスクが高まります。しかし、ハッシュ化して保存していれば、万が一データが漏えいした場合でも、攻撃者はハッシュ値しか取得できず、そこから元のパスワードを直接導き出すことは困難です。情報漏えいの防御策となるのは、ハッシュ値の「不可逆性」によるものなので、解答としては「ハッシュ値からパスワードの割出しは難しい」などが適切となります。\nパスワードをハッシュ化して保存する方法は、万が一の情報漏えいに備える対策として非常に重要です。実際の現場でもパスワードはハッシュ化して保存することは常識です。\n∴ハッシュ値からパスワードの割出しは難しい\n\n---\n\n解説\n情報セキュリティマネジメントでは、維持管理すべき3つ要素として、機密性、完全性、可用性があります。\n機密性（Confidentiality）\n許可されたユーザーのみが情報にアクセスできる特性であり、アクセス制御やデータの暗号化によって保護される\n完全性（Integrity）\n情報が正しく維持され、改ざんや破壊がされていない特性であり、デジタル署名やチェックサムなどで確保される\n可用性（Availability）\n必要な時にシステムやデータが利用可能である特性であり、冗長化やバックアップによって確保される\n会員テーブルのデータが漏えいした場合、本来アクセスが許可されない者に情報が渡ってしまったことになります。これは、情報セキュリティの3要素のうち「機密性」の侵害に該当します。\n∴機密性\n\n---\n\n解説\n〔\na\nについて〕\n「パスワードを総当たりで試行する」という説明から、ブルートフォース攻撃と判断できます。ブルートフォース攻撃は、システムやアカウントのパスワードを解読するために、考えられるすべての文字列の組合せを試行する攻撃手法です。総当たり攻撃とも呼ばれます。\nこの攻撃に対しては、短いパスワードや単純なパスワードは容易に解読されるリスクが高いため、まずは長く複雑なパスワードを設定することが重要です。またWebシステムを攻撃する場合、ログインフォームを直接狙うため、試行回数を制限して一定回数以上のログイン失敗が発生した場合にアカウントを一時的にロックすることや、CAPTCHAや多要素認証など追加の認証を導入することが対策となります。\n∴\na\n＝オ：ブルートフォース\n〔\nb\nについて〕\n空欄bの後に続く「この方式は…」の説明より、プレースホルダであると判断できます。プレースホルダは、SQL文中のユーザー入力を割り当てる部分に特殊文字（例えば ? や $1）を使用した雛形を用意し、後から実際の値を割り当てる仕組みです。\nSQLインジェクションは、Webアプリケーションの脆弱性を悪用し、不正なSQLクエリをデータベースに対して実行させる攻撃です。特に、外部からの入力値をそのままSQL文に埋め込む実装は、この脆弱性を引き起こす原因となります。\n例えば、次のようなSQL文があるとします。\nSELECT * FROM users WHERE user_id =【入力値】\nこの【入力値】に、攻撃者が入力した\n21717202 OR 1 = 1\nという文字列が埋め込まれた場合、以下のようなSQLが実行されてしまいます。\nSELECT * FROM users WHERE user_id = 21717202 OR 1 = 1\n上記の場合、1 = 1 は常に true となり、2つの条件式は OR で連結していることから、会員テーブル内の全てのレコードが取得されます。SQLインジェクションはこのような形で成立します。\nこのようなSQLインジェクションを防ぐために有効なのが「プレースホルダ」を利用する方法です。プレースホルダは、ユーザー入力部分を専用の記号に置き換えたSQL文の雛形（プリペアドステートメント）をあらかじめ作成し、実行時にDB管理システム側でプレースホルダに実際の値を割り当てます。DB管理システムが割り当てる際、入力値は値として扱われるため、安全なSQL実行が可能となります。\n// $ がプレースホルダ\n$user_id =【入力値】\n$stmt = 'SELECT * FROM users_TABLE WHERE user_id = $'\n$stmt->execute($user_id)\n∴\nb\n＝カ：プレースホルダ\n\n---\n\n解説\n表1の会員テーブルのデータを見ると、会員番号\"21717202\"と\"30781985\"のパスワードのハッシュ値が同じです。ハッシュ値が同一であるということは、両会員が同じパスワードを利用している可能性が非常に高いことを意味します。\n会員テーブルのデータが攻撃者に窃取されているということは、会員番号が攻撃者に知られていることになります。本システムは、会員番号とパスワードでログインしますから、会員番号\"21717202\"と同じパスワードを使用している会員番号\"30781985\"も、攻撃者によって同様に不正アクセスを受けるリスクは高いと判断されます。\n∴イ：30781985\n\n---\n\n解説\n単一のセキュリティ対策に頼るのではなく、複数の異なる防御手段を組み合わせて総合的にセキュリティを強化する考え方を多層防御」といいます。この手法により、一つの防御手段が破られたとしても、他の対策が機能することでシステムの安全性を維持できる可能性が高まります。\n本設問では、レインボーテーブル攻撃への防御策として、まずその前提となるSQLインジェクションのリクエストを拒否するWAF、危険なSQL文を防ぐプレースホルダが導入されています。さらに万が一ハッシュ値が漏えいしても問題ないように、ストレッチング、ソルト、ペッパーを導入しています。これが多層防御の具体例となります。これ以外にも、ユーザーからの入力値の検証を行ったり、データ暗号化や機械学習により通常とは異なるSQLクエリのパターンをリアルタイムで検出するなどの方法も考えらえます。近年、攻撃手法が高度化しているため、一つの対策に頼るのではなく、複数の防御手段を組み合わせて多層的に保護することが重要になっています。\n∴多層防御\n\n---\n\n解説\nレインボーテーブル攻撃は、攻撃者があらかじめ多数のパスワードとそれに対応するハッシュ値のリスト（レインボーテーブル）を用意し、取得したハッシュ値を照合し、元のパスワードを特定する攻撃手法です。通常のハッシュ処理のみではこの攻撃に対して脆弱ですが、ソルトやペッパーを追加することで、攻撃の難易度を大幅に高めることができます。\nペッパー、ソルトの性質と使用方法は以下のとおりです。\nペッパー\n全ての利用者で共通の固定値（ペッパー）をパスワードに追加し、それをハッシュ化する。ペッパーはデータベースには保存されず、Webサーバの外部からアクセスできない安全な領域に保管される\nソルト\n利用者ごとに異なるランダムな値（ソルト）をパスワードに追加し、それをハッシュ化する。ソルトはハッシュ値とともにデータベースに保存される\nソルトは、ハッシュ化したパスワードとともに会員テーブルに保存されているため、攻撃者が会員テーブルを窃取した場合、ソルトも同時に取得されるおそれが高いです。その場合、攻撃者は「パスワード + ソルト」を対象に、新たにレインボーテーブルを作成し、パスワードを解析できる可能性があります。一方、ペッパーは会員テーブルではなく別の安全な領域に保存されているため、会員テーブルが攻撃者に窃取されたとしても、ペッパーが漏えいすることはありません。攻撃者は「パスワード + ペッパー」に対するレインボーテーブルを作成することができません。\n本シナリオでは、会員テーブルが窃取されたことを想定していますが、会員テーブルの情報を入手したとしても、パスワード解析に必要なペッパーを取得できません。これが、レインボーテーブル攻撃が困難になる理由です。\n∴会員テーブルの窃取だけではペッパーを得ることができないから\n本システムの主な仕様に「パスワードとして使用できる文字は，英数字に一部の記号を加えた70種類である」の記載があります。そのため、パスワード長が6字の場合のパターン数は70\n6\n通り、パスワード長が10字の場合は70\n10\n通りのパターンが存在します。このとき、パターン数が何倍になるかを求めるには以下の計算を行います。\n70\n10\n70\n6\n＝70\n10-6\n＝70\n4\nしたがって、パスワードの最大文字数を6文字から10文字に変更したことで、使用可能なパターン数は「70\n4\n」倍に増加します。\n∴\nc\n＝70\n4\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm01.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm01.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問1(情報セキュリティ)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問2　経営戦略】\n\nコーヒーチェーン店の成長戦略に関する次の記述を読んで，設問に答えよ。\nQ社は，コーヒーチェーン店を運営している。喫茶店業態に進出して以来，落ち着いた空間を提供することで急速に店舗を増やし，現在は全国に店舗を展開している。しかし，ここ3年は，経営環境の変化によって成長が鈍化しており，不採算店も増えている。Q社の経営企画，マーケティング及び人事を統括するR常務は，この状況に危機感を抱き，利益を伴う成長戦略を策定するために，経営企画部のS課長をリーダーとする戦略策定チームを編成した。なお，S課長は，店舗業務の標準化を推進する店舗統括本部の課長も兼務している。\nQ社は，\"おいしいコーヒーでゆっくりくつろげる喫茶店\"というブランドを掲げ，交通至便な立地に店舗を構え，店内には仕切りがついたテーブル席を設けるなど，設備投資に注力してきた。Q社の利益は2回以上来店したことのあるリピート客を含む延べ来店客数に比例しており，成長率は新規来店客数に比例している。しかし，ここ3年は，延べ来店客数に占めるリピート客数の割合であるリピート率も新規来店客数も低下していた。\n〔Q社を取り巻く環境〕\nQ社では，従前から，顧客満足度調査と従業員満足度調査を行っている。そこで，S課長は，戦略の立案に当たり，顧客の視点及び従業員の視点で分析を行った。\nまず顧客の視点で経営環境を分析した。\n近年，持続可能な開発目標(SDGs)で定められた目標の一つである\"持続可能な消費と生産のパターンを確保する\"への理解が進むに従い，環境や倫理を重視する製品やサービスを購入するという意識がZ世代の消費者の間で高まっている。Q社はこのような高い社会意識をもった消費者を取り込めていない。\n競合コーヒーチェーン店(以下，競合店という)が新規出店した近隣のQ社の店舗では，来店者が急激に減少している。競合店は，商品知識が豊富で親しみやすい接客に定評があり，顧客満足度が高い。競合店は，コーヒーの淹れ方をマニュアル化して全従業員を定期的に教育したり，社外の講師を呼んで接客スキルやセルフリーダーシップのスキルを高める研修を実施したりするなど，従業員育成への投資を重視している。\nQ社は，有機農法で栽培するなど，環境に配慮した生産者から直接調達した高品質なコーヒー豆を使っていて，味や香りが良いコーヒーに定評があった。ただし，最近の顧客満足度調査では，\"店によってコーヒーの味にばらつきがある\"，\"味や香りが以前よりも落ちている\"，といった顧客からの声が寄せられている。\nS課長は，定評があるコーヒーの安定した提供や，ゆっくりくつろげる喫茶店としての接客といった，顧客へのサービス品質を向上させる必要があると分析した。\n次に，S課長は，従業員の視点で経営環境を分析した。\n各店舗は店長をリーダーとする一つのチームとして運営されている。店長が部下にコーヒーの淹れ方や接客スキルなどを指導している。しかし，顧客が満足する品質のサービスを提供できるように部下を育成することまではできていない。全て店長の責任で部下の育成を行った上で，顧客が満足する品質のサービスを提供することには限界がある。\n従業員は，コーヒーを淹れるスキルを高めたいと思ったり，接客の仕方を改善しようとしたりしているが，店長に相談したくても，なかなか対応してもらえていない。その結果，不満をもって辞めてしまう従業員が増え，従業員の定着率が低下してきている。\n店舗統括本部の管理者，同僚の店長，店舗内の部下によって店長の360度評価を実施した結果，全般的に，店長の自己評価は高いが，部下からの評価はそれほど高くなく，両者の評価には大きなギャップがあった。\nS課長は，これらの経営環境分析の結果，顧客へのサービス品質の低下には，従業員のスキルの不足と従業員の定着率の低下とが関連するのではないかと考えた。さらに，S課長は，従業員のスキル及び定着率について分析し，次のことが分かった。\n顧客へのサービス品質が高いチームは，従業員満足度が高く，それによってチームメンバーがやる気をもって自律的にスキルの向上を図っており，また，チームメンバーの定着率が高いという共通の特性がある。\nこの特性を満たすためには，店長が，部下に対して共感することで，質問・相談しやすい環境を作ることが必要である。\n〔成長戦略の策定〕\nS課長は，これまでの分析の結果を基に，成長戦略の基本方針を次のとおり定めた。\n成長戦略を実現するために重点的に取り組むべきCSF(Critical Success Factors：重要成功要因)とその因果関係を明確にする。これまでの分析の結果から，Q社の成長につながるCSF間の因果関係を，図1のQ社のサービスプロフィットチェーンにまとめた。その上で，働きやすい環境や人材育成制度の充実など，従業員が会社から受けるサービスの良さを表す\"自社内のサービス品質\"の向上を図る。\n持続可能な成長を目指し，また，顧客のロイヤルティをより高めるために，ブランドを再構築する。新たに，\"\n①私たちは，高い社会意識をもって，厳選された生豆と熟練の技術で淹れる香り深いコーヒーを提供します\n。\"とブランドを定める。\n\"ブランドの再構築\"によって，自社の強みを生かし，弱みを補完して，競合店との差別化を図る。また，\"初めて来店してから，店に来店しなくなるまでの\nc\n\"を表すLTVを向上させることで，採算性を改善する。\nS課長は，このサービスプロフィットチェーンに基づいて，従業員の定着率の改善とスキルの向上のためには，\na\nを高める必要があり，さらにそのためには自社内のサービス品質の改善が必要であることをR常務に報告した。また，S課長は，ゴールである\"利益を伴う成長\"の実現を目指す成長戦略の進捗を測るKPIとして，Z世代の来店客数と，\nd\nを設定することにした。\n〔Q社内のサービス品質の改善〕\nS課長は，自社内のサービス品質を改善するため，店長への研修を実施することにした。研修の内容は，店長の360度評価の結果を基に，店長に対して\ne\nに気付かせ，行動改善につなげるものとし，部下との対話の場面を想定した次の具体的な演習を行う。\n店長は部下に対して\"教える\"，\"アドバイスする\"ことはせず，\"問いかけて聴く\"という対話を重視する。\n店長は部下に対する\nf\nを示すことで，部下から様々な考え方や行動の選択肢を引き出し，自律的な行動を促す。\nS課長は，ブランドの再構築の活動として，再教育を全従業員に対して行うことにした。この再教育に当たって，S課長は，\n②店舗統括本部として重点的に取り組むべき施策\nがあると考えた。また，ブランドの再構築への投資に加えて，人的資本を強化する新たな投資計画を策定した。\nR常務は，この報告を受け，\"君の策定した戦略は，よく考えられていて，納得できた。そのアプローチは本当に良いと思う。\"とS課長に\nf\nを示した上で，すぐに経営会議に付議し，成長戦略を推進することを約束した。\n\n【設問1】\n\n〔成長戦略の策定〕について答えよ。\n図1及び本文中の\na\n，図1中の\nb\nに入れる適切な字句を，本文中の字句を用いて，それぞれ8字以内で答えよ。\n本文中の\n下線①\nについて，S課長が新たにブランドを定めた背景となる要因は何か。機会と強みの観点からそれぞれ20字以内で答えよ。\n本文中の\nc\nに入れる適切な字句を15字以内で答えよ。\n本文中の\nd\nに入れる適切な字句を8字以内で答えよ。\n\n【設問2】\n\n〔Q社内のサービス品質の改善〕について答えよ。\n本文中の\ne\nに入れる適切な字句を20字以内で答えよ。\n本文中の\nf\nに入れる適切な字句を3字以内で答えよ。\n本文中の\n下線②\nについて，店舗統括本部が，再構築したブランドを考慮して重点的に取り組むべき施策を，本文中の字句を用いて25字以内で答えよ。",
    "back": "【正解】 従業員満足度, 顧客満足度, 環境や倫理に対する社会意識の高まり, 環境に配慮した高品質なコーヒー豆の使用, ・顧客がQ社にもたらす利益 (12文字)・顧客生涯価値 (7文字), リピート率, 自己評価と部下からの評価とのギャップ, 共感, 香り深いコーヒーの淹れ方のマニュアル化\n\n【解説】\n解説\n今回の経営戦略問題はシステムに絡んだ考察から離れ、企業内の人的問題に着目しどう戦略を確立するかを考慮する問題となっています。財務計算等もなくサービスプロフィットチェーンの知識がなくても本文中に存在する文言によって解答可能です。その他SWOT分析、LTV、KPIなどの知識は令和4年秋午後問2でも出題されており、よく理解しておく必要があります。\n最初にサービスプロフィットチェーン（SPC）について概略を説明します。サービスプロフィットチェーンはハーバード大学のヘスケット教授らが提唱した、従業員満足度と顧客満足度を含む7つの要因が連鎖し企業の収益性を向上させ成長を促すという経営モデルです。図1は、ヘスケット氏が著述の中で示したサービスプロフィットチェーンと同様のものとなっています。\n①から⑦で示される各要因の関連は以下のとおりです。\n社内教育の充実、正当な評価制度と十分な報酬、福利厚生の充実等、自社の従業員に対するサービス品質（❶）が高ければ、従業員満足度（❷）が向上する。\n従業員満足度（❷）が向上すれば、自身のスキルを高め自社に貢献したいという従業員の意識が生まれ、自社に対する帰属意識が強まり生産性向上や離職率の減少につながる（❸）。\n自社に対する強い帰属意識を持つ、勤続年数が長くスキルの高い従業員（❸）が生み出す製品やサービスは、顧客にとって高品質（❹）なものとなる。\n高品質な商品やサービス（❹）を受け取った顧客の満足度が向上する（❺）。\n顧客満足度（❺）が上がると、その商品や企業に対する顧客ロイヤルティ（❻）が生まれる（Loyaltyは忠誠心・忠義を表し、商品やサービスに対する愛着・忠誠を表す。ライセンス料や著作権料などを表すロイヤルティ:Royaltyとは異なることに注意）。\n商品や企業に対する顧客ロイヤルティ（❻）が生まれれば、長期にわたる商品やサービス購入につながり、結果として収益が向上し企業も成長する（❼）。\n〔\na\nについて〕\n図1のサービスプロフィットチェーンでは、企業の成功要因（CSF）間の因果関係が示されており、空欄aの後ろには\"従業員の定着率\"と\"従業員のスキル\"があります。この部分は図1で従業員に関する因果関係と記載されているので、従業員に関連することだと予想できます。従業員のスキル及び定着率についての分析には、以下の記述があります。\n顧客へのサービス品質が高いチームは，従業員満足度が高く，それによってチームメンバーがやる気をもって自律的にスキルの向上を図っており，また，チームメンバーの定着率が高いという共通の特性がある。\nこの分析結果では、チームメンバーのスキル向上や定着率の高さの要因として、従業員満足度の高さが指摘されています。つまり、従業員が満足しているとスキルが向上し、定着率が上がり、その結果、顧客へのサービス品質が向上するという因果関係が成り立ちます。この関係をサービスプロフィットチェーンに当てはめると、空欄aには「従業員満足度」が入ります。\n∴\na\n＝従業員満足度\n〔\nb\nについて〕\n同じようにサービスプロフィットチェーン内での位置付けを確認すると、空欄aの前には\"顧客へのサービス品質\"、後ろには\"顧客ロイヤルティ\"があります。この部分は図1で顧客に関する因果関係とあるので、顧客に関連することだと予想できます。顧客の状況については〔Q社を取り巻く状況〕の以下の記述に着目します。\n来店数が急激に減少している店舗の競合店では，商品知識が豊富で親しみやすい接客で顧客満足度が高い\n最近の顧客満足度調査でコーヒーの味や香りについての不満が寄せられている\nこれらの記述より、Q社は競合他社と比較して顧客満足度が低下しており、その影響で来店数が伸び悩んでいるという様子が読み取れます。そして、この状況に対して、S課長は「顧客へのサービス品質を向上させる必要がある」と結論づけています。この判断は、優れた顧客サービスが\"顧客満足度\"を高め、結果として\"顧客ロイヤルティ\"を強化するという因果関係に基づたものと言えます。この関係をサービスプロフィットチェーンに当てはめると、空欄bには「顧客満足度」が入ります。\n∴\nb\n＝顧客満足度\n機会と強みはSWOT分析で用いられる視点で、機会（Opportunity）は企業にとって有利になる外部環境要因、強み（Strength）は自社が持つ競争優位性につながる内部環境要因です。新しいブランドは大きく「高い社会意識をもって厳選された生豆」と「熟練の技術で入れるコーヒー」という2つの要素で構成されています。これを背景に、機会と強みの観点から分析します。\n〔機会について〕\n外部環境の変化によって企業にとって有利になる要素を探すと、ブランドに関連する社会背景として次の記述があります。\n環境や倫理を重視する製品やサービスを購入するという意識がZ世代の消費者の間で高まっている\nQ社はこのような高い社会意識をもった消費者を取り込めていない\n社会全体のトレンドとして、サステナビリティやエシカル消費などの機運が高まっているものの、Q社ではこの消費者層を取り込めていない現状が読み取れます。Q社では「環境に配慮した生産者から直接調達した高品質のコーヒー豆を使ってい」るため、この外部環境はQ社にとってプラスになる要素です。\nしたがって、機会としては「環境や倫理を重視する社会意識の高まり」「エシカル消費への意識の高まり」などの解答が適切となります。\n〔強みについて〕\n競争優位性につながるQ社の内部要因を探すと、「有機農法で栽培するなど，環境に配慮した生産者から直接調達した高品質なコーヒー豆を使って（いる）」とあります。Q社ではすでに環境配慮型の高品質なコーヒー豆を安定的に調達・使用する仕組みを確立していることがわかります。これは、環境意識の高い消費者層にアピールできるQ社の強みと言えます。この強みを活かして、新ブランドは「社会的責任を意識し、厳選された生豆を使用している」ことを消費者に訴求しているわけです。\n20文字以内でまとめることがやや難しいところですが、強みとしては「環境に配慮した高品質なコーヒー豆の使用」という解答が適切となります。なお、本文には\"有機農法で栽培するなど\"と表記されており、有機農法以外の手法で栽培されたコーヒー豆も使用していること示唆されています。このため、「有機農法で栽培されたコーヒー豆」という限定した表現は避けるべきでしょう。\n∴機会＝環境や倫理に対する社会意識の高まり\n強み＝環境に配慮した高品質なコーヒー豆の使用\n〔\nc\nについて〕\n空欄cを表す字句としてLTVが示されています。LTVとは Life Time Value の略で、1人の顧客が企業との取引期間全体を通じてもたらす総利益のことです。顧客生涯価値とも呼ばれます。前後の文脈に合うように考えると、空欄cには「顧客がQ社にもたらす利益」「期間に顧客から得る総利益」「顧客生涯価値」などが当てはまります。\n∴\nc\n＝顧客がQ社にもたらす利益、顧客生涯価値\n〔\nd\nについて〕\n本文では「ゴールである\"利益を伴う成長\"の実現を目指す成長戦略の進捗を測るKPIとして，Z世代の来店客数と，\nd\nを設定する」とあります。Q社の成長率に関する記述を確認すると、「Q社の利益は2回以上来店したことのあるリピート客を含む延べ来店客数に比例しており，成長率は新規来店客数に比例している」と説明されています。つまり、利益を向上させるにはリピート客を増やし、延べ来店客数を増やすことが重要であるとわかります。\nさらに、〔成長戦略の策定〕には「LTVを向上させることで，採算性を改善する」という戦略が記載されています。前述のとおり、LTVは顧客が生涯にわたって企業にもたらす利益を意味するため、これを向上させるには、顧客1人あたりの来店頻度や購入額を増やすことが求められます。このため、来店客数とともにLTVの向上と直接関連する「リピート率」をKPIとするのが適切です。\n∴\nd\n＝リピート率\n\n---\n\n解説\n〔\ne\nについて〕\nQ社では、各店舗の店長が部下に対してコーヒーの淹れ方や接客スキルなどの指導を行っていますが、部下の育成が十分に行われず、その結果、顧客に対して期待されるサービス品質が十分に提供できていません。また、従業員が自身のスキル向上を求めても、店長からの支援が不十分なために不満が募り、離職率が上昇しているという現状が描かれています。\nこの状況を受けた店長の360度評価では、「店長の自己評価は高いが，部下からの評価はそれほど高くなく，両者の評価には大きなギャップがあった」という結果が出ています。簡単に言うと、部下は店長に対して不満を持っていますが、店長はそれに気付いていません。「各店舗は店長をリーダーとする一つのチームとして運営されて」いますから、チームリーダーである店長のリーダーシップはチームマネジメントにおいて極めて重要です。店長の対応は、サービスプロフィットチェーンの「自社内のサービス品質」が低い一因となっていると考えられるので、現状を自覚させることが改善の第一歩となります。以上より、店長に伝えるべき現状とは、360度評価の結果である「自己評価と部下からの評価とのギャップ」があること、または360度評価の具体的内容である「部下からの評価がそれほど高くないこと」であると判断できます。\n∴\ne\n＝自己評価と部下からの評価とのギャップ\n〔\nf\nについて〕\n本文中にある次の2つの記述に着目します。\n顧客へのサービス品質が高いチームは，従業員満足度が高く，それによってチームメンバーがやる気をもって自律的にスキルの向上を図っており，また，チームメンバーの定着率が高いという共通の特性がある\nこの特性を満たすためには，店長が，部下に対して\n共感\nすることで，質問・相談しやすい環境を作ることが必要である\nこの2つの記述より、部下から様々な考え方や行動の選択肢を引き出し、自律的な行動を促すために店長には求められているのは、部下に共感する姿勢であると直接読み取ることができます。したがって空欄fには「共感」が当てはまります。\nまた、本文末尾では、R常務が部下であるS課長からの報告に対し、理解と賛同を示しており、これが空欄fに当たるとされています。このように相手の感情や立場、考え方に理解を示し、それを感じ取って寄り添う姿勢が「共感」の例となります。\n∴\nf\n＝共感\n設問では、店舗統括本部が取り組むべき施策が問われています。店舗統括本部に関しては、本文冒頭部で「店舗業務の標準化を推進する」役割を担っているという説明があります。また、下線②の前には「（全従業員に対する）再教育に当たって」とあるので、これを前提として施策を考えていくことになります。\nQ社の店舗と競合店を比較すると、店舗のオペレーションについて次のような課題があることがわかります。\n競合店は，コーヒーの淹れ方をマニュアル化して全従業員を定期的に教育している\n店によってコーヒーの味にばらつきがある\n全て店長の責任で部下の育成を行うことには限界がある\n新たなブランドは「熟練の技術で淹れる香り高いコーヒー」が売りですが、現状では達成できていないため、コーヒーを淹れるスキルの改善が必須です。再構築したブランドで取り組むべき施策は多くありますが、上記の課題を克服するために店舗統括本部が取り組むべきこと、全従業員の再教育に関するものであることを踏まえると、コーヒーの淹れ方をマニュアル化し、従業員のコーヒーを淹れるスキルを高めることが求められている施策に妥当します。コーヒーの淹れ方をマニュアル化することによって、競合店に劣らない店舗業務の標準化、店ごとの品質差をなくしたサービス品質の改善、マニュアルによる店長に依存しない教育体制の整備を実現することが可能になります。\n設問には「再構築したブランドを考慮して」という条件があるので、解答に当たり「香り高いコーヒー」という字句は外せません。したがって、「香り高いコーヒーを淹れるスキルのマニュアル化」「香り高いコーヒーの淹れ方の標準化」といった解答が適切となります。\n∴香り深いコーヒーの淹れ方のマニュアル化\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm02.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm02.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問2(経営戦略)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問3　プログラミング】\n\n素数を列挙するアルゴリズムに関する次の記述を読んで，設問に答えよ。\n素数とは，2以上の自然数のうち，正の約数が1と自身だけである数のことである。\n2以上の自然数Nに対して，N以下の素数を列挙する関数 prime1 のプログラムを図1に示す。なお，本問では，配列の要素番号は1から始まり，要素数が0の配列を{}で表す。\nこの関数 prime1 の時間計算量は，Nを用いて表すとO(\nア\n)である。\n〔アルゴリズムの改良1〕\n素数の定義によって，2以上の自然数sについて，s自身を除くsの正の倍数uは，1とu以外にsも約数に含むので素数ではない。この性質を利用して関数 prime1 を改良し，次の手順で素数を列挙する関数 prime2 を考える。\n2以上N以下の自然数について，全て\"素数である\"とマークする。\n2以上N以下の自然数dについて，次の(a)，(b)を行う。\ndが\"素数ではない\"とマークされている場合，何もしない。\ndが\"素数である\"とマークされている場合，次の処理を行う。\ndが素数であることを確定させる。\nd以上の自然数xについて，dをx倍した数を\"素数ではない\"とマークする。\n関数 prime2 のプログラムを図2に示す。\n関数 prime2 は関数 prime1 と比較してメイン処理部の時間計算量を小さくすることができ，引数Nの値が同一の場合において，関数 prime2 の(L2)の行の実行回数は，関数 prime1 の(L1)の行の実行回数以下となる。\n〔アルゴリズムの改良2〕\n4以上の偶数は全て2の倍数であるので素数ではない。したがって，2以外の素数を列挙するためには奇数だけを考慮すればよい。この性質を利用して，関数 prime2 に次の変更を加えた関数 prime3 を考える。\n関数の戻り値として素数の一覧が格納される primes にあらかじめ2を格納しておく。\nいずれのループも奇数についてだけ実行されるようにする。\n3以上の自然数2k＋1が素数か否かを isPrime[k] で表すようにする。\n関数 prime3 のプログラムを図3に示す。\n関数 prime3 は関数 prime2 と比較してメイン処理部の二重ループの実行回数を減らすことができる。引数Nの値が同一の場合において，関数 prime3 の(L3)の行の実行回数は，関数 prime2 の(L2)の行の実行回数の半分以下となる。加えて，計算に必要な配列 isPrime の要素数も半分以下に減らすことができる。\n\n【設問1】\n\n本文中の\nア\nに入れる適切な字句を答えよ。\n\n【設問2】\n\n図2中の\nイ\n，\nウ\nに入れる適切な字句を答えよ。\n\n【設問3】\n\n図3中の\nエ\n～\nカ\nに入れる適切な字句を答えよ。\n\n【設問4】\n\nprime1(20)，prime2(20)，prime3(20)をそれぞれ実行したとき，図1中の(L1)の行，図2中の(L2)の行，図3中の(L3)の行が実行される回数をそれぞれ答えよ。",
    "back": "【正解】 N2, isPrime[d]がtrueと等しい, t+d, isPrime[(d－1)÷2]がtrueと等しい, (t－1)÷2, t+2×d, 171, 13, 2\n\n【解説】\n解説\n〔\nア\nについて〕\nオーダー記法は、アルゴリズムの計算量を入力データ数Nとの関係で表す表記法です。次のような例があります。\nO(1)　入力数に関係なく計算量は一定（定数時間）\nO(N)　入力数に比例して計算量が増える（線形時間）\nO(N\n2\n)　入力数の2乗に比例して計算量が増える（二次時間）\nO(log N)　入力数に対して計算量が対数的に増加（対数時間）\nプログラムの時間計算量を求めるには、繰返し処理（ループ）が何回実行されるかを調べることが重要です。\n図1のプログラムを見ると二重のwhileループがあります。\n外側のwhileループでは、変数dを2からNまで1ずつ増やしながら繰り返しているので、実行回数は(N－1)回です。\n内側のwhileループでは、変数tを2からdまで1ずつ増やしながら繰り返しています。変数dの範囲は「2～N」であり、d=2のときは0回、d=3のときは1回、…、d=Nのときは(N－2)回実行されます。この処理の平均実行回数を式で表すと「(0＋N－2)÷2」回となり、整理すると(N÷2－1)回 ⇒ (0.5N－1)回となります。\nオーダー記法では、Nを極限に近づけたとき(N→∞)の計算量の増加傾向を簡潔に示すため、Nの係数や定数部分は省略します。そのため、外側のwhileループも内側のwhileループのいずれも計算量はO(N)です。2つのループは入れ子構造となっているので、プログラム全体の計算量は「O(N)×O(N)＝O(N\n2\n)」となります。\n∴\nア\n＝O(N\n2\n)\n\n---\n\n解説\n解説の便宜上、図2のプログラムに行番号を振っておきます。\n〔\nイ\nについて〕\n空欄イがtrueの場合には、primes の末尾にdの値を追加する処理が行われます。変数 primes は結果となる素数の一覧を格納する配列なので、dの値を素数として追加していることになります。この処理は〔アルゴリズムの改良1〕(2)b.①の「dが素数であることを確定させる」に当たります。dが素数であることを確定するのは「dが\"素数である\"とマークされている場合」ですから、この条件が空欄イに入るとわかります。\n素数であるかどうかの管理は、配列 isPrime で行われています。行2のコメント部より、配列 isPrime は真偽値を要素とする配列で、isPrime[k] がtrueのとき、kが素数であることを表します。現在注目しているdが素数であるかどうかは isPrime[d] を参照して確認します。したがって、dが\"素数である\"という条件式は「isPrime[d]がtrueと等しい」と表せます。\n∴\nイ\n＝isPrime[d]がtrueと等しい\n〔\nウ\nについて〕\n図2のプログラムでは、「2以上の自然数sについて，s自身を除くsの正の倍数uは，1とu以外にsも約数に含むので素数ではない」という性質を利用しています。例えば、3が素数であるとわかった場合、3以外の3の倍数（6、9、12…）はもはや素数である可能性はないということです。\n空欄ウの処理は、dが素数であることが確定させた後に実行しているので、〔アルゴリズムの改良1〕(2)b.②の「d以上の自然数xについて，dをx倍した数を\"素数ではない\"とマークする」に当たります。変数 t の初期値は d×d ですので、次々とdの倍数を\"素数でない\"をマークしていくには、d×d、d×(d＋1)、d×(d＋2)、…というように、マーク対象の要素を変えていくことになります。都度＋1倍とするには、現在の変数 t の値に d を加算することで実現可能ですから、空欄ウには「t＋d」が当てはまります。\n【補足】\n変数 t の初期値が d×2 ではなく d×d になっているのは、d未満の数の倍数についてはそれまでの処理で既に\"素数ではない\"とマークされているためです。\n∴\nウ\n＝t＋d\n\n---\n\n解説\n解説の便宜上、図3のプログラムに行番号を振っておきます。\n〔\nエ\nについて〕\n空欄エには空欄イと同じく、dが\"素数である\"とマークされている場合にtrueとなる条件式が入れる必要があります。\n素数であるかどうかの管理を配列 isPrime で行っていることは図2のプログラムと同じですが、図3では奇数だけを検証対象とするため、isPrime も奇数についてのみ情報を保持するように変更されています。行2のコメント「isPrime[k]がtrueであれば2k＋1が素数であることを表（す）」より、dが2k＋1のとき参照すべき要素は isPrime[k] になることがわかります。具体的には、配列 isPrime に格納される真偽値と値の関係は次のようになります。\n2k＋1＝d の関係より、dからkを求める式は以下のようになります。\n2k＋1＝d\n2k＝d－1\nk＝(d－1)÷2\n参照すべき要素は isPrime[(d－1)÷2] となるので、空欄エには「isPrime[(d－1)÷2]がtrueと等しい」という条件式が当てはまります。\n∴\nエ\n＝isPrime[(d－1)÷2]がtrueと等しい\n〔\nオ\nについて〕\n図2のプログラムと同じく、tの値について\"素数でない\"とマークする処理です。空欄エの対応関係と同じく、マーク対象の値がtである場合、それに対応する配列 isPrime の要素番号は次の式で表すことができます。\nt＝2k＋1\n2k＝t－1\nk＝(t－1)÷2\nしたがって、空欄オには「(t－1)÷2」が当てはまります。\n∴\nオ\n＝(t－1)÷2\n〔\nカ\nについて〕\n素数であると判定した場合に、その倍数を\"素数でない\"とマークすることは図2のプログラムと同じですが、図3のプログラムではいずれのループも奇数についてだけ実行することが異なります。仮に3を素数と判定した場合であれば、3×3、3×5、3×7、…というようにマーク対象の要素を変えていく必要があります。\n図2のプログラムでは、現在のtの値にdを加算することで＋1倍を実現していましたが、ここでは＋2倍としたいためdを2倍した値を加算すれば求める処理となります。したがって、空欄カには「t＋2×d」が当てはまります。\n∴\nカ\n＝t＋2×d\n\n---\n\n解説\n〔L1について〕\n設問1の解説で記述したとおり、ループ回数は以下のようになります。\n外側のwhileループは2～20まで繰り返されるので19回\n内側のwhileループは、外側のwhileループ1回ごとに(d－2)回\nL1は、d=2のとき0回、d=3のとき1回、…、d=20のとき18回実行されるので、\n0＋1＋2＋3＋…＋17＋18＝171\nまたは和の公式\nn(n＋1)\n2\nを使って、\n(18×19)÷2＝342÷2＝171\n∴171（回）\n〔L2について〕\n最初に、図2の行12でif条件が真となるdの値を列挙します。\ndの初期値は2、N=20なので、2以上20以下の素数である、2、3、5、7、11、13、17が該当します。それぞれの値についてトレースをしてみると、L2が実行される回数は次のようになります。\nd=2　2×3 から 2×11 までの9回\nd=3　3×4 から 3×7 までの4回\nd=5　5×5＝25＞20 なので0回\n以下、dが7～17まで同様に0回\n以上より、L2が実行される回数は「9＋4＝13回」です。\n∴13（回）\n〔L3について〕\nL2と同様に、図3の行12でif条件が真となるdの値を列挙します。\ndの初期値は3、N＝20、3以上20以下の素数である、3、5、7、11、13、17が該当します。それぞれのの値についてトレースをしてみると、L3が実行される回数は次のようになります。\nd=3　3×5、3×7の2回\nd=5　5×5＝25＞20 なので0回\n以下、dが7～17まで同様に0回\n以上より、L3が実行される回数は2回です。\n∴2（回）\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm03.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm03.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問3(プログラミング)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問4　システムアーキテクチャ】\n\nデータ処理機能の配置に関する次の記述を読んで，設問に答えよ。\nC社は，動画配信サービスを提供する会社であり，サービス内容が充実していることが人気を呼び，動画配信者数や動画視聴者数が増えている。動画配信者は，Webブラウザを用いて，ビデオカメラやスマートフォンで撮影した動画ファイルをC社のWebサイトにアップロードすると，Webサイト上で動画の編集・配信，広報，アクセス分析などの機能が利用できる。\nC社の動画配信サービスは，C社配信システム部が企画から運用までを担当している。配信システム部では，サービス内容の向上を目的に，動画編集機能を強化した動画配信者向けの新しいサービスを提供するシステム(以下，新システムという)を構築することにした。新システムの構築は，配信システム部のD君が担当することになった。\n〔新システムに必要な機能〕\nD君は，現在の動画配信サービスの機能を基に，新システムに必要な動画配信者向け機能の機能要件を定義した。新システムに必要な機能一覧(抜粋)を表1に示す。\n〔新システムのサーバ構成〕\nD君は，新システムのサーバ構成を設計した。D君が設計した新システムのサーバ 構成(抜粋)を図1に示す。また，SSDとHDDのアクセス速度を表2に，LANとインターネットの通信速度を表3に，各サーバのCPUとGPUの搭載数を表4に示す。なお，新システム内の負荷分散装置，サーバ，NASはLANで接続されている。\n各サーバで計算を行うCPUやGPUで実行される演算は，\n①整数演算\nと浮動小数点演算の二つに分類される。新システムで利用するCPUは，1コア当たり整数演算が10,000G Operations／秒(以下，OPSという)，浮動小数点演算が500G Floating-point Operations／秒(以下，FLOPSという)で実行できる。また，GPUは1個当たり浮動小数点演算が10,000G FLOPSで実行できる。\nこの新システムを用いて，APサーバ1がAPサーバ1のSSDに格納された800Mバイトの動画ファイルをメモリに読み込む時間は\na\n秒である。また，DBサーバのDBMSはRDBである。\n〔配置の検討〕\nD君は，新システムの各機能の中でデータ量や計算量が多い処理を抽出した。データ量や計算量が多い処理の一覧を表5に示す。なお，データ量には，各処理を実行するためにCPUやGPUにインプットされるデータ量と，CPUやGPUで計算した後にアウトプットされるデータ量とがある。\nレンダリング処理は，APサーバのCPUを4コア用いて処理する場合には\nb\n秒掛かり，GPUサーバのGPUだけを1個用いて処理する場合には\nc\n秒掛かる。ただし，GPUサーバを用いて処理する場合には，APサーバからGPUサーバへデータを送信するのに\nd\n秒掛かり，APサーバヘレンダリング結果を返信するのに\ne\n秒掛かる。この検討結果から，APサーバよりもGPUサーバで処理した方がよい。\nオンラインユーザ数取得処理について，D君は\n②DBサーバで処理した結果をAPサーバへ送信する方法が最適と考え\n，DBサーバで処理することにした。\n素材送信処理は，同時に100名の動画配信者向けに素材データを送信しようとすると，LANの通信速度とHDDの読込速度が遅く送信に時間が掛かる。しかし，図1のサーバ構成の変更には大きな費用が掛かることから，サーバ構成を変更せずに対応する方法を検討した。動画配信者のPCへ送信する素材データは特定の素材データに偏っており，各素材データの更新頻度も高くないことから，表5の\n③素材送信処理の処理方法を変更\nして対応することにした。\n〔動画配信者数増大への対応方針〕\nD君は，将来的に動画配信者数が増大することを考慮して，新システムの拡張性について検討した。まず，表5のレンダリング処理は，動画データごとに処理が独立しており，GPUサーバを手動で追加する\nf\nの対応を行う方針にした。一方で，オンラインユーザ数取得処理は，時間とともに断続的に追記される動画の視聴ログをリアルタイムに集計する処理であり，DBサーバの数を増やせないことから，DBサーバを\ng\nして対応を行う方針にした。また，多次元分析処理は，\n④そこで扱うデータの特徴\nから，多次元分析処理専用のDBサーバを追加する方針にした。これによって多次元分析処理の負荷が他の処理へ影響しないようになる。\nその後，D君は新システムの構築を完了させ，C社は新システムによる新しい動画配信者向けサービスの提供を開始した。\n\n【設問1】\n\n〔新システムのサーバ構成〕について答えよ。\n本文中の\n下線①\nについて，整数演算に該当する演算を解答群の中から全て選び，記号で答えよ。\n本文中の\na\nに入れる適切な数値を答えよ。ここで，本文に記載の読込速度，書込速度を実効速度とし，他のオーバヘッドは無視できるものとする。なお，計算結果に小数が発生する場合，答えは小数第2位を四捨五入して小数第1位まで求めよ。\n\n【設問2】\n\n〔配置の検討〕について答えよ。ここで，図1のサーバ構成を一つの処理が占有でき，〔新システムのサーバ構成〕と表5に記載以外のオーバヘッドや並列処理に伴うオーバヘッドは無視できるものとする。\n本文中の\nb\n～\nd\nに入れる適切な数値を，整数で答えよ。\n本文中の\ne\nに入れる適切な数値を答えよ。なお，計算結果に小数が発生する場合，答えは小数第2位を四捨五入して小数第1位まで求めよ。\n本文中の\n下線②\nについて，DBサーバで処理した結果をAPサーバへ送信する方法が最適と考えたのはなぜか。データ量の観点から35字以内で答えよ。\n本文中の\n下線③\nについて，素材送信処理の処理方法をどのように変更したか。変更点を30字以内で答えよ。\n\n【設問3】\n\n〔動画配信者数増大への対応方針〕について答えよ。\n本文中の\nf\n，\ng\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\n下線④\nについて，オンラインユーザ数取得処理と対比して，多次元分析処理で扱うデータの特徴を20字以内で答えよ。\n\n---\n【選択肢】\n: 300＋200－100\n: 300×200÷100\n: 3.00＋2.00－0.10\n: －300＋(－200)－(－100)\n: 300×0\n: 3.00×0",
    "back": "【正解】 ア，イ，エ，オ, 1.6, 50, 10, 4, 0.8, アウトプットデータと比較してインプットデータの量が多いから, 素材データをAPサーバのSSDにキャッシュする, ア, イ, 追加・更新のない過去のデータ\n\n【解説】\n解説\n整数演算は整数型（int型）のデータを対象にした演算、浮動小数点演算は浮動小数点数型（float型）を対象にした演算です。\n整数演算で扱える数値は、正の整数、0、負の整数に限られます。項または結果に小数を含む演算は、たとえ小数点以下が0であったとしても整数演算には該当しません。したがって小数が使用されている「ウ」「カ」が浮動小数点演算、それ以外が整数演算に該当します。よって、解答は「ア、イ、エ、オ」の4つです。\nなお「イ」のような除算は、結果を小数で得るときは浮動小数点演算、商と剰余を整数で得るときは整数演算となります。本問では「300×200÷100＝6」と結果が整数なので、整数演算に分類されます。\n∴ア，イ，エ，オ\n〔\na\nについて〕\nSSD内のデータを読み込む時間は「データ量÷読込速度」で計算することができます。表2よりSSDの読込速度は500Mバイト／秒とわかるので、800Mバイトの動画ファイルをメモリに読み込む時間は、\n800M[バイト]÷500M[バイト／秒]＝1.6[秒]\n割り切れる計算であるため四捨五入の必要はありません。\n∴\na\n＝1.6\n\n---\n\n解説\n〔\nb\nについて〕\nレンダリング処理に必要な計算量は、表5より100,000GFLOとわかります。CPU1コアあたりの浮動小数点演算性能は500GFLO／秒であり、これを4コア用いて処理するため、レンダリング処理に掛かる時間は、\n100,000[GFLO]÷(500[GFLO／秒]×4)＝50[秒]\n∴\nb\n＝50\n〔\nc\nについて〕\nレンダリング処理をGPU1個を使用して処理することを考えます。GPU1個あたりの浮動小数点演算性能は10,000GFLO／秒であるので、GPUを用いた場合の処理時間は、\n100,000[GFLO]÷10,000[GFLO／秒]＝10[秒]\n∴\nc\n＝10\n〔\nd\nについて〕\nGPUで処理を行う場合、レンダリングに必要な動画データをAPサーバからGPUサーバに転送し、GPUサーバで処理後APサーバに結果を返す必要があります。APサーバからGPUサーバに転送されるのはインプットのデータです。\n表5より処理に必要なインプットのデータ量は500Mバイト、表3よりLANの通信速度が1Gbpsとわかります。転送時間は「転送データ量÷転送速度」で求めるため、APサーバからGPUサーバに500Mバイトのインプットデータを送信する時間は以下のように計算できます。計算ではそれぞれの単位がバイトとビットで異なることに注意します。\n1Gbps／秒＝125Mバイト／秒\n500M[バイト]÷125M[バイト／秒]＝4[秒]\n∴\nd\n＝4\n〔\ne\nについて〕\nGPUサーバからAPサーバに転送されるのはアウトプットのデータです。表5より処理後のアウトプットのデータ量は100Mバイトとわかるため、先程と同様の計算で、\n1Gbps／秒＝125Mバイト／秒\n100M[バイト]÷125M[バイト／秒]＝0.8[秒]\n∴\ne\n＝0.8\n新システムのサーバ構成を見ると、オンラインユーザ数取得処理はCPUを搭載するAPサーバ、DBサーバ、またはGPUサーバで処理することが可能です。DBサーバとGPUサーバ間は直接LANが接続されていないこと、より負荷のかかる浮動小数点演算が0であることから、GPUで処理するメリットはなく候補から除外できます。そうなると、APサーバまたはDBサーバのいずれかで処理を行うことになります。\n「データ量の観点」という設問の指示があるので表5でデータ量を比較すると、インプットが100Mバイト、アウトプットが0.1Mバイトとで1,000倍の差があることがわかります。APサーバで処理を行う場合、DBサーバからAPサーバに100Mのインプットデータを送信する必要があるのに対して、DBサーバで処理を行う場合はAPサーバに0.1Mのアウトプットデータを送信すれば済みます。どちらで処理してもCPU処理時間は変わらないので、転送時間が短くて済むDBサーバでの処理が適切と判断できます。\n以上を踏まえると、DBサーバでの処理を選択した理由を「データ量の観点」の観点から説明すれば、次のような解答が適切となります。\nアウトプットデータと比較してインプットデータの量が多いから\nインプットデータ量よりもアウトプットデータ量が少ないから\nデータ量が少ないアウトプットデータを転送したほうが効率的だから\n∴アウトプットデータと比較してインプットデータの量が多いから\n素材データはNAS（Network Attached Storage）のHDDから読み込みAPサーバへ送信され、その後、APサーバからインターネットに送出されます。この転送処理は次の処理を通じて行われます。\n上図を見るとわかるように、LANの通信速度（250M）とHDD読込時間（250M）がボトルネックとなっていることがわかります。ボトルネックを解消するためには両方の速度を改善する必要がありますが、下線⑤の前には「表5の」とあるため、素材送信の処理方法の観点から変更点を解答する必要があります。\n本文中には素材データの特性として「動画配信者へ送信するデータは特定の素材データに偏っており，各素材データの更新頻度も高くない」と記述されています。このように同じデータが何度も参照され、また置換えなどの管理コストが小さくて済む場合、キャッシュの利用が効果的です。素材データを都度NASのHDDから読み込みAPサーバへ送信するのではなく、利用頻度の高い素材データをAPサーバのSSDに置いておけば、少なくともHDD読込速度のボトルネックについては改善が見込まれます。\n∴素材データをAPサーバのSSDにキャッシュする\n\n---\n\n解説\n将来的な重要を予測し、その特性に合わせてシステム性能を最適化する方法を検討します。選択肢の手法はいずれもシステムを構成するサーバ資源を最適化する方法です。\nスケールアウト\nシステムを構成する物理サーバの台数を増やすことにより、システムとしての処理能力や可用性を高める方法。水平スケールとも呼ばれる\nスケールアップ\n処理能力の高いCPUへの交換、メモリやストレージの増強など、個々のサーバの性能を向上させることにより、システムとしての処理能力を高める方法。垂直スケールとも呼ばれる\nスケールイン\nシステムを構成する物理サーバ台数を減らすことにより、システムのリソースを最適化し、無駄なコストを削減する方法\nスケールダウン\n処理能力の低いCPUへの交換やメモリ容量の削減など、個々のサーバの処理能力を抑えることにより、システムのリソースを最適化し、無駄なコストを削減する方法\n〔\nf\nについて〕\n新システムの拡張について本文中に「動画データごとに処理が独立しており」と表記されているので、レンダリング処理は並列可能であることがわかります。また「GPUサーバを手動で追加する」と記載もあることから、該当する拡張方法はスケールアウトとなります。したがって空欄fには「スケールアウト」が当てはまります。\n∴\nf\n＝ア：スケールアウト\n〔\ng\nについて〕\nオンラインユーザ数取得処理は、断続的に追記される視聴ログをリアルタイムに集計する処理であり、常に追加・更新されていくデータであること、また「DBサーバの数を増やせない」と記載があることから、スケールアップによって対応することがわかります。したがって空欄gには「スケールアップ」が当てはまります。\n∴\ng\n＝イ：スケールアップ\n表5より、オンラインユーザ数取得処理で用いられるデータと多次元分析処理で用いられるデータの特徴は次のとおりです。\nオンラインユーザ数取得処理\nリアルタイムに集計されるオンラインユーザ数が対象\nインプット100M、アウトプット0.1M\n多次元分析処理\n前日までに確定された視聴ログが対象\nインプット50,000M、アウトプット1M\n本文中に「DBサーバのDBMSはRDBである」とあります。RDBMSは、リアルタイムでの単純な集計処理には適していますが、多数のテーブル結合が必要となる複雑な集計処理や、ロールアップ・ドリルダウンといった多次元的なデータ分析を行うにはパフォーマンスの面から不向きです。多次元分析処理は大量のデータをインプットとして使用し、また計算量も多いので、利用者の増加によるパフォーマンスの低下が懸念されます。\n多次元分析処理専用のデータベースとは、RDBのスナップショットを取得し、多次元構造のデータベースとして再構成したものであり、オンライン分析処理（OLAP）に特化したデータベースです。このデータベースは、事前に集計された計算結果を保持しているため、さまざまな分析軸に対する問合せや、スライシング、ダイシング、ロールアップ、ドリルダウンといった操作を高速に処理できます。ただし、一定時点のスナップショットを利用するという特性上、随時追加・更新がされるリアルタイムのデータを直接分析することはできません。\n本文中に記載のとおり、RDBを用いたDBサーバはデータの整合性を確保する必要があるため、利用者が増加しても簡単にスケールアウトすることができません。しかし、多次元分析処理は過去のデータを対象とするため、専用のデータベース（DWHなど）として分離することが可能です。これによりオンラインユーザ数取得処理（OLTP）と多次元分析処理（OLAP）が別のDBサーバに分散され、将来的な利用者数の増大にも対応できるようになります。すなわち、多次元分析専用のデータベースの追加でシステムの拡張性を確保することにしたのは、多次元分析処理の対象とするデータが「追加や更新のない過去データ」という特徴をもつからです。\n∴追加・更新のない過去のデータ\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm04.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm04.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問4(システムアーキテクチャ)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問5　ネットワーク】\n\nセキュアWebゲートウェイサービスの導入に関する次の記述を読んで，設問に答えよ。\nE社は，インターネットを利用した人材紹介業を営む会社である。\nE社のネットワークは，DMZセグメント，内部セグメント及びサーバセグメントから構成されている。DMZセグメントには，コンテンツフィルタリング機能やWebサイトのアクセス制御機能をもつプロキシサーバ及びDNSサーバが設置されている。プロキシサーバでは，内部セグメントからインターネット向けのHTTP通信，HTTP Over TLS(以下，HTTPSという)通信を中継し，アクセスログを保管している。内部セグメントにはE社の従業員が利用するPCが，サーバセグメントには業務サーバが，それぞれ設置されている。\nE社の従業員は，PCのWebブラウザを用いて，HTTP通信でサーバセグメントの業務サーバに直接アクセスして業務を実施したり，HTTPS通信でY社が提供するSaaS(以下，Y社SaaSという)にアクセスして，電子メールサービス，ファイル共有サービス，チャットサービスなどを活用したりしている。\n〔E社のネットワーク構成〕\nE社のネットワーク構成を，図1に示す。\nE社のルータでは，\na\n機能を用いて，E社内に割り当てられたプライベートIPアドレスをグローバルIPアドレス及びポート番号に変換している。\nY社SaaSでは，E社からのアクセスに対して\n①送信元IPアドレスでアクセス制限を行っている\n。\n〔セキュアWebゲートウェイサービスの導入検討〕\nE社では，近年の業務拡大に伴い，インターネット利用の機会が急激に拡大してきた。情報システム部のF部長は，悪意のあるWebサイトへ意図せずにアクセスしたり社内の機密情報や顧客情報が漏えいしたりするおそれがあると考え，インターネットアクセスに対するセキュリティ対策を強化することにした。そこで，部下のG主任に，社内のプロキシサーバに代えて，Z社がSaaSとして提供するセキュアWebゲートウェイサービス(以下，サービスZという)の導入検討を指示した。\n〔サービスZの概要〕\nG主任は，サービスZの概要を調査した。\nサービスZは，PCからインターネット上のWebサイトへのアクセスを安全に行うためのサービスであり，主な機能は次の三つである。\nアクセス先の\nb\nやIPアドレスから悪意のあるWebサイトであるかどうかを評価し，安全でないと評価された場合はアクセスを遮断する機能\n機密情報や顧客情報がE社外に漏えいしないように，TLSで暗号化された通信内容をサービスZ内で復号して通信内容を検査し，これらの情報が含まれていないことを確認する機能\n②インターネット上のWebサイトから受け取ったプログラムをサービスZ内の保護された領域で動作させ，E社システムが不正に操作されるおそれがないことを確認する機能\nサービスZを利用するためには，E社の全てのPCに専用のクライアントソフトウェア(以下，ソフトCという)を導入し，PCのWebブラウザからインターネット上のWebサイトへのアクセスを，ソフトCを介して行う必要がある。ソフトCからサービスZには，HTTPS通信を用いて接続する。サービスZは，PCからインターネット上への全てのWebアクセスについて，どのPCからアクセスされたものかを識別して，アクセスの監視や各種制御を行う。\n〔ネットワーク構成の変更〕\nG主任は，サービスZの調査結果を基に，サービスZ導入後のE社のネットワーク構成案を図2のように考えた。\nG主任は，サービスZ導入に当たって必要となる作業を検討し，次の四点に整理した。\n現行のE社のネットワーク構成からプロキシサーバを廃止し，社内のPCからインターネット上のWebサイトへのアクセスは，宛先IPアドレスが\nc\nのものだけを許可するように，FWの許可ルールを変更する。\nPCにソフトCを導入する。このソフトCは，各PC上でローカルプロキシとして動作する。各PCのプロキシ設定を変更して，このソフトCをプロキシとして利用する。ソフトCからHTTPS通信によってインターネット上のWebサイトへアクセスできるようにするために，\nc\nを宛先IPアドレスとするようソフトCの通信設定を行う。\nPCのプロキシ設定で，\nd\nについては，これまでどおり直接HTTP通信ができるように設定する。\nY社SaaSの送信元IPアドレスでのアクセス制限の設定を変更する。\n〔FWの許可ルールの見直し〕\nサービスZ導入前のE社FWの許可ルールでは，PCのWebブラウザからインターネットへのHTTP通信やHTTPS通信について，E社プロキシサーバを経由する通信だけを許可する設定になっていた。\nG主任は，サービスZ導入後に必要なFWの許可ルールを検討した。\nサービスZ導入前のE社FWの許可ルールを表1に，サービスZ導入後のE社FWの許可ルールを表2に示す。なお，ルールは項番の小さい順に参照され，最初に該当したルールが適用される。\nG主任は，これまでの調査内容をF部長に報告し，サービスZの主な三つの機能を導入することになった。\n\n【設問1】\n\n〔E社のネットワーク構成〕について答えよ。\n本文中の\na\nに入れる適切な字句をアルファベット4字で答えよ。\n本文中の\n下線①\nについて，アクセスが許可される送信元IPアドレスを，図1中の字句を用いて答えよ。\n\n【設問2】\n\n〔サービスZの概要〕について答えよ。\n本文中の\nb\nに入れる適切な字句をアルファベット3字で答えよ。\n本文中の\n下線②\nの機能の名称を解答群の中から選び，記号で答えよ。\n\n【設問3】\n\n〔ネットワーク構成の変更〕について答えよ。\n本文及び表2中の\nc\nに入れる適切な字句を，図2中のIPアドレスを用いて答えよ。\n本文中の\nd\nに入れる適切な字句を，図2中の機器の名称を用いて答えよ。\n\n【設問4】\n\n表1中の\ne\n，表2中の\nf\nに入れる適切な字句を，図1，図2又は表1中の字句を用いて答えよ。\n\n---\n【選択肢】\n: HTTPSデコード\n: アンチウイルス\n: サンドボックス\n: セキュアブラウジング\n: トラフィック検査",
    "back": "【正解】 NAPT, ip1, URL, ウ, ip8, 業務サーバ, プロキシサーバ 又は ip3, 443\n\n【解説】\n解説\n〔\na\nについて〕\n空欄に当てはまる字句の機能として「プライベートIPアドレスをグローバルIPアドレス及びポート番号に変換」と記述されています。この役割を持つ技術としてNATとNAPTがあります。NATはプライベートIPアドレスとグローバルIPアドレスを1対1で変換するのに対し、NAPTは送信元ごとに固有のポート番号を割り当てることで複数のプライベートIPアドレスを1つのグローバルIPアドレスに対応させるという違いがあります。\n本文中には「ポート番号に変換」とあり、また4文字であることからNAPT（IPマスカレード）と判断できます。したがって、空欄aには「NAPT」が当てはまります。\n∴\na\n＝NAPT\nE社のネットワークでは、内部セグメントからインターネット向けの通信はプロキシサーバを中継することになっています。E社の従業員は、PCのWebブラウザを使用してHTTPS通信でY社SaaSにアクセスしますが、この通信にもプロキシサーバの中継が入ります。\nプロキシサーバは、内部ネットワークのPCからインターネットへのリクエストを受け取ると、リクエスト内容をもとにPCを代理してインターネットアクセスを行います。プロキシサーバからY社SaaSに向けてパケットが送信されたとき、そのパケットの送信元IPアドレスは、プロキシサーバのプライベートIPアドレスであるip3です。しかし、プライベートIPアドレスのままではインターネットアクセスできませんから、E社のルータ上で動作するNAPTにより、プロキシサーバのプライベートIPアドレス（ip3）はグローバルIPアドレス（ip1）に変換されます。このため、Y社SaaSが受信するパケットの送信元IPアドレスは、E社のルータに設定されたグローバルIPアドレス（ip1）になっています。\nしたがって、Y社SaaSのアクセス制限で許可されるべき送信元IPアドレスは「ip1」となります。\n∴ip1\n\n---\n\n解説\n〔\nb\nについて〕\nWebサイトへのアクセスを安全に行うための仕組みとしてフィルタリングがあります。フィルタリングルールはURL、IPアドレス、コンテンツ、カテゴリといった単位で設定されるのが一般的です。サービスZでは、アクセス先の\nb\nをもとにWebサイトの安全性を評価する機能があると記載されています。この文脈と3文字のヒントから考えると、最も適切な字句は「URL」です。\nURLフィルタリングは、Webサイトのアドレス（URL）を基準に安全性を判定し、アクセスを許可またはブロックする仕組みです。これは、セキュアWebゲートウェイサービスを含む多くのセキュリティ対策に採用されており、危険なサイトへのアクセスを未然に防ぐ重要な役割を果たします。\n∴\nb\n＝URL\nHTTPSデコードとは、HTTPS通信を復号することを指します。本文中でいえば「TLSで暗号化された通信内容をサービスZ内で復号」する機能がこれに該当します。\nアンチウイルスは、既知のマルウェアやウイルスのパターンを検出して除去するソフトウェアです。プログラムを実際に動作させてその挙動を確認するのではなく、主にパターンマッチングやヒューリスティック分析によりマルウェアを特定します。\n正しい。\nサンドボックス\nは、疑わしいプログラムを隔離環境で動作させ、マルウェアの有無や挙動の分析を行う技術です。下線②は「サービスZ内の保護された領域で動作させ」がサンドボックスの動作と合致します。\nサンドボックス(Sandbox)という名前は、子どもが遊ぶ「砂場(sandbox)」に由来しています。砂場は、子どもが自由に遊べる安全な空間であり、外の世界に影響を与えずに試行錯誤できる場所です。同じようにコンピュータのサンドボックスも、プログラムを安全に実行・検証するために本来のシステムから隔離した環境を提供します。\nセキュアブラウジングは、インターネット上で安全にWebサイトを閲覧するための仕組みや技術の総称です。セーフブラウジング機能を有効化したり、セキュリティ機能を強化したセキュアブラウザを使用したりするなどがこれに該当します。悪意のあるWebサイトをブロックしますが、プログラムの動作確認はしません。\nトラフィック検査は、ネットワーク上を流れるデータを解析し、不正アクセスやマルウェア通信を検出する技術です。本文中でいえば「通信内容を検査し，これらの情報が含まれていないことを確認する機能」がこれに該当します。プログラムの動作解析はしないため誤りです。\n∴ウ：サンドボックス\n\n---\n\n解説\n〔\nc\nについて〕\nサービスZの導入に伴って、これまで利用していたプロキシサーバが廃止されます。この変更に伴い、社内のPCからインターネット上のWebサイト（Y社SaaSを含む）へアクセスする際は、従来のプロキシサーバ経由ではなく、新たにサービスZを経由する形となります。このため、社内からプロキシサーバの中継なしにサービスZへの通信できるようにしておく必要があります。サービスZはZ社SaaSとして提供されるため、FWで許可すべき宛先はZ社SaaSのIPアドレスである「ip8」です。\n∴\nc\n＝ip8\n〔\nd\nについて〕\n業務でHTTP通信を使用する場面として、「E社の従業員が，PCのWebブラウザを用いて，HTTP通信を利用してサーバセグメント内の業務サーバに直接アクセスする」というものがあります。\n今回のネットワーク変更では、従業員のPCからインターネット上のWebサイトへのアクセスは、新たに導入するソフトCとサービスZを経由するようになります。しかし、社内の業務サーバへのアクセスは社内ネットワーク内で完結するため、サービスZを経由する必要はありません。また、業務サーバはE社内のサーバセグメントに設置されており、外部ネットワークから直接アクセスすることはできないため、インターネットを経由する設定に変更すると、かえってアクセスできなくなる可能性があります。\n以上より、E社の社内ネットワークから業務サーバへのHTTP通信は、これまでどおり直接行えるように維持する必要があります。したがって、本文中の「直接HTTP通信ができるようにする」機器とは「業務サーバ」を指します。具体的には、業務サーバへのアクセスする際にはソフトCを使用しない例外設定をPCに行います。\n∴\nd\n＝業務サーバ\n\n---\n\n解説\n〔\ne\nについて〕\n表1のFWのルールを確認すると、TCP/443（HTTPS）とTCP/80（HTTP）が許可されています。送信元が内部セグメントになっている点を踏まえると、E社の従業員が行うインターネット上のWebサイトへのアクセスを許可するルールであると判断できます。\nこれまで述べたとおり、現在のE社（サービスZの導入前）では、従業員がPCのWebブラウザでインターネットアクセスを行う際、プロキシサーバを経由します。PCは内部セグメントにあり、プロキシサーバはDMZに設置されているため、PCからインターネットにアクセスする際には、「内部セグメント ⇒ DMZ ⇒ インターネット」という流れで通信が行われます。FWは各ネットワークセグメントの境界に位置しているため、これらの通信を通過させる許可ルールが必要です。\n〔FWの許可ルールの見直し〕には「PCのWebブラウザからインターネットへのHTTP通信やHTTPS通信について，E社プロキシサーバを経由する通信\nだけ\nを許可する設定になっていた」とあるため、通信を許可する対象はDMZセグメントではなく、プロキシサーバに限定するのが適切です。したがって、内部セグメントを送信元とするHTTP/HTTPS通信を許可すべき宛先は「プロキシサーバ（ip3）」、宛先をインターネットとするHTTP/HTTPS通信を許可すべき送信元は「プロキシサーバ（ip3）」となります。\n∴\ne\n＝プロキシサーバ 又は ip3\n〔\nf\nについて〕\n空欄cには「ip8（Z社SaaSのIPアドレス）」が入るので、このルールは内部セグメントからZ社SaaSに向けた通信を許可するルールであるとわかります。本文中には「サービスZを利用するためには，E社の全てのPCに専用のクライアントソフトウェア(以下，ソフトCという)を導入し，PCのWebブラウザからインターネット上のWebサイトへのアクセスを，ソフトCを介して行う必要がある」と記述されており、さらに「ソフトCからサービスZには，HTTPS通信を用いて接続する」とあるため、許可すべき通信はHTTPSです。HTTPSが使用するポートはTCP/443なので、空欄fには「443」が当てはまります。\n∴\nf\n＝443\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm05.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm05.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問5(ネットワーク)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問6　データベース】\n\nトレーディングカードの個人間売買サイトの構築に関する次の記述を読んで，設問に答えよ。\nS社は，トレーディングカード販売業のチェーンを営む中堅企業である。トレーディングカードを個人から買い取り，販売する事業を営んでいる。トレーディングカードの個人間の売買が盛んな市場環境を受け，個人間の売買を安心かつ手軽に行える取引プラットフォームをサービスとして提供して，安定的な手数料収入を得る新規事業を立ち上げることにした。S社の情報システム部は新規事業の要となる取引プラットフォームのシステム(以下，本システムという)を新規で構築することになり，Tさんがデータベースの設計及び開発を担当することになった。\n〔新規事業の業務要件の確認〕\nTさんは，まず，新規事業において実現する業務要件を確認した。新規事業の業務要件(抜粋)を表1に示す。\n〔概念データモデルの設計〕\nTさんは，表1の業務要件に基づいて，E-R図を用いて本システムの概念データモデルを設計した。本システムの概念データモデル(抜粋)を図1に示す。なお，カテゴリの階層構造は，自己参照の関連を用いて表現する。\n本システムのデータベースでは，E-R図のエンティティ名を表名にし，属性名を列名にして，適切なデータ型で表定義した関係データベースによって，データを管理する。\n〔SQLの作成〕\nTさんは，表1の項番2の業務要件を実現するための検索のSQL文を作成した。作成したSQL文を図2に示す。なお，\":カテゴリID\"，\":下限価格\"，\":上限価格\"，\":商品状態\"，\":出品状況\"，\":キーワード\"は，該当の値を格納する埋込み変数である。また，最上位であるカテゴリの上位カテゴリIDにはNULLが設定されている。\n〔性能の検証と改善〕\nTさんがテストデータを用いて図2のSQL文の実行性能を検証したところ，実行を開始してから検索結果が得られるまでの処理時間が長く，実用的ではないことが判明した。\n本システムでは出品される商品の数が膨大であり，利用者が図2のSQL文を頻繁に実行することが予想される。そこで，Tさんはキーワードでの検索が必要な商品名及び商品説明の列には全文検索エンジンを用いるとともに，その他の列に対しては適切なインデックスを設定し，性能上の懸念を解消することを検討した。\nインデックスの方式には，B-treeインデックスを採用することにした。Tさんは，各表の表定義を確認し，インデックスを設定すべき列を検討した。出品表の表定義を表2に，カテゴリ表の表定義を表3に示す。\n表2及び表3のデータ型欄は，データ型，長さ，精度，位取りを示す。PK欄は主キー制約，UK欄はUNIQUE制約，非NULL欄は非NULL制約の指定をするかどうかを示す。指定する場合にはYを，指定しない場合にはNが記入されている。ここで，主キーに対してはUNIQUE制約は指定せず，非NULL制約は指定するものとする。カーディナリティ欄は列に多数の異なる値をもつ場合には高を，少数の異なる値をもつ場合には低を記入する。そして，高と低の中間の数の異なる値をもつ場合には中を記入する。データ分布欄は列に含まれる値の確率分布の仮定を示す。\nTさんは，\n①B-treeインデックスの特性\nを踏まえて，特定の値を指定したときに行数を表全体の5%以下に絞り込める列だけにインデックスを設定することにした。\nTさんは，必要なインデックスを設定後にテストデータを用いて図2のSQL文の実行性能を検証し，実用的な性能であることを確認した。ただし，表2及び表3のデー夕分布は新規事業立上げ前の時点における仮定でしかない。今後実際に運用する際にはデータ分布が仮定とは異なる場合があるので，定期的にインデックスを見直すことを申し送り事項の一つとして，本システムのデータベースの設計及び開発を完了した。\n\n【設問1】\n\n図1中の\na\n～\nd\nに入れる適切なエンティティ間の関連及び属性名を答え，概念データモデルを完成させよ。なお，エンティティ間の関連及び属性名の表記は，図1の凡例に倣うこと。\n\n【設問2】\n\n図2中の\ne\n～\nh\nに入れる適切な字句又は式を答えよ。\n\n【設問3】\n\n〔性能の検証と改善〕について答えよ。\n本文中の\n下線①\nについて，B-treeインデックスの特性として適切なものを解答群の中から\n三つ\n選び，記号で答えよ。\n出品表及びカテゴリ表のそれぞれについて，表2及び表3を基に，B-treeインデックスを設定することで図2のSQL文の実行性能の高速化に寄与する列名を\n全て\n答えよ。なお，本システムで使用する関係データベースでは，主キーに対して自動的にインデックスが設定される。",
    "back": "【正解】 , －, 追跡番号, →, WITH RECURSIVE, UNION ALL, 出品.カテゴリID = 指定カテゴリ.カテゴリID, LIKE '%' || :キーワード || '%', ア，ウ，オ, カテゴリID，出品価格, 上位カテゴリID\n\n【解説】\n解説\n〔\na\nについて〕\n〔概念データモデルの設計〕の記述には「カテゴリの階層構造は，自己参照の関連を用いて表現する」とあります。つまり、カテゴリエンティティの主キー（カテゴリID）が、同エンティティの外部キーである属性（上位カテゴリID）から参照される形になるということです。表1項番1の業務要件には「カテゴリはトレーディングカードのブランドやシリーズによって階層化されている」とあることから、同一の上位カテゴリIDをもつ複数のレコードが存在しえることがわかります。したがって、空欄aには「\n」が当てはまります。\nなお、下から上に向けた自己参照の矢印でも問題ありません。\n∴\na\n＝\n〔\nb\nについて〕\n発送エンティティと取引エンティティには共通の属性\"取引ID\"があります。この属性\"取引ID\"は、取引エンティティ側では主キーであり、取引を一意に特定します。また、発送エンティティ側では外部キーです。表1項番5には業務要件として「一つの取引に関する商品を分割して発送することや，複数の取引に関する商品をまとめて発送することはできない」とあることから、取引と発送が1対1で対応することになります。発送エンティティには同一の取引IDをもつ複数のレコードは存在しえないので、発送エンティティと取引エンティティのカーディナリティは1対1です。したがって、空欄bには「―」が当てはまります。\n∴\nb\n＝―\n〔\nc\nについて〕\n表1項番5の業務要件には「S社は発送した商品の追跡番号を管理し，…」とあることから、発送に関するデータとして\"追跡番号\"をもつ必要がありますが、発送エンティティその他を見てもそのような属性はありません。したがって必要となる属性は「追跡番号」であり、これが空欄cにはが当てはまります。\n∴\nc\n＝追跡番号\n〔\nd\nについて〕\nフォローエンティティの（複合）主キーは\"フォロー元利用者ID\"、\"フォロー先利用者ID\"の組であり、利用者間のフォロー関係を一意に特定します。フォローエンティティの属性\"フォロー元利用者ID\"、\"フォロー先利用者ID\"はそれぞれ、利用者エンティティの主キー\"利用者ID\"を参照していると考えられます。ある利用者が複数の利用者をフォローすることが想定されるため、フォローエンティティには同一のフォロー元利用者IDをもつ複数のレコードが存在すると考えられます。同様に、ある利用者が複数の利用者にフォローされることが想定されるため、フォローエンティティには同一のフォロー先利用者IDをもつ複数のレコードが存在すると考えられます。よって、利用者エンティティとフォローエンティティのカーディナリティは、フォロー元利用者ID側もフォロー先利用者IDいずれも1対多です。したがって、空欄dには「→」が当てはまります。\n原則として、ある主キーをもつエンティティと、その主キーを外部キーに持つエンティティのカーディナリティ（多重度）は「1対多」です。\n∴\nd\n＝→\n\n---\n\n解説\n表1項番2の業務要件では「（検索で）カテゴリを指定する場合，指定されたカテゴリ及びその下位にある全てのカテゴリの出品が検索対象となる」とあります。図2のSQL文は、この要件を満たすために作成されています。\nこのSQLは新たな表を定義する部分と、その表を使って検索を行うという2つの文で構成されています。解答のうえで特に注目すべき部分は次の箇所です。\n〔\ne\nf\nについて〕\n図2を見ると、①のSQL文では「指定カテゴリ」という表を仮に定義していて、②のSQL文ではその定義された表を検索対象としていることが確認できます。このようにSQL文の実行結果を一時的な表として名前付きで定義し、それを後続のSQL文で利用するには\nWITH\n句（共通テーブル式：CTE）を使用します。さらに、指定カテゴリ表は自分自身を参照する再帰的な構造となっています。\nWITH\n句内の共通テーブル式がそれ自体を参照するような表を作成する場合には、\nWITH\n句を拡張した\nWITH RECURSIVE\n句を使用する必要があります。\nWITH RECURSIVE\n句の構文は次のとおりです。UNION ALLもしくはUNIONで区切られた2つの部分で構成されます。\nWITH RECURSIVE 仮想テーブル名(列名1, 列名2, …) AS (\n《非再帰的なSELECT文》\nUNION [ALL]\n《再帰的なSELECT文》\n)\n《非再帰的なSELECT文》は初期レコードを取得するもので仮想テーブルを参照しない、《再帰的なSELECT文》は仮想テーブルを自己参照して追加レコードを取得するという役割の違いがあります。\nWITH RECURSIVE\n句は次のように動作します。\n《非再帰的なSELECT文》が、仮想テーブルの初期レコードを取得する\n《再帰的なSELECT文》が、現在の仮想テーブルを参照して結果を返す。返された結果が新たな仮想テーブルとなる\n《再帰的なSELECT文》の結果が0件になるまで②を繰り返す\nUNION ALL句により、初期レコードと《再帰的なSELECT文》で取得された結果すべてが統合されて最終的な仮想テーブルとなる\n本問のカテゴリ表のように親子関係（木構造）を有する表について、下位のデータを繰返し取得するのが\nWITH RECURSIVE\n句の典型的な利用場面です。平成27年秋期のデータベースにおいて、親子関係をもつ部署表から部署構造を出力するために\nWITH RECURSIVE\n句が使用されている出題例があります。\nしたがって、空欄eには「WITH RECURSIVE」が、空欄fには「UNION ALL」が当てはまります。なお、各SQL文の結果には重複するレコードが含まれていないため、UNIONを使用しても同じ結果になります。ただし、パフォーマンス面や実務の視点\n※\nからは、UNION ALLの方がより適切な解答と言えます。\n∴\ne\n＝WITH RECURSIVE\nf\n＝UNION ALL\n※\n試験問題および標準SQLの仕様上は、UNION (DISTINCT)でも問題はありません。ただし、実際のSQL実行においては、重複行の削除と再帰処理の実行順序はRDBMSの実装に依存しており、場合によっては無限ループを引き起こす可能性があるため推奨されません。実務上はUNION ALLの使用が推奨されます。\n参考URL: https://stackoverflow.com/questions/47998833/why-does-a-recursive-cte-in-transact-sql-require-a-union-all-and-not-a-union\n【補足】\nWITH RECURSIVEの動作を具体例で確認しましょう。仮にカテゴリ表が以下で、:カテゴリIDが2だとします。\n図2のSQLの《非再帰的なSELECT文》の結果は次のとおりです。\n次に《再帰的なSELECT文（1回目）》では、カテゴリ表の上位カテゴリIDが、指定カテゴリ表（初期レコード）のカテゴリIDと一致するレコードを取得します。この処理の結果は次のとおりです。\n《再帰的なSELECT文（2回目）》ではカテゴリ表の上位カテゴリIDが、指定カテゴリ表（再帰1回目）のカテゴリIDと一致するレコードを取得します。この処理の結果は次のとおりです。\n《再帰的なSELECT文（3回目）》ではカテゴリ表の上位カテゴリIDが、指定カテゴリ表（再帰2回目）のカテゴリIDと一致するレコードを取得します。結果は0件のため、ここでループは終了します。初期レコードと《再帰的なSELECT文》で取得されたレコードが、UNION ALLで統合されることにより最終的な仮想テーブルが完成します。\n〔\ng\nについて〕\nFROM句に出品表、INNER JOIN句にはWITH RECURSIVE文で作成した指定カテゴリ表が指定されているので、空欄には2つのテーブルを結合するための条件が入ります。指定カテゴリ表は、指定されたカテゴリとその下位のカテゴリの一覧表であり、出品表とカテゴリ表は、\"カテゴリID\"列によって関連付けられていますから、\"カテゴリID\"列で結合すればそれらのカテゴリに該当する出品を取得できると考えられます。したがって、空欄gには「出品.カテゴリID = 指定カテゴリ.カテゴリID」が当てはまります。\n∴\ng\n＝出品.カテゴリID = 指定カテゴリ.カテゴリID\n〔\nh\nについて〕\n表1項番2の業務要件には「キーワードは，商品名及び商品説明を\n部分一致\nで検索したい場合に指定する」とあることから、この検索条件をWHERE句に追加する必要があります。部分一致検索とは、文字列の部分として対象語句を含む値を検索するもので、LIKE句を使用した次の構文を指定して行います。\nWHERE 列名 LIKE '%語句%'\n%\nはワイルドカードと呼ばれ、0文字以上の任意の文字列にマッチする特殊文字です。対象語句の前後に付けることで部分一致検索となります。\n〔SQLの作成〕には「\":キーワード\"は，該当の値を格納する埋込み変数である」と記述されているので、上記の語句の部分に\":キーワード\"を当てはめる必要があります。埋込み変数の値を展開するためには、\n%\nと\n:キーワード\nと\n%\nを文字列結合しなければなりません。標準SQLでは\n||\n(パイプ演算子)を使って文字列結合を行うので、空欄hには「LIKE '%' || :キーワード || '%'」が当てはまります。\nなお、\nWHERE 出品.商品名 LIKE '%:キーワード%'\nだと、\":キーワード\"という語句で部分一致検索されてしまうため誤りです。また、\n||\nは標準SQLにおける文字列結合の演算子ですが、使用するDBMSによっては\n+\nやCONCAT関数を用いるケースもあります。\n∴\nh\n＝LIKE '%' || :キーワード || '%'\n\n---\n\n解説\nB-tree（B木）は、すべての葉ノードの深さが一定であり、1つの節点に複数の値を持つことができる平衡多分木の木構造です。B-treeインデックスはB木を使用したインデックス法で、その改良版のB\n+\n木インデックスとともにRDBMSでよく使用されます。すべての葉ノードが同じ深さにあるため、検索・挿入・削除のいずれの操作もO(log n)の計算量で安定して処理でき、パフォーマンスの一貫性が保証されるのが特徴です。\nB-treeインデックスは、次のようなもつ列に対して設定するとクエリの高速化が期待できます。\n一致検索（=、LIKE\n※\n、IS [NOT] NULL）が行われる\n※\n前方一致、完全一致に限る\n範囲検索（>、<、>=、<=、BETWEEN）が行われる\n値の重複が少ない（＝カーディナリティが高い）\n正しい。検索対象の各列にインデックスが設定されている場合、検索時にそれぞれのインデックスを活用することでAND条件の絞り込みが効率的に行われ、検索が高速化されます。また、複数列で構成される「結合（複合）インデックス」を設定すれば、検索パフォーマンスをさらに向上させることが可能です。一方、NOT演算子を使った検索では、条件に合わないデータを探すために全件スキャンが必要になります。この場合、インデックスは利用されず検索の高速化はできません。\nインデックスは元の列の値に基づいて構築されています。インデックスが設定された列に対して演算（加算や関数の適用）や型変換をした場合、列の元の値と直接比較できません。このため、インデックスは利用されず検索の高速化はできません。\n正しい。インデックスを設定した列に含まれる値の分布に偏りがなければ、各値に対応するレコード数もほぼ等しく、B木に均等に分布していることになります。そのため、どの値を対象に検索しても検索時間に大きな差はありません。\n高速化できるのは、カーディナリティが高い列に設定した場合です。カーディナリティが低い列（＝同じ値がたくさん含まれる列）では、インデックスで絞り込んでも候補となる行が大量に返されます。返された行を全行スキャンする必要があるため、検索の高速化は限定的です。\n正しい。B-treeインデックスは平衡木構造であるため、探索時の比較回数は木の高さに比例します。B木の深さは各節点が持つエントリ数（次数）で決まり、次数がb、深さがhであるB木がもてる葉ノード数nは「n＝b\nh\n」の式で表せます。この式より、葉ノード数nで次数がbであるB木の深さhは「h＝log\nb\nn」です。したがって、探索における計算量のオーダーは対数時間：O(log n)となります。\n行を挿入する際には、適切な挿入位置を見つけるために検索を行う必要があります。検索・挿入・削除に要する計算量はほぼ等しく、対数時間：O(log n)に収まります。\n等号演算子（=）を用いた一致検索、範囲検索のどちらも高速化できます。\n∴ア，ウ，オ\nまず、本文および設問に記載されている除外条件を整理します。\n主キーに対して自動的にインデックスが設定される\nキーワードでの検索が必要な商品名及び商品説明の列には全文検索エンジンを用いる\nこの記述より、各表の主キー列、出品表の\"商品名\"列と\"商品説明\"列は、B-treeインデックスの設定対象から外れます。また、本設問においてB-treeインデックスを設定するのは「図2のSQL文の実行性能の高速化」を行うことが目的なので、図2のSQL文の検索対象（WHERE句とON句）とされない、出品表の\"出品者ID\"列、カテゴリ表の\"カテゴリ名\"列についても同様に除外することができます。\n【出品表】\n残った列は、カテゴリID、出品価格、商品状態、出品状況です。\n商品状態と出品状況はカーディナリティが\"低\"で、それぞれ取る値が3種類しかないので不適です。出品価格はBETWEEN検索をしていて、カーディナリティが\"高\"なので適しています。カテゴリIDはカーディナリティが\"中\"ですが、行数を5％以下に絞り込めるという条件を考慮した場合、カテゴリIDは少なくとも20種類以上はあること、一様分布であることから5％以下に絞込み可能と言えます。したがって「出品価格、カテゴリID」の組が適切です。\n【カテゴリ表】\n残った列は、上位カテゴリIDのみです。\n上位カテゴリIDはカーディナリティが\"中\"ですが、前述したカテゴリIDと同じ理由で5％以下に絞込みが可能です。したがって「上位カテゴリID」が適切です。\n∴出品表＝カテゴリID，出品価格\nカテゴリ表＝上位カテゴリID\n【補足】\n出品価格のデータ分布である対数正規分布は、小さい値の範囲にデータが多く集まり、最も頻度の高い値（ピーク）を過ぎると、大きな値に向かってデータ数がゆるやかに減少していく分布です（右に長く伸びた形状）。出品価格に当てはめると低価格帯が圧倒的に多いものの、中価格・高価格帯も一定数あるという状態を示します。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm06.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm06.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問6(データベース)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問7　組込みシステム開発】\n\nスマートイヤホンに関する次の記述を読んで，設問に答えよ。\nG社は，専用のアプリケーションプログラム(以下，アプリという)をインストールしたスマートフォン(以下，スマホという)とBluetoothで接続して，音楽などの音源再生機能，電話の通話機能，ノイズキャンセル機能，音声アシスト機能をもつスマートイヤホン(以下，Sイヤホンという)を開発している。\n利用者はアプリを用いて，Sイヤホンの音源再生機能と通話機能の開始／停止の指示，及びノイズキャンセル機能と音声アシスト機能のオン／オフの設定を行うことができる。Sイヤホンを用いて通話するときには，音源再生機能及び音声アシスト機能は使用できない。\nSイヤホンは左右が独立しており，左耳に装着するイヤホン(以下，左イヤホンという)はスマホとペアリングする。右耳に装着するイヤホン(以下，右イヤホンという)とスマホとの通信は，左イヤホンが中継する。\nSイヤホンは専用のケースに入れると電源がオフとなり充電が行われ，専用のケースから取り出すと電源がオンになる。\nスマホ及びSイヤホンの概要を図1に，Sイヤホンの機能を表1に示す。\n〔Sイヤホンのハードウェア構成〕\nSイヤホンは，左イヤホンと右イヤホンのそれぞれが，マイク及びスピーカーを接続した音声制御部，クロック部，通信部，それらを制御する制御部，及び電力部から成る。左イヤホンと右イヤホンとでハードウェア構成に違いはない。\n左イヤホンのハードウェア構成を図2に，Sイヤホンの構成要素の機能概要を表2に示す。\n〔クロック部の動作〕\n制御部の実行時間はクロックの周波数に反比例する。一方，消費電力はクロックの周波数が高いほど大きくなる。Sイヤホンは電池駆動であるので，できる限り消費電力は小さくしたい。そこで，表3で示すように，機能の使用状況に応じてクロックの周波数を制御部の指示で適切に割り当てることとした。\n〔制御部のタスク〕\n制御部はリアルタイムOSを使用している。電源オン時にメインタスクが生成される。左イヤホンと右イヤホンとで機能が異なるので，メインタスクはそのイヤホンで必要となるタスクだけを生成する。メインタスクを含め，それぞれのタスクは重複しない固有の優先度が割り当てられる。リアルタイムOSのタスクの状態は，実行状態，実行可能状態，又は待ち状態のいずれかである。\n制御部のタスク一覧を表4に示す。クロックの周波数が基準周波数に等しいとき，タスクの実行に要する時間は表4に示す実行時間となる。スピーカータスク，マイクタスク及び特定語検出タスクは起動周期内に処理が完了しなければならない。起動周期内に処理が完了しない場合，音飛びやノイズなどの不具合が発生する。\nタスクの優先度は，通信タスクが最も高く，以下，メインタスク，\nf\nタスク，\ng\nタスク，\nh\nタスク，アイドルタスクの順である。\nアイドルタスクは最も優先度が低いので，アイドルタスクが実行状態のとき，ほかのタスクの状態は\ni\nである。\n\n【設問1】\n\nSイヤホンの機能について答えよ。\n表1中の\na\n，\nb\nに入れる適切な機能名を表1中の機能名で答えよ。\n表2中の\n下線①\nの特定のイベントとして適切なものを解答群の中から選び，記号で答えよ。\n\n【設問2】\n\n表3中の\nc\n～\ne\nに入れる適切な数値の組合せを解答群の中から選び，記号で答えよ。ただし，メインタスクと通信タスクの実行時間，OSによるタスクの切替え時間は無視できるものとし，実行時間は供給されるクロックの周波数に反比例するものとする。\n\n【設問3】\n\n制御部のタスクについて答えよ。\n本文中の\nf\n～\nh\nに入れるタスク名を，表4中のタスク名で答えよ。\n右イヤホンのメインタスクでは生成せず，左イヤホンのメインタスクだけが生成するタスクを，表4中のタスク名で答えよ。\n\n【設問4】\n\nアイドルタスクについて答えよ。\n本文中の\ni\nに入れるリアルタイムOSのタスクの状態を答えよ。\nクロックの供給を停止できるのは，表3における使用状況が待機時のときだけである。待機時以外でクロックの供給を停止できない理由を，タスクの起動周期の観点で40字以内で答えよ。\n\n---\n【選択肢】\n: -ア　一定時間経過イ　スマホからのデータを受信ウ　制御部からの指示を受信エ　電力部が電力を供給オ　マイクから入力された音声データから特定のキーワードを検出",
    "back": "【正解】 音源再生機能, 音声アシスト機能, イ, オ, マイク, スピーカー, 特定語検出, 特定語検出, 待ち状態, クロックの再開に掛かる5ミリ秒以下の周期で動くタスクがあるから\n\n【解説】\n解説\n〔\na\nb\nについて〕\n2つの空欄には、表1中に記載の4つの機能名のうち、通話機能の使用時に停止する機能が入ります。\n通話の開始と着信に関連する記述を探すと、本文冒頭部に「Sイヤホンを用いて通話するときには，音源再生機能及び音声アシスト機能は使用できない」という説明があります。したがって、通話機能の使用時に停止するのは「音源再生機能」「音声アシスト機能」の2つとわかります。\n∴\na\nb\n＝音源再生機能、音声アシスト機能\n特定のイベントによって再開されるのは、表2の通信部の記述より、停止したクロックの供給を再開することであるとわかります。次に図2のデータの流れを見ると、クロック部へのデータ送信は、制御部および通信部のみが行うことが確認できます。このため、クロック部にイベントを通知するのは、この2つの構成要素のいずれかと判断できます。\n制御部については、表2に「クロックの供給が停止されると，その時点の状態を保持したまま停止する」と記載されており、クロックが停止している状態では、制御部からクロック部に通知することはできないと考えられます。このため、制御部によるクロック供給の再開は期待できません。\n通信部については以下の2つの記述があります。\n内部にクロックをもち、電源オン後は常に動作する\nスマホからのデータを受信すると，それを制御部に送信し，データを受信したことをクロック部に送信する\nこの説明のとおり、クロック供給が停止しても通信部は動作しており、スマホからのデータを受信を契機として、クロック部を再開させる機能を備えています。したがって、クロックの供給が再開する特別なイベントとは「スマホからのデータ受信」です。\nなお、スマホから受信するデータとは、具体的にはアプリ操作による「Sイヤホンの音源再生機能と通話機能の開始／停止の指示，及びノイズキャンセル機能と音声アシスト機能のオン／オフの設定」であると考えられます。\n∴イ：スマホからのデータ受信\n\n---\n\n解説\n表2の制御部の説明によると、クロック部への指示は0, 0.5, 1, 1.5, 2のいずれかであり、これに基準周波数を掛けたクロックが供給されます。どの周波数を選ぶべきかを判断するために、周波数が高低によってシステムへ与える影響を整理します。\n〔クロック部の動作〕には、周波数の高低によって変化する要素として、次の2点が記述されています。\n制御部の実行時間は、クロックの周波数に反比例する（周波数を2倍にすると実行時間は1/2になる）\n消費電力は、クロックの周波数が高いほど大きくなる\n消費電力については「イヤホンは電池駆動であるので，できる限り消費電力は小さくしたい」との記述があるため、可能な限り低い周波数が望ましいです。また〔制御部のタスク〕には「スピーカータスク，マイクタスク及び特定語検出タスクは起動周期内に処理が完了しなければならない」との記述があるため、一定時間内に完了するようにしなければなりません。すなわち、実行時間が基準内に収まる中で最も低い周波数を決めることになります。\nなお、本設問では「メインタスクと通信タスクの実行時間，OSによるタスクの切替え時間は無視できる」との記述があるため、以降はスピーカータスク・マイクタスク・特定語検出タスクの実行時間のみを考慮します。\n〔\nc\nについて〕\n音源再生1の状況は、音源再生と音声アシストの機能がオンになっています。表1と表4を照らし合わせて各機能が使用するタスクを確認すると、機能とタスクは次のように対応しています。\n音源再生機能 … スピーカータスク（音源再生時）\n音声アシスト機能 … マイクタスク、特定語検出タスク\nつまり、音源再生1ではスピーカー（音源再生時）、マイク、特定語検出の3つのタスクが動作します。\nそれぞれ起動周期が違うため、各タスクの実行時間を算出する際、各起動周期の最小公倍数である40ミリ秒間を1単位とします。40ミリ秒以内に行うべき処理が全てが完了するかどうかを見ていきます。\nスピーカー（音源再生時）\n起動周期は5秒なので、起動回数は 40÷5＝8回\n実行時間は 3.4×8＝27.2ミリ秒\nマイク\n起動周期は2秒なので、起動回数は 40÷2＝20回\n実行時間は 1.0×20＝20ミリ秒\n特定語検出\n起動周期は40秒なので、起動回数は 40÷40＝1回\n実行時間は 20×1＝20ミリ秒\n合計　27.2＋20＋20＝67.2ミリ秒\n合計が40ミリ秒を超えているため実行時間の制約を満たしません。1の次に大きい1.5をクロック周波数の指示とすると、実行時間はこれを1.5で割った値、つまり「67.2÷1.5＝44.8ミリ秒」となります。これでも時間内に終わらないので、1.5より大きい2にすると、実行時間は「67.2÷2＝33.6ミリ秒」となり時間内に収まります。したがって、音源再生1に割り当てる適切な指示値は2です。よって、空欄cには「2」が当てはまります。\n〔\nd\nについて〕\n音源再生2の状況は、音源再生とノイズキャンセリングの機能がオンになっています。表1と表4を照らし合わせると、機能とタスクは次のように対応しています。\n音源再生機能 … スピーカータスク（音源再生時）\nノイズキャンセリング機能 … マイクタスク\nつまり、音源再生2ではスピーカー、マイクの2つのタスクが動作します。前述の計算結果を利用して計算すると、実行時間は「27.2＋20＝47.2ミリ秒」となります。指示値が1では実行時間が超過しますが、次に大きい1.5を指定すれば「47.2÷1.5＝31.46…ミリ秒」となり時間内に収まります。したがって、音源再生2に割り当てる適切な指示値は1.5です。よって、空欄dには「1.5」が当てはまります。\n〔\ne\nについて〕\n最後に、通話時の状況について確認します。ノイズキャンセリングは機能のオン・オフが切り替え可能となっていますが、周波数の指示をオン・オフによって切り替えるような記述はないので、実行時間がより長くなるオンの状況下で見積もります。表1と表4を照らし合わせると、機能とタスクは次のように対応します。\n通話機能 … スピーカータスク（通話時）\nノイズキャンセリング機能 … マイクタスク\nつまり、通話ではスピーカー（通話時）、マイクの2つのタスクが動作します。これまでと同様に40ミリ秒を一単位として実行時間を計算すると、\nマイクタスク\n前述のとおり、20ミリ秒\nスピーカータスク（通話時）\n起動周期は5秒なので、起動回数は 40÷5＝8回\n実行時間は 0.5×8＝4ミリ秒\n合計　20＋4＝24ミリ秒\n合計40ミリ秒以内なので実行時間は問題ありません。そこで、消費電力の低減を考慮して指示値を0.5に下げてみると「24÷0.5＝48ミリ秒」となり、40ミリ秒を超えてしまいます。したがって、通話時に割り当てる適切な指示値は1です。よって、空欄eには「1」が当てはまります。\n∴\n\n---\n\n解説\n〔\nf\ng\nh\nについて〕\n空欄f～hに入るのは表4のタスク名であり、本文中にはメインタスクおよびアイドルタスクが記載済みなので、当てはまるのはスピーカー、マイク、特定語検出のいずれかです。3つのタスクはどれも周期的に実行しなければならないため、実行が妨げられないように優先度を設定する必要があります。\nまず、特定語検出の優先度を最も高くした場合を考えると、実行中の20ミリ秒間は他2つのタスクが実行されなくなります。スピーカーとマイクの起動周期はそれぞれ5ミリ秒および2ミリ秒ですから、起動周期を守ることができません。したがって、特定語検出の優先度は、他2つのタスクよりも低くする必要があります。\n次に、スピーカーの優先度がマイクよりも高い場合を考えると、音源再生時の実行時間が3.4秒とマイクの起動周期2秒より長いため、やはりマイクの起動周期を守ることができません。したがって、スピーカーの優先度はマイクよりも低くする必要があります。\n以上より、優先度が高い順に、空欄fが「マイク」、空欄gが「スピーカー」、空欄hが「特定語検出」が適切となります。\n∴\nf\n＝マイク\ng\n＝スピーカー\nh\n＝特定語検出\n表2の制御部の説明には、「左イヤホンの場合は，マイクから入力された音声データを解析して，特定のキーワードを検出する」と記載されています。左イヤホンだけで行われ、右イヤホンでは行われないのはこの処理を指しています。「音声データを解析して，特定のキーワードを検出する」機能は、表4より特定語検出タスクが提供するものとわかります。したがって、右イヤホンのメインタスクで生成されないタスクとは「特定語検出」タスクです。\n∴特定語検出\n\n---\n\n解説\n〔\ni\nについて〕\nリアルタイムOSのタスクの状態は、本文にもあるように実行状態、実行可能状態、待ち状態のいずれかです。それぞれ次の状態を表します。\n実行状態（Run）\nタスクがCPUを使用して実際に処理を実行している状態\n実行可能状態（Ready）\nすぐに実行できるが、CPUが他のタスクを処理しているためCPUの割当てを待っている状態\n待ち状態（Wait）\n入出力（I/O）待ちや他のタスクの完了待ちなど、何らかの条件が満たされるまで実行できない状態\nまず、実行状態のタスクが同時に複数存在することはありません。したがって、アイドルタスクが実行状態の場合、他のタスクは実行状態ではありません。\n次に、実行可能状態について考えます。現在、実行状態にあるアイドルタスクは、優先度が最も低いタスクです。もし優先度が高い他のタスクが実行可能状態であれば、CPUはその優先度の高いタスクを処理するため、アイドルタスクが実行状態になることはありません。したがって、他のタスクは実行可能状態ではありません。\nよって、残る「待ち状態」が答えになります。\n∴\ni\n＝待ち状態\n表2中のクロック部の説明には「（クロック再開の）イベントを受けてから5ミリ秒後に，停止する直前の周波数でクロックの供給を再開する」とあります。待機時以外でクロックの供給を停止した場合、再開するまでの5ミリ秒の空白により、スピーカータスクとマイクタスクの起動周期を守ることができません。仮に停止と供給が繰り返された場合、タスクの遅れにより音飛びやノイズが発生することになり、システムの要求性能を満たせません。リアルタイムOSではタスクの起動周期の厳守が求められるため、クロックの供給を停止することはできません。\nタスクの起動周期から答えるとあるので、答えは「クロックの再開に掛かる5ミリ秒以下の周期で動くタスクがあるから」となります。\n∴クロックの再開に掛かる5ミリ秒以下の周期で動くタスクがあるから\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm07.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm07.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問7(組込みシステム開発)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問8　情報システム開発】\n\nオブジェクト指向設計に関する次の記述を読んで，設問に答えよ。\nM社は，企業内の複数の情報システムを接続するデータ連携ハブを製造する会社である。M社のデータ連携ハブは，企業の基幹システムを構成するERP(Enterprise Resource Planning)ソリューションやクラウドサービスとデータ連携するための部品であるコネクタの種類が多いことが人気を呼び，売上を増大させている。\nM社には三つの事業所に合計約100名が在籍しており，開発部がソフトウェアの開発を行っている。M社のデータ連携ハブに含まれるコネクタを実現するソフトウェアは，ERPソリューションやクラウドサービスの仕様変更に合わせて頻繁に修正する必要がある。また，同じプログラムコードが複数箇所にコピーされているなどの原因によって保守性が低いという課題があり，コネクタの開発コストが増大している。そこで，M社では，コネクタの開発コストを低減させるために，コネクタを構成するソフトウェアを再設計することになり，開発部のN君が担当することになった。\n〔コネクタの利用方法〕\nN君は，M社のデータ連携ハブのコネクタの利用方法を整理した。図1は，データ連携ハブを用いてデータ送信元システムからデータ送信先システムへ組織データを送信する例である。\nデータ連携ハブがFTPSを用いて人事システムからデータフォーマットがCSV形式のデータを取得し，データフォーマットや通信プロトコルを変換して別の三つのシステムに送信している。このときデータ連携ハブのコネクタの役割は，通信プロトコルやデータフォーマットの変換である。\n〔オブジェクト指向に関する調査〕\nN君は，コネクタを再設計するために，オブジェクト指向について調査した。オブジェクト指向では，ソフトウェアを部品化し，部品の組合せによって目的のソフトウェアを作る。この方法では，データとそのデータに対する処理を一つのオブジェクトにまとめる\na\nという設計指針のもと，外部公開するメソッドを定義してオブジェクト内のデータや処理の変更がオブジェクト外に与える影響を小さくする。また，あるオブジェクトの特性を他のオブジェクトに引き継ぐ\nb\nが可能であり，開発コストを低減できる。また，同名のメソッド呼出しに対してオブジェクトの種類によって異なる処理を実行する\nc\nを実現することが可能である。\n〔コネクタのクラス設計〕\nN君は，コネクタの利用方法を考慮し，オブジェクト指向を用いてコネクタに関係するクラスを設計した。N君が設計したクラス図(抜粋)を図2に示す。\nまず，送受信するデータのデータ項目を定義する連携データクラスとそれを親クラスとする組織データクラスを設計し，各クラスに必要な属性とメソッドを設計した。連携データクラスの論理削除属性は，組織データクラスのメソッドからアクセス\ne\n。\nフォーマットクラス，CSVクラス，XMLクラスは，送信するデータをCSV形式やXML形式に変換(シリアライズ)したり，受信したCSV形式やXML形式のデータを解析して，連携データクラスのインスタンスを生成(デシリアライズ)したりするクラスである。また，XMLクラスのシリアライズのように，親クラスと同じ名称・引数・戻り値のメソッドを定義することを\nf\nという。\nプロトコルクラス，FTPSクラス，HTTPSクラスは，データ送受信のためのクラスである。コネクタクラス，組織コネクタクラスは，コネクタを実現するためのクラスであり，送受信するデータのデータ項目に応じて処理を行うものである。\n図2で設計されたクラスを用いて，図1に記載のデータ連携ハブから製造システム向けにデータを送信する組織コネクタクラスのインスタンスを作成する場合，\ng\nクラス及び\nh\nクラスから生成したインスタンスを引数に，組織コネクタクラスのインスタンスを作成する。\nh\nクラスの送信メソッドの中ではフォーマットクラスのシリアライズメソッドが呼び出されるが，実際には\ng\nクラスのシリアライズメソッドが呼び出される。\n〔コネクタの修正〕\nN君は，今後予想されるコネクタの修正時に，図2で設計したクラスに対して少ない修正で対応できるか机上で検証した。\n図1に記載の人事システムに格納されている研修受講記録データを新たに他システムへ送信する必要がある場合には，\n①新しいクラスを二つ作成\nすればよい。また，CSVファイルやXMLファイルの中の講座名などの文字列の文字コードを変換する共通機能が必要となった場合には，\n②図2のある一つのクラスに文字コード変換のメソッドを追加\nすればよい。\nその後，N君は，コネクタの再設計に関する必要な作業を完了した。\n\n【設問1】\n\n本文中の\na\n～\nc\nに入れる適切な字句を答えよ。\n\n【設問2】\n\n〔コネクタのクラス設計〕について答えよ。\n図2中の\nd\nに入れる適切な字句を答えよ。\n本文中の\ne\n，\nf\nに入れる適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\ng\n，\nh\nに入れる適切なクラス名を図2中の字句を用いて答えよ。\n\n【設問3】\n\n〔コネクタの修正〕について答えよ。\n本文中の\n下線①\nについて，作成する二つのクラスは，図2中の異なるクラスを親クラスとする必要がある。作成するクラスの親クラスとすべきクラス名を図2中の字句を用いて\n全て\n答えよ。\n本文中の\n下線②\nについて，文字コード変換のメソッドを追加すべきクラス名を図2中の字句を用いて答えよ。\n\n---\n【選択肢】\n: オーバーライド\n: オーバーロード\n: コンストラクタ\n: できない\n: できる\n: デストラクタ",
    "back": "【正解】 カプセル化, 継承, 多相性, データ取得(), オ, ア, XML, HTTPS, 連携データ，コネクタ, フォーマット\n\n【解説】\n解説\n〔\na\nについて〕\nオブジェクト指向において「データとそのデータに対する処理を一つのオブジェクトにまとめる」という概念が問われています。\nオブジェクト指向では、データ（属性）とそれを操作するメソッド（処理）を1つのクラスにまとめ、外部からのアクセスを制限します。この設計指針を「カプセル化」といいます。カプセルとは「小さな密閉容器」のことで、関連するデータと処理を容器に封じ込め、外部から保護するイメージです。カプセル化により、独立したソフトウェア部品として機能するようになるため、変更の影響範囲の局所化、再利用性や保守性の向上といったメリットが得られます。\nなお、似たような概念として「情報隠ぺい」がありますが、こちらは外部に公開するデータやメソッド制限することを指すので、文脈的に合っていません。\n∴\na\n＝カプセル化\n〔\nb\nについて〕\nオブジェクト指向において「あるオブジェクトの特性を他のオブジェクトに引き継ぐ」という概念が問われています。\nオブジェクト指向では、あるクラスのデータや処理を別のクラスが受け継ぐことができます。この仕組みを「継承（インヘリタンス）」といいます。継承を活用することで、共通の機能を親クラスにまとめ、子クラスでは必要な部分だけを追加・変更すれば済むようになっています。これを差分プログラミングといい、コードの重複を避けつつ、プログラムの生産性や保守性を向上させるための重要な手法です。例えば、動物クラスを親とし、それを継承した犬クラスや猫クラスを作るなどの例が挙げられます。継承元のクラスは親クラス／スーパークラス／基底クラス、継承先のクラスは子クラス／サブクラス／派生クラスと呼ばれます。\n∴\nb\n＝継承\n〔\nc\nについて〕\nオブジェクト指向において「同名のメソッド呼出しに対してオブジェクトの種類によって異なる処理を実行する」という概念が問われています。\nオブジェクト指向では、オブジェクトへの操作呼出しが、呼出し側でなく受け手側オブジェクトの特性で決まります。すなわち、同じメッセージを送っても受け手によって行われる操作が異なります。この性質を「多相性」といいます。例えば、犬クラスや猫クラスに「鳴く」という同名のメソッドを定義したとします。犬クラスの「鳴く」メソッドは「ワン」、猫クラスの「鳴く」メソッドは「ニャー」というように、同じ「鳴く」というメソッドであっても動物によって動作は異なります。同じメソッド名で異なる動作をさせることで、コードを変更することなく新しい動作を追加したり、メソッドの使用を統一したりすることができるメリットがあります。\nなお、多相性のほか、多態性、多様性、ポリモルフィズム（ポリモーフィズム）などの呼び方もあるため、これらの解答でも問題ありません。\n∴\nc\n＝多相性\n\n---\n\n解説\n〔\nd\nについて〕\n図2を見ると、コネクタには«interface»というステレオタイプが付いており、クラスではなくインタフェースであることがわかります。インタフェースとは、それを実装するクラスが備えるべき属性やメソッド（名前、引数、戻り値の型など）のみを定義したものです。インタフェース自体はメソッドの実装を持たず、あくまで「どのようなメソッドが存在するか」を規定したものであることが重要な点です。インタフェースを実装するクラスは、そのインタフェースで定義されたメソッドを具体的に実装する必要があります。\n組織コネクタクラスは、インタフェースであるコネクタクラスを実装するクラスです。コネクタクラスには「データ取得()」と「データ送信(data: 連携データ)」という2つのメソッドが定義されていますから、組織コネクタクラスではこの2つを実装しなければなりません。図2中には「データ送信(data: 組織データ)」が記載済みなので、空欄dにはもう一方の「データ取得()」が当てはまります。インタフェースで引数が指定されていないため、実装クラスでも引数は不要です。\n∴\nd\n＝データ取得()\n〔\ne\nについて〕\n図2を見ると、連携データクラスの論理削除属性には「#」が付いています。凡例によるとこの記号は属性やメソッドの可視性を指し、\"－\"は私的、\"＋\"は公開、\"#\"は保護であると説明されています。これらはアクセス修飾子というもので、属性やメソッドの公開範囲を指定する仕組みです。通常、私的はprivate、公開はpublic、保護はprotectedと呼ばれ、それぞれを指定した場合のアクセス可能な範囲は次のようになります。\nprivate\nクラス内部からのみアクセス可能\npublic\nすべてのクラスからアクセス可能\nprotected\nクラス内部と、自身の子クラス（継承先クラス）からアクセス可能\n組織データクラスは連携データクラスの子クラスであり、親クラスの論理削除属性は可視性が「保護」として定義されています。このため、組織データクラスから連携データクラスの論理削除属性にアクセスすることができます。よって、空欄eには「できる」が当てはまります。\n∴\ne\n＝オ：できる\n〔\nf\nについて〕\nオブジェクト指向において、親クラスで定義されたメソッドを、子クラスで再定義することを「オーバーライド」といいます。オーバーライドするメソッドは、親クラスのメソッドと同じ名称・引数・戻り値を持つ必要があり、子クラスで提供されるメソッドにより親クラスの実装を上書きする形となります。よって、空欄fには「オーバーライド」が当てはまります。\nその他の用語の意味は次のとおりです。\nオーバーロード\n1つのクラス内に、名称が同じで引数の数や型が異なるメソッドを定義すること。呼出し時の引数の指定に応じて適切なメソッドが呼び出される\nコンストラクタ\nインスタンスが生成されるタイミングで実行されるメソッド\nデストラクタ\nインスタンスが破棄されるタイミングで実行されるメソッド\n∴\nf\n＝ア：オーバーライド\n〔\ng\nh\nについて〕\n図2を見ると、組織コネクタクラスはコンストラクタの引数にフォーマットとプロトコルを指定することになっています。図1より、データ連携ハブから製造システムにデータを送信する際は、データフォーマットにXML、通信プロトコルにHTTPSを用いることがわかります。それぞれに応じた処理はXMLクラスおよびHTTPSクラスに実装されていますから、引数として渡すのはこの2つのクラスのインスタンスとなります。\nシリアライズメソッドはフォーマットクラス、送信メソッドはプロトコルクラスでも定義されているので、どちらを指定すべきか迷うかもしれません。図2を確認すると、フォーマットクラスとプロトコルクラスの名称は斜体で表記されており、凡例よりこの2つは抽象クラスであることがわかります。抽象クラスは子クラスに継承されることを前提とするクラスで、それ自体を直接インスタンス化することはできません。この観点から考えても、インスタンスとして引数にするのは、子クラスであるXMLクラスとHTTPSクラスであると判断できます。\n文脈より、空欄gのクラスにはシリアライズメソッドがあり、空欄hのクラスには送信メソッドがあることがわかるので、シリアライズメソッドをもつ「XML」クラスが空欄gに、送信メソッドをもつ「HTTPS」クラスが空欄hにそれぞれ当てはまります。\n∴\ng\n＝XML\nh\n＝HTTPS\n\n---\n\n解説\n人事システムに格納されている研修受講記録データを新たに他システムへ送信する場合、新たに研修受講記録データの送受信を取り扱うためのクラスが必要となります。\n図1は組織データを他システムに送信する例であり、図2ではこれに対応する形で組織データクラスが定義されています。これと同様に、研修受講記録データを扱う場合、それに対応した研修受講記録データクラスを用意する必要があります。研修受講記録データクラスは組織データクラスと同様に、「連携データクラス」を親クラスとして作成することになります。\nまた「コネクタクラス，組織コネクタクラスは，…送受信するデータ項目に応じて処理を行うものである」とあるため、研修受講記録データの項目に応じた処理を行うためには、それ専用のコネクタクラス（研修受講記録コネクタクラス）を作成する必要があることがわかります。親クラスとするのは、組織コネクタクラスと同様に「コネクタクラス」です。\nしたがって、親クラスとすべきクラス名は「連携データ、コネクタ」の2つです。\n∴連携データ，コネクタ\nオブジェクト指向設計では、DRY（Don't Repeat Yourself）の原則に従い、同じコードの重複を避けることが推奨されています。もし複数の子クラスで使用する共通機能が必要になった場合、それぞれの子クラスに個別に実装するとコードの重複が発生してしまうため適切とは言えません。このような場合は、親クラスに共通のメソッドを追加し、すべての子クラスで同じ機能を再利用できるようにします。もし変更があった際も親クラスの修正だけで対応可能になります。CSVクラスやXMLクラスは、ともにフォーマットクラスを親クラスとしているので、文字コード変換のメソッドは親クラスである「フォーマット」に実装するのが適切です。\n∴フォーマット\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm08.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm08.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問8(情報システム開発)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問9　プロジェクトマネジメント】\n\n電気機器メーカーの新たなプロジェクトに関する次の記述を読んで，設問に答えよ。\nA社は，大手の電気機器メーカーである。主力製品は，製造現場で用いられるIoTセンサーなどの機器である。製造業向けの産業機械市場に機器を提供する事業で成長してきたが，近年，成長の速度が鈍化している。そこで，研究開発していた生体センサーを核にして消費者向けのヘルスケア市場に新たなサービスを提供する新事業に進出することにした。\n新事業を推進するヘルスケア事業開発部(以下，事業開発部という)を設立して新たなサービスの事業可能性を検証するためのプロジェクト(以下，本プロジェクトという)を立ち上げることになった。昨年から始まったA社の中期事業計画では，製品開発やM&Aなどを通じて5年後には事業開発部の売上高比率を全社の20%程度までに拡大し，主力事業の一つにする計画である。\n〔ヘルスケア事業の概要と本プロジェクトの位置付け〕\nヘルスケア事業の概要は次のとおりである。\n今後，成長が見込まれる消費者向けのヘルスケア市場に進出し，高齢化に伴う未病対策といった健康増進に関わるサービスを提供することを目的とする。\n消費者向けに機器に加えてサービスを提供するために，小規模ながらUX/UIデザインに定評のあるWeb開発会社のT社を買収し事業開発部に吸収した。\n医療機器製造業で健康増進に関わるサービスへの進出を計画しているR社と事業提携の交渉をしている。R社の事業部長S氏は提携に消極的だが，当面はA社に協力するようR社経営層から指示されている。\n最初のサービスとして，脈拍，血圧，体温などのバイタルデータを活用して運動を促す行動変容サービス(以下，新サービスという)を提供する。\n本プロジェクトの位置付けは次のとおりである。\n生体センサーと連携した消費者向けのWebシステムを開発して新サービスを実現し，事業可能性を検証する。\n本プロジェクトはA社の取締役会で承認され，事業開発部とシステム部の両方を管掌するB取締役がプロジェクトスポンサーとなり，プロジェクトマネージャにはシステム部のC課長が任命された。\nA社のシステム部，旧T社のメンバーを含む事業開発部及び派遣契約で参加するR社のメンバーでプロジェクトチームを編成する。\n新サービスの事業可能性を，他社の健康増進サービスの利用経験者を含む20名の先進的なユーザー(以下，先進ユーザーという)に参加してもらって検証する。\n〔本プロジェクトの立ち上げ〕\nA社ではこれまで多くのプロジェクトを立ち上げてきたが，いずれも産業機械市場への機器の提供に付随するシステム開発プロジェクトであった。C課長は，本プロジェクトの立ち上げに際して，次のことを考慮してプロジェクト計画を作成する必要があると考えた。\n本プロジェクトは，\n①A社でこれまでに実施してきたプロジェクトとは異なる市場面及び製品・サービス面の特性\nをもつ。\nこれまで一緒に作業をしたことがない先進ユーザー，R社からの派遣社員及び旧T社のメンバーが参加する。\n新市場に新サービスを提供するので，本プロジェクトには新たな視点での目標設定が必要である。そこで，旧T社のメンバーにもヒアリングした結果，顧客中心の考え方に基づいて，顧客への体験価値の提供を，本プロジェクトで最優先に達成する目標に設定した。\n事業可能性を高めるためには，先進ユーザーに参加してもらった上で，体験価値を確実に実現できるまで仮説検証プロセスを反復してから新サービスを開始する必要がある。\nR社のS氏は，本プロジェクトの成否や成果に強い関心をもっており，新事業が順調に立ち上がれば，提携に積極的な態度に変わるものと期待できる。\n〔プロジェクト計画の作成〕\nC課長は，影響力の大きい社外のステークホルダを特定し，表1のとおり社外のステークホルダ登録簿を作成した。なお，A社内のステークホルダのプロジェクトに対する姿勢はいずれも\"支持する\"である。\n次に，C課長は，本プロジェクトチームのメンバーが担う役割と本プロジェクトへの貢献についての認識を，表2のとおり整理した。C課長は，各メンバーが本プロジェクトへの貢献についての認識に基づいて活動できれば，本プロジェクトの目標は達成できると考えた。一方，各メンバーは，本プロジェクトでの活動について，他のメンバーとの協働やこれまでの作業環境との違いなどに不安を感じていることが分かった。\nC課長は，本プロジェクトで，\n③アジャイル開発アプローチを採用することにした\n。\n〔リスクマネジメント計画〕\nC課長は，PMBOKガイド第7版に基づき，表3のとおり本プロジェクトへの影響が大きいリスクを特定し，リスクへの対応戦略とそれに基づく対応策をリスク登録簿に設定した。\nC課長が，作成したプロジェクト計画をB取締役に報告したところ，\"\nc\nが本プロジェクトの最優先の目標なので，特に，表3項番2を注視するように\"と指示を受け，承認を得た。\n\n【設問1】\n\n〔本プロジェクトの立ち上げ〕について答えよ。\n本文中の\n下線①\nについて，市場面の特性を20字以内で答えよ。\n本文中の\n下線①\nについて，製品・サービス面の特性を20字以内で答えよ。\n\n【設問2】\n\n〔プロジェクト計画の作成〕について答えよ。\n表1中の\n下線②\nについて，C課長が，S氏に対してとるべきステークホルダマネジメントとしての最も適切な行動を，解答群の中から選び，記号で答えよ。\n本文中の\n下線③\nを実施する背景は何か。本文中の字句を用いて30字以内で答えよ。\n\n【設問3】\n\n〔リスクマネジメント計画〕について答えよ。\n表3中の\na\n，\nb\nに入れる適切な字句を2字で答えよ。\n表3中の\n下線④\nについて，C課長が，この対応策によってリスクへの対応ができると考えた理由は何か。本文中の字句を用いて40字以内で答えよ。\n本文中の\nc\nに入れる適切な字句を15字以内で答えよ。\n\n---\n【選択肢】\n: -ア　R社との事業提携の交渉を打ち切る。イ　適宜プロジェクトの進捗と成果を報告する。ウ　プロジェクトの進捗と成果の情報を秘匿し，ステークホルダとのコミュニケーションを避ける。エ　プロジェクトの進捗と成果の報告は最低限にとどめる。",
    "back": "【正解】 消費者向けのヘルスケア市場に進出, 健康増進に関わるサービスの提供, イ, サービス開始までに仮説検証プロセスの反復が必要だから, 軽減, 受容 (2文字) 又は 保有 (2文字), 各メンバーが本プロジェクトへの貢献についての認識に基づいて活動できるから, 顧客への体験価値の提供\n\n【解説】\n解説\n下線①を含む一文を確認すると、「本プロジェクトは，A社でこれまでに実施してきたプロジェクトとは異なる市場面及び製品・サービス面の特性をもつ」と記述されています。\n本文冒頭部に「A社は，大手の電気機器メーカーである。主力製品は，製造現場で用いられるIoTセンサーなどの機器である。製造業向けの産業機械市場に機器を提供する事業で成長してきた」とあるように、A社はこれまで、工場の製造現場向けのIoTセンサーなどを通じ、製造業向けの産業機械市場（B2B市場）で成長してきました。これに対して、本プロジェクトは「研究開発していた生体センサーを核にして消費者向けのヘルスケア市場に新たなサービスを提供する新事業に進出する」とあるように、一般消費者を対象とするヘルスケア市場（B2C市場）への進出であり、従来の事業とは対象とする市場が大きく異なることがわかります。この対比から、新プロジェクトがもつ市場面の特性とは「消費者向けのヘルスケア市場への進出」であると判断できます。\n∴消費者向けのヘルスケア市場に進出\nA社が新事業で提供しようとしている製品・サービスに着目すると、ヘルスケア事業の概要として「今後，成長が見込まれる消費者向けのヘルスケア市場に進出し，高齢化に伴う未病対策といった健康増進に関わるサービスを提供することを目的とする」と具体的な内容が記述されています。これが新事業での提供が予定されているサービス内容です。\nA社が従来立ち上げてきたプロジェクトの多くは「産業機械市場への機器の提供に付随するシステム開発プロジェクト」でしたが、新プロジェクトは「健康管理や未病対策を重視したサービス」を開発対象とする点が特徴となります。したがって、これまでとは異なる製品・サービス面の特性について本文中から抜き出すと「健康増進に関わるサービスの提供」という解答になります。\n∴健康増進に関わるサービスの提供\n\n---\n\n解説\nステークホルダ登録簿を見ると、S氏のプロジェクトに対する姿勢は「抵抗する」となっています。この「抵抗する」という関与度は、そのステークホルダがプロジェクトの潜在的な影響を認識しており、プロジェクトの作業や成果を支持しない立場であることを示します。R社の事業部長であるS氏は、今後の事業提携において重要な意思決定者の一人ですので、ステークホルダマネジメントの観点からは、プロジェクトに対する姿勢が改善されるような施策が求められます。\n〔本プロジェクトの立ち上げ〕の最後には「R社のS氏は，本プロジェクトの成否や成果に強い関心をもっており，新事業が順調に立ち上がれば，提携に積極的な態度に変わるものと期待できる」と記述されています。この記述より、S氏はプロジェクトの成否や成果についての情報ニーズが強いことが読み取れるので、プロジェクトの進捗状況や成果をタイムリーにS氏に伝え、事業の価値や有望性を示すことが適切な行動となります。したがって正解は「イ」です。\n∴イ：適宜プロジェクトの進捗と成果を報告する\n下線③を含む一文を確認すると「C課長は，本プロジェクトで，アジャイル開発アプローチを採用することにした」と記述されています。\n〔本プロジェクトの立ち上げ〕によれば、本プロジェクトは「体験価値を確実に実現できるまで仮説検証プロセスを反復してから新サービスを開始する必要がある」 とされています。この記述から、本プロジェクトは最初に仕様全体が確定しておらず、設計～開発と仮説検証プロセスを繰り返しながら進めることがわかります。\nアジャイル開発は、短い期間のサイクルで「要件定義・設計・実装・検証」を繰り返し、その都度要件を見直しながら進める開発手法なので、フィードバックを取り入れながら開発を進める本プロジェクトとの相性が良いと言えます。従来のウォーターフォール開発は、事前に仕様が確定しているプロジェクトには適していますが、本プロジェクトのように、市場の不確実性が高く、仮説検証を繰り返しながら仕様を調整しなければならないケースでは適しません。以上がアジャイル開発を採用する背景です。\n本文中の字句を用いてという指示があるので、「仮説検証プロセスを反復してから新サービスを開始する必要がある」がそのまま解答となります。\n∴サービス開始までに仮説検証プロセスの反復が必要だから\n\n---\n\n解説\nPMBOK第7版によれば、プロジェクトにマイナスの影響を及ぼすリスク（脅威）への対応策には、回避、エスカレーション、転嫁、軽減、受容があります。\n回避\nリスクを除去する、またはリスクの影響からプロジェクトを保護する\nエスカレーション\nリスクがスコープの外部にあるか、または提案された対応策がプロジェクトマネージャの権限を超えることを上位者に報告し、同意を得る\n転嫁（移転）\nリスクが発生した場合の影響に耐えるため、リスクのオーナーシップを第三者に移転する\n軽減（低減）\nリスクが発生する確率やリスクの影響を低減するための措置を講じる\n受容（保有）\nリスクの存在を認めるが、いかなる積極的な行動も行わない\n〔\na\nについて〕\n表3項番1を確認すると「意思決定が難航し、プロジェクトの進捗が遅れる」というリスクに対し、意思決定をスムーズに行えるようにステアリングコミッティを設置する対策をとっています。この対策は、リスクが発現する確率を下げるものなので、リスク対応策のうち「軽減」に当たります。\nなお、PMBOK第7版とJIS Q 21500では「軽減」とされていますが、IPAの試験問題では「低減」という言葉も同義で使われているので、こちらでも問題ないと思われます。\n∴\na\n＝軽減（低減）\n〔\nb\nについて〕\n表3項番2を確認すると「サービス開始日までに開発が完了しない」というリスクに対し、サービス開始日を送られて、要件が収束するまで開発を継続し、これに対応する予備費を確保しておく対策をとっています。この対策は、リスクを認めながらも積極的にコントロールを行わないので、リスク対応策のうち「受容」に当たります。受容を選択する場合、リスク発生時への対処に必要な予備費用（コンティンジェンシー予備）を手当てすることが通常です。\n先ほど同じく、PMBOK第7版では「受容」とされていますが、IPAの試験問題では「保有」という言葉も使われてきたので、こちらでも問題ないと思われます。\n∴\nb\n＝受容（保有）\n下線④を確認すると「メンバーの活動を阻害する不安要因を排除して，メンバーが活動しやすい環境を作る」と記述されています。この対応策は、各メンバーが、他のメンバーとの協働や作業環境の違いに不安を感じることで、プロジェクトの目標が達成できないというリスクへの対応戦略です。\n〔プロジェクト計画の作成〕では、C課長が「各メンバーが本プロジェクトへの貢献についての認識に基づいて活動できれば，本プロジェクトの目標は達成できる」と考えていることが伺えます。つまり、メンバーが自分の役割を理解し、それに基づいて活動できることが、プロジェクトの成功に不可欠だということです。\nこのような背景を踏まえると、メンバーが安心して活動できる環境作りをC課長が実施しようとしたのは、「各メンバーが本プロジェクトへの貢献についての認識に基づいて活動できるようにするため」であると判断できます。\n∴各メンバーが本プロジェクトへの貢献についての認識に基づいて活動できるから\n〔\nc\nについて〕\n空欄cを含む一文は「\nc\nが本プロジェクトの最優先の目標なので，特に，表3項番2を注視するように\"と指示を受け，承認を得た」となっています。\n〔本プロジェクトの立ち上げ〕には「顧客への体験価値の提供を，本プロジェクトで最優先に達成する目標に設定した」と明記されています。これは表3項番2の内容とも合致します。したがって、これがそのまま解答根拠となります。\n∴\nc\n＝顧客への体験価値の提供\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm09.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm09.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問9(プロジェクトマネジメント)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問10　サービスマネジメント】\n\nサービスデスクの立上げに関する次の記述を読んで，設問に答えよ。\nB社は，中堅の電子機器販売会社で，全国に営業拠点がある。B社の営業部は，営業拠点に営業員を配置し，商品を販売している。販売数は順調に増加しているので，今後，営業員の増員を予定している。B社のシステム部サービス課は，営業支援システム(以下，本システムという)の設計，開発及び運用を行っており，本システムを営業支援サービス(以下，本サービスという)として利用者である営業員に提供している。また，サービス課は，サービスマネジメント活動を行っており，それぞれの活動に管理プロセスを定めている。サービス課に所属するC君はD課長の下でサービスマネージャを務めており，管理プロセスのマネジメントを行っている。サービスマネジメントの主な管理プロセスを表1に示す。\nサービス要求管理については，利用者からのサービス要求を，サービス課の担当者電話又は電子メールで受け付けている。受け付けた担当者はサービス要求を実現し，サービス要求の内容，実現した内容及び対応時間を問合せ記録簿に記録している。\nサービス課では，本システムの初期リリース後も，順次，機能追加のリリースを行っている。各機能のリリース時には，利用者向けに説明会を開催し，開発の担当者が説明者となって機能の概要や利用方法の説明を行い，リリース後の問合せ先として説明会の説明者が案内されている。\n〔サービス要求管理の現状と課題〕\nサービス要求のうち，問合せは，担当者が本サービスの操作マニュアル及び機能の詳細を記述した本システムの仕様書を参照して回答し，標準変更は，担当者が定型業務手順書を参照して実施している。なお，問合せの回答では，経験豊富な担当者は，操作マニュアル及び本システムの仕様書だけでなく暗黙知を使って問合せに短時間で回答する場合も多い。このことから，利用者からの問合せに対して最初の連絡で回答した割合(以下，一次解決率という)に，担当者間で差が出ている。また，問合せを受けてから回答までに要する時間を短縮するために，一次解決率の向上が課題となっている。今後，営業員の増員に伴いサービス課の業務量の増加が予想されているので，担当者の負荷が増大するおそれがあり，長時間残業の防止も課題となることが推測される。\nそこで，サービス課は，一次解決率の向上のため，サービス課の経験豊富な担当者に指示して，問合せ記録簿に記録されている内容を基に，問合せ内容，対応手順及び回答内容を整理した問合せ対応ノウハウ集を作成することにした。併せて，営業員の増員による長時間残業を防止するために，来年度からサービス課内に新たな組織としてサービスデスクを立ち上げ，そのサービスデスクでサービス要求を受け付けて実現することにした。C君がサービスデスクのサービスマネージャに任命され，立上げも行うよう指示された。サービスデスク要員は，サービスデスクの業務経験が豊富な要員を新規採用し，C君の配下でサービスデスク業務を担当させることにした。\n〔サービスデスク立上げの検討〕\nD課長は，サービスデスクについて，\"サービス課の業務量の増加に対応するために，業務を極力サービスデスクに移管する\"とともに\"一次解決率をできるだけ高くして，顧客満足を向上させる\"との方針を挙げた。\nC君は，D課長の方針を受け，サービス要求のうち，問合せについては，サービスデスク要員が問合せ対応ノウハウ集を活用して，利用者からの問合せに対して\na\nできるようにすることで，一次解決率を向上させようと考えた。なお，サービス要求のうち，標準変更については，サービス課で現在利用している定型業務手順書を参照して，サービスデスク要員がサービス要求を実現できることを確認した。\nこれらを踏まえて，C君は，表2に示すサービスデスク立上げステップを定めた。\n〔サービスデスクで行うサービス要求管理のプロセスの作成〕\nC君は，表3に示すサービスデスクで行うサービス要求管理のプロセスを検討した。\nC君は，表3をD課長にレビューしてもらい，質問と指示を受けた。そのときのD課長とC君の会話を次に示す。\nD課長：\n項番3で標準変更については，現状の定型業務手順書を使うことになっているが，サービスデスク要員で対応可能ですか。\nC君：\n定型業務手順書は，よく整備されており，対応可能です。\nD課長：\n①サービス課の担当者が行っている業務に定型化できるものがないかを調査\nしてください。\nC君：\n調査して報告します。\nその後，C君は指示された調査を実施して，D課長に報告して了承された。\n〔サービスレベル目標の決定〕\nサービス課と営業部とのSLA合意に先立って，サービス課内部で会議を開催した。会議の中で，SLAには，サービスデスクの稼働時間，コミュニケーション手段，サービス要求の実現に要する平均時間のほか，サービス要求件数の上限の取決めが必要であることを確認した。今後，内容を整理して営業部と協議することになった。\nまた，会議の中でD課長から，\"営業部と合意するサービス要求の実現に要する平均時間に関して，内部指標を設定して管理する。内部指標として問合せについては，\n②現状のサービス要求管理における課題の解消状況が分かるKPI\nを設定して管理を行い，顧客満足を上げていく。\"との説明があった。\n〔要員体制決定〕\nC君は，来年度のサービスデスクの要員体制を決定するために，サービスデスク要員の工数を算出することにした。そこで，問合せ記録簿からサービス要求管理に要した対応時間を調査した。現状の平均サービス要求件数と平均対応時間を表4に示す。\nC君は，表4に加え次の条件を前提として，\n③1日当たりに必要な工数を算出\nした。ここで，1人の要員は，1日に8時間の対応時間が確保できるものとする。\n要員は一つのサービス要求に対応している間は，その対応に専念する。\n来年度のサービス要求件数は，営業員の増員によって表4に示す平均サービス要求件数がいずれも現状より2割増加する見込みである。\nサービス要求の集中度合いを考慮して，算出された工数に2割の余裕を確保する。\nなお，サービスデスクの要員数については，工数に加えて，勤務体制，稼働率，エスカレーションの割合，採用する要員の技能などを考慮して決定することにした。\n\n【設問1】\n\n〔サービスデスク立上げの検討〕について答えよ。\n本文中の\na\nに入れる適切な字句を，本文中の字句を用いて10字以内で答えよ。\n表2中の\nb\nに入れる適切な字句を20字以内で答えよ。\n\n【設問2】\n\n〔サービスデスクで行うサービス要求管理のプロセスの作成〕について答えよ。\n表3中の\nc\nに入れる適切な字句を15字以内で答えよ。\nD課長が，本文中の\n下線①\nの調査を指示した目的は何か。D課長の方針を踏まえて35字以内で答えよ。また，この目的を達成するために有効な調査内容を，表1中の字句を用いて35字以内で答えよ。\n\n【設問3】\n\n〔サービスレベル目標の決定〕について，\n下線②\nのKPIの内容を10字以内で答えよ。\n\n【設問4】\n\n〔要員体制決定〕について，\n下線③\nの1日当たりに必要な工数は，何人日かを答えよ。なお，計算結果に小数が発生する場合，答えは小数第1位を切り上げて整数で求めよ。",
    "back": "【正解】 最初の連絡で回答, サービスデスク用ドキュメントの説明, 問合せ対応ノウハウ集, 現在のサービス課の業務を極力サービスデスクに移管するため, 通常変更の中に標準変更にできるものがないかを調査する, 一次解決率, 3\n\n【解説】\n解説\n〔\na\nについて〕\n空欄を含む一文を確認すると「サービスデスク要員が問合せ対応ノウハウ集を活用して，利用者からの問合せに対して\na\nできるようにすることで，一次解決率を向上させようと考えた」と記述されています。そこで「一次解決率を向上させる」とはどういうことかを本文から確認すると、〔サービス要求管理の現状と課題〕には以下の記述があります。\n利用者からの問合せに対して最初の連絡で回答した割合(以下，一次解決率という)に，担当者間で差が出ている\nこの記述より、B社では「最初の連絡で回答した割合」を「一次解決率」と定義していることがわかります。つまり、一次解決率を向上させるには、最初の連絡で回答できる割合を増やすことが必要です。したがって、空欄aには「最初の連絡で回答」が当てはまります。\n∴\na\n＝最初の連絡で回答\n〔\nb\nについて〕\n空欄を含む一文を確認すると「サービス課の担当者からサービスデスク要員に対して，\nb\nを行う」と記述されています。この実施内容に対応するステップは、「スキルトランスファー」となっています。スキルトランスファーとは、業務の引き継ぎや知識移転のことを指し、この文脈では、サービス課の担当者がサービスデスク要員に対して、何らかの知識や技術の移転を行うことが想定されます。\n表2の流れを確認すると、以下の点がわかります。\nスキルトランスファーは、サービスデスク立上げの準備段階の一環として実施される\nその直前のステップでは、サービスデスク用ドキュメントの整備が行われている\nその後、予行練習→サービス開始と続くため、スムーズな業務移行を支援するステップである\n「サービスデスク要員は，サービスデスクの業務経験が豊富な要員を新規採用」するため、これまでサポート業務を行っていたサービス課の担当者と比べ、本サービスに関する業務の知識が不足しているという状況があります。これを踏まえると、スキルトランスファーでは新規採用者が業務を遂行できるようにするための「何か」を行う必要があります。ここで、直前のステップで「サービスデスク用ドキュメントの整備」が行われていることを考慮すると、スキルトランスファーの段階では、それらのドキュメントの活用方法を伝えるのが自然な流れとなります。\n模範解答では具体的な内容が示されていますが、設問では解答の抽象度について明確な指示がないため、スキルトランスファーの一般論としてまとめるべきか、具体的な内容を記載すべきかの判断が難しい設問と言えます。\n∴\nb\n＝サービスデスク用ドキュメントの説明\n\n---\n\n解説\n〔\nc\nについて〕\n空欄を含む一文を確認すると「問合せについては，操作マニュアル，\nc\nを参照して回答する」と記述されています。この記述より、空欄に入るのはサービスデスクが問合せ対応で参照するものであることがわかります。\nまず本文の〔サービス要求管理の現状と課題〕の記述を確認すると、問合せ対応の現状について以下のように説明されています。\nサービス要求のうち，問合せは，担当者が本サービスの操作マニュアル及び機能の詳細を記述した本システムの仕様書を参照して回答している\nこの記述より、現状の問合せ対応では「本システムの仕様書」が参照されていることがわかります。しかし、サービスデスク要員は開発者ではありませんから、これまで開発の担当者が行っていたように本システム仕様書を参照しての回答は荷が重いと考えられます。サービスデスク立上げ後の役割分担から考えれば、本システム仕様書はエスカレーション先において担当者が参照するドキュメントとして位置づけられるため、サービスデスクには何か別のドキュメントが必要となります。\n〔サービス要求管理の現状と課題〕を確認すると、サービスデスクの立上げとともに「問合せ対応ノウハウ集」が作成されることになっています。〔サービスデスクの立上げの検討〕には、「問合せについては，サービスデスク要員が問合せ対応ノウハウ集を活用して…」とあるため、こちらが本システムの仕様書に代えて、サービスデスクが参照すべき文書になると考えられます。したがって、空欄cには「問合せ対応ノウハウ集」が当てはまります。\n∴\nc\n＝問合せ対応ノウハウ集\n〔目的について〕\n下線①は「サービス課の担当者が行っている業務に定型化できるものがないかを調査してください」というD課長の指示です。\nD課長の方針として「サービス課の業務量の増加に対応するために，業務を\n極力\nサービスデスクに移管する」ことが示されています。この方針を踏まえると、D課長が上記のような指示をしたのは、サービス課が現在対応している業務のうち、標準化が可能な業務を特定し、それをサービスデスクに移管することが目的と考えられます。このことから、調査の目的は「現在のサービス課の業務を極力サービスデスクに移管するため」であると結論付けることができます。\n〔調査内容について〕\n表1を確認すると、サービス課の変更管理プロセスには「通常変更」と「標準変更」の2種類があります。標準変更はすでに定型化されておりサービスデスクで対応できますが、通常変更は標準化されておらずサービス課の対応が必要です。D課長は新たに定型化できるものがないかどうかの調査を依頼していますから、その対象となるべき業務は、通常変更の中から探すのが適切となります。\n∴目的＝現在のサービス課の業務を極力サービスデスクに移管するため\n調査内容＝通常変更の中に標準変更にできるものがないかを調査する\n\n---\n\n解説\nKPIは、業務プロセスの改善状況を測定し、目標達成の度合いを評価する指標です。設問では「サービス要求の実現に要する平均時間に関して，…現状のサービス要求管理における課題の解消状況が分かるKPI」は何かと問われています。\nB社のサービス課が抱えている課題について本文を確認すると、〔サービス要求管理の現状と課題〕に「問合せを受けてから回答までに要する時間を短縮するために，一次解決率の向上が課題となっている」と記述されています。特に、経験豊富な担当者とそれ以外の担当者の間で一次解決率に差がある点が問題視されています。そして、D課長は「サービス要求の実現に要する平均時間に関して，内部指標を設定し，管理を行う」と述べており、設定する指標は、問合せ対応の改善状況をモニタリング可能であることが求められます。\n現状の課題の解消状況がわかり、サービス要求の実現に要する平均時間に関係する、という2点を踏まえると、KPIとして最も適切なのは「一次解決率」と判断できます。\n∴一次解決率\n\n---\n\n解説\n表4「現状の平均サービス要求件数と平均対応時間」のデータをもとに、来年度のサービスデスクの1日当たりの工数を求めます。\nまず、サービス要求ごとの所要時間を求めます。\n問合せ（機能）　24[件]×10[分]＝240[分／日]\n問合せ（利用方法）　15[件]×20[分]＝300[分／日]\n標準変更　8[件]×20[分]＝160[分／日]\n合計　240＋300＋160＝700[分／日]\n「来年度のサービス要求件数は，営業員の増員によって表4に示す平均サービス要求件数がいずれも現状より2割増加する見込み」とあるので、上記の合計値を1.2倍します。\n700×1.2＝840[分／日]\nまた「サービス要求の集中度合いを考慮して，算出された工数に2割の余裕を確保する」とあるので、上記数値をさらに1.2倍します。\n840×1.2＝1,008[分／日]\nこれが1日当たりの工数です。「1人の要員は，1日に8時間の対応時間が確保できる」「要員は一つのサービス要求に対応している間は，その対応に専念する」という条件に従い、求めた総工数を8時間＝480分で割ります。\n1,008÷480＝2.1[人日]\n設問は小数点以下を切り上げて整数での答えを求めているので、正解は「3人日」となります。\n∴3（人日）\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm10.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm10.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問10(サービスマネジメント)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "【問11　システム監査】\n\nチャットボット導入における開発計画の監査に関する次の記述を読んで，設問に答えよ。\nW社は，中堅の家電メーカーである。顧客サービス部では，製品の特徴や使用方法に関する顧客からの問合せなどに回答するコールセンターを運用しており，Web上で顧客からの問合せに対し，定型文で自動的に回答するチャットボット(以下，現行CBという)で作業効率を向上させてきた。\n問合せ内容をより的確に解釈するなど，回答の品質向上のために，顧客サービス部長がシステムオーナーとなり，現行CBのベンダーが提供する，ディープラーニングを利用していない機械学習方式のチャットボット(以下，新CBという)を導入するプロジェクトを立ち上げることになった。\n企画プロセスの完了を受けて，W社監査部のシステム監査チームは，新CBの開発計画の適切性について監査を実施することになった。そのために実施した予備調査の結果，次のことを把握した。\n〔予備調査の結果〕\n現行CBの概要と課題\nW社では，季節性のある製品を多く取りそろえているので，顧客から寄せられる問合せ数は，季節性のある製品では季節によって偏りがある。\n現行CBでは，顧客が入力した曖味な言葉に対応できず，FAQに回答が存在するにもかかわらず，問合せを解釈できずに回答が表示されないことや，誤った回答を表示することがある。顧客が現行CBの回答では不十分と感じた場合には，顧客からの要望で，コールセンターのオペレーターが代わって問合せ対応を実施している。\n導入効果をモニタリングするために，顧客の入力テキスト，現行CBが表示した回答，現行CBの回答に対して\"役立った\"かどうかの結果などを，CB回答履歴として保存している。これらの情報を分析し，顧客から\"役立った\"という評価を得た割合(以下，回答満足率という)を効果測定の指標の一つにしている。\n新製品については，発売に合わせて新規にFAQを知識ベースに登録している。今回のプロジェクト期間中にも，発売が予定されている新製品が複数ある。\n現行CBを導入した際には，受入テストを顧客サービス部員が参加せずに開発担当者だけが実施したことから，新製品に関する問合せに対して適切に回答できないなど，本番移行後に混乱を招く問題点があった。\nプロジェクトの概要\nこれまで，企画プロセスにおいて新CB導入の目的の明確化，システム化計画の立案，及びPoC(Proof of Concept：概念実証)を実施しており，PoCの結果は品質向上の効果を見込めるものであった。現在，開発計画書案を顧客サービス部とシステム部が共同で作成したところである。関係する役員，及び財務部，顧客サービス部，システム部の各部長で構成するプロジェクト運営委員会で開発計画書案を承認する予定である。\n今後の開発プロセスにおいて要件定義，追加の機械学習を含む設計，実装，テスト，受入テスト，及び本番移行を予定している。新CBの機能構成を図1に示す。\n新CBの機能概要と機械学習\n回答機能には，現行CBよりも改良した知識ベースを備えており，新CBにおいても新製品の発売に合わせてFAQを知識ベースに登録する。新CBでは，類似する言葉を整理して，言葉の関連度合いを格納している用語データベース(以下，類義語DBという)が備わっている。回答機能では，顧客の入力テキストを自然言語処理し，類義語DBと突き合わせることで，顧客の曖味な言葉遣いに対してある程度問合せ対応可能であり，回答満足率の向上が期待できる。\n新CBの類義語DBは，ベンダーからの納入時には一般的な語句だけに対応している。W社製品に関する語句などを類義語DBに反映するには，二つの方法がある。一つ目は，手作業入力データを基に学習機能に備わる手作業入力機能によって，類義語DBを整備する方法である。二つ目は，現行CBのCB回答履歴から抽出した文章を自然言語処理によって品詞別に分解し，AIモデルによって機械学習することで類義語DBを整備する方法である。\nPoCでは，機械学習によって類義語DBを整備する際のサーバ処理に想定以上の時間を要していた。\nPoCにおける機械学習による類義語DBの整備では，現行CBのCB回答履歴から6か月分を学習用データ及びテスト用データとして，ランダムに抽出した。また，回答満足率を指標にして，効果の目標レベルを定め，新CBの有効性を判断している。\n新CBでは，設計において，追加の機械学習によって類義語DBの精度を高め，回答満足率を上げる想定である。設計後においても，本番運用向けの類義語DBの学習では，再学習を実施する。\n〔監査手続案の作成〕\n予備調査の結果を踏まえて，システム監査チームが作成した監査手続案(抜粋)を表1に示す。\n〔監査部長の指示〕\n監査部長は，監査手続案をレビューして，次のとおりシステム監査チームに指示した。\n表1項番1について，設計における追加の機械学習では，類義語DBの整備がスケジュールどおり完了しないおそれがある。機械学習を実行するサーバに対する非機能要件の一つである\ne\nが，PoCを実施した際の実績データから導いた要件になっているか確かめること。\n表1項番2について，新製品だけでなく，現行の\nf\nに関する問合せへの回答について 学習用データが不十分で，適切に回答できないおそれがある。設計における追加の機械学習では，製品を網羅する観点から学習用データを準備する計画になっているか確かめること。\n表1項番3について，新CBの有効性を確保するために，\ng\nに先立って，プロジェクト運営委員会が，当初予定の導入効果が得られる見込みを評価する計画になっているか確かめること。\n追加する監査手続として，現行CB導入時における問題点を踏まえて，今後の開発プロセスにおいて顧客サービス部による\nh\nが適切に実施される計画になっているか確かめること。\n\n【設問1】\n\n表1の監査手続案について答えよ。\n表1中の\na\n，\nb\nに入れる適切な字句を，それぞれ5字以内で答えよ。\n表1中の\nc\nに入れる適切な字句を，本文中の字句を用いて5字以内で答えよ。\n表1中の\nd\nに入れる適切な字句を，5字以内で答えよ。\n\n【設問2】\n\n〔監査部長の指示〕について答えよ。\n本文中の\ne\nに入れる最も適切な字句を解答群の中から選び，記号で答えよ。\n本文中の\nf\n～\nh\nに入れる適切な字句を，それぞれ10字以内で答えよ。\n\n---\n【選択肢】\n: 外部インタフェース要件\n: 性能要件\n: セキュリティ要件\n: 保守性要件",
    "back": "【正解】 学習, 手作業入力, 目標レベル, レビュー, イ, 季節性のある製品, 本番移行, 受入テスト\n\n【解説】\n解説\nチャットボットには様々な種類がありますが、機械学習型のチャットボットとは、AIを搭載しており、ヒトがあらかじめ登録した学習データに基づき、質問の意図を類推し、回答を出すタイプです。「ディープラーニングを利用していない」と本問で述べられているのは、新CBは人間の手を借りずに質問の意図を類推し、回答を生成する類のものではないという意味です。\n〔\na\nについて〕\n〔予備調査の結果〕(3)④には、追加の機械学習は、類義語DBの精度を高めるために実施されるとあります。図1を確認すると、類義語DBの学習機能に入力されるデータとして、❶学習用データ、❷テスト用データ、❸手作業入力データの3種類があることがわかります。この3つが解答の候補となります。\n機械学習モデルの作成では、学習データを使用してモデルにパターンを学習させ、テストデータを使用して学習済みモデルの評価を行います。学習済みモデルの評価は、モデルが未知のデータに対してどの程度の予測精度があるかを測定することが目的なので、テストデータは、本番環境のデータ分布を正しく反映し、代表性が確保されていることに加え、学習に使用していないデータであることが必要不可欠です。\n本問ではPoCにおいて「CB回答履歴から…学習用データ及びテスト用データとして…抽出した」とあります。一般的には、全データを学習用データとテスト用データとに分割することによってデータの独立性を確保しますが、テストデータに学習データと重複するデータが含まれている場合、テスト結果は良好でも、本番環境では性能が発揮できないことがあります。このように本来モデルの学習時に使用すべきでない情報が含まれてしまう現象を「データリーク」といい、機械学習モデルの構築において注意すべき点の一つとされています。これが表1項番1が想定するリスクです。\n以上より、追加の機械学習においてテストデータと別に準備していることを確認すべきデータとは、学習用データであると判断できます。したがって、空欄aには「学習」が当てはまります。\n∴\na\n＝学習\n〔\nb\nについて〕\n表1項番2のリスクは「類似語DBの整備が不十分であったことによって，新製品に関する質問に対して，新CBが適切に回答しない」というものです。類義語DBの整備に関しては、〔予備調査の結果〕(3)②において「a.手作業入力」と「b.現行CBのCB回答履歴を用いた機械学習」の2つの方法が述べられています。\n空欄に当てはまるのはどちらかになりますが、課題となっているのは発売前の新製品に関する質問への対応ですからb.の方法は使用できません。現行CBの回答履歴には発売前の新製品に関する情報は含まれていないためです。このため、類義語DBの整備は手作業入力機能を使用して行われるべきであり、監査手続では開発計画がそのようになっているかを確認することになります。したがって、空欄bには「手作業入力」が当てはまります。\n∴\nb\n＝手作業入力\n〔\nc\nについて〕\n空欄には、本番移行の可否判断において使用する評価項目ごとに設定されるものが入ります。モデルの評価に関連した記載を本文中から探すと、(3)③において「回答満足率を指標にして，効果の目標レベルを定め，新CBの有効性を判断している」とあります。したがって、開発計画でも評価項目ごとに目標レベルを定め、その基準をもとに本番移行の可否判断を行うことが適切であると読み取れます。したがって、空欄cには「目標レベル」が当てはまります。\nなお、同じ5文字で「回答満足率」や「測定の指標」などの解答も想定されますが、これらは評価項目そのものですので適切ではありません。\n∴\nc\n＝目標レベル\n〔\nd\nについて〕\n監査手続案の項番4は、チャットボットに限らず、システムを導入する際のテスト一般についてのコントロールです。システム管理基準によれば、テスト工程に当たる「検証」のフェーズでは主に次の4つの管理活動を実施することとされています。\n計画\n検証の範囲、手順、関連システム及びサービス、及び制約を明確にし、スケジュールを調整する\n結果のレビュー\nシステム要件を反映していることを示す裏付けを入手し、レビューする\n結果の文書化と承認\n検証結果を文書化し、承認を得る\n不具合の改善\n検証で発見された不具合及び改善結果を記録し、不具合の改善状況をフォローアップする\n表1項番4の監査手続のうち、「テストの手順が策定され」が1つ目の計画、「テスト結果と不具合の対応状況を文書化して保存」が3・4つ目の管理活動に当たりますから、空欄dには残った「レビュー」が当てはまります。\nまた、システム管理基準では、開発プロセスの実装、統合、検証、受入テスト、本番環境への移行の各フェースでレビューを実施することとされています。このような一般的なシステム開発の知識から回答を導出することもできると思います。\n∴\nd\n＝レビュー\n\n---\n\n解説\n〔\ne\nについて〕\n〔予備調査の結果〕(3)②では「PoCでは，機械学習によって類義語DBを整備する際のサーバ処理に想定以上の時間を要していた」とあります。この記述より、サーバの処理能力が不足している現状については把握することができます。選択肢の非機能要件のうち処理能力に対応するのは「イ：性能要件」です。性能要件は、システムが満たすべき処理速度や応答時間、スループット、同時接続数、負荷耐性などに関する要件を指します。\nその他の非機能要件は以下のとおりです。\n外部インタフェース要件\n開発するシステムとそれ以外のシステムとの間で発生するデータのやり取りに関する要件\nセキュリティ要件\nシステムを機密性・完全性・可用性を確保するための認証、アクセス制御、暗号化などの要件\n保守性要件\nシステムの変更や修正を容易にし、長期間安定して運用できるようにするための要件\n∴\ne\n＝イ：性能要件\n〔\nf\nについて〕\n類義語DBの整備が不十分であることによって、発売前の新製品以外でも新CBが適切な回答をしないという問題があることが指摘されています。空欄fの前に「現行の」とあるので(1)\"現行CBの概要と課題\"を見ると、発売前の新製品以外に、次の2つの点を確認することができます。\n顧客から寄せられる問合せ数は，季節性のある製品では季節によって偏りがある\n顧客が入力した曖味な言葉に対応できない\n後者は、(3)①で「（新CBは）顧客の曖味な言葉遣いに対してある程度問合せ対応可能」との記載があり、新CBでは改善される見込みであると説明されています。一方、前者の「季節性のある製品」については特に改善策が見当たりません。\nPoCではCB回答履歴のうち6か月分を抽出対象としています。季節性のある製品の問合せ数は季節によって偏りがあるため、仮にPoCと同じ範囲で学習データを用意した場合、一部の季節性のある商品については学習データが不足してしまうことが予想されます。これでは適切な回答を期待することはできません。製品を網羅するには、少なくとも1年を通じたデータが必要であり、この点は、監査部長の「製品を網羅する観点から学習データを準備する計画になっているか確かめる」という指示とも整合しています。したがって空欄fには「季節性のある製品」が当てはまります。\n∴\nf\n＝季節性のある製品\n〔\ng\nについて〕\nプロジェクト運営委員会が、当初予定の導入効果が得られる見込みを評価するタイミングが問われています。〔予備調査の結果〕(2)において、プロジェクト運営委員会は開発計画書案を承認する予定であり、その後、「開発プロセスにおいて要件定義，追加の機械学習を含む設計，実装，テスト，受入テスト，及び本番移行を予定している」とありますので、これらのフェーズが解答の候補となります。\n本プロジェクトでは「設計後においても，本番運用向けの類義語DBの学習では，再学習を実施する」ため、最終的なパフォーマンスはプロジェクトの最終段階まで確定しません。また、表1項番3は受入テストの結果を踏まえて本番移行の判断する段階についての記述です。当然ながら導入可否の判断は本番移行前に行われなければなりませんから、判断のタイミングは受入テストの次のフェーズである「本番移行」の前しかありません。\n∴\ng\n＝本番移行\n〔\nh\nについて〕\n現行CB導入時における問題点とは、(1)⑤の記載の「現行CBを導入した際には，…新製品に関する問合せに対して適切に回答できないなど，本番移行後に混乱を招く問題点があった」というものです。この問題が発生した原因は「受入テストを顧客サービス部員が参加せずに開発担当者だけが実施した」ことですから、同じ轍を踏まないためには、新CBの受入テストはシステムオーナーである顧客サービス部の主導で実施される必要があります。したがって空欄hには「受入テスト」が当てはまります。\n∴\nh\n＝受入テスト\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/pm11.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/pm11.html",
    "title": "応用情報技術者過去問題 令和6年秋期 午後問11(システム監査)｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "M/M/1の待ち行列モデルにおいて，窓口の利用率が25%から40%に増えると，平均待ち時間は何倍になるか。\n\n---\n【選択肢】\nア: 1.25\nイ: 1.60\nウ: 2.00\nエ: 3.00",
    "back": "【正解】 ウ\n\n【解説】\nM/M/1の待ち行列モデルで平均待ち時間を計算する式は以下のとおりです。\n平均待ち時間＝\n利用率\n1－利用率\n×平均サービス時間\n利用率が25%のときの平均待ち時間は、\n0.25\n1－0.25\n×平均サービス時間＝\n1\n3\n×平均サービス時間\n利用率が40%のときの平均待ち時間は、\n0.4\n1－0.4\n×平均サービス時間＝\n2\n3\n×平均サービス時間\n2つを比べると平均待ち時間は2倍になることがわかります。したがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q1.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q1.html",
    "title": "応用情報技術者令和6年秋期問1 M/M/1の待ち行列モデル｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "キャッシュメモリのアクセス時間が主記憶のアクセス時間の 1/30 で，ヒット率が95％のとき，実効メモリアクセス時間は，主記憶のアクセス時間の約何倍になるか。\n\n---\n【選択肢】\nア: 0.03\nイ: 0.08\nウ: 0.37\nエ: 0.95",
    "back": "【正解】 イ\n\n【解説】\n実効アクセス時間を計算する公式は以下のとおりです。ヒット率とは、目的のデータがキャッシュメモリに存在している割合です。\n(キャッシュメモリのアクセス時間×ヒット率)＋主記憶のアクセス時間×(1－ヒット率)\n主記憶のアクセス時間を\"1\"とすると、キャッシュメモリのアクセス時間は\"1／30\"と表すことができます。この値を上記の公式に代入して、主記憶へのアクセス時間に対する実効アクセス時間の割合を計算をします。\n(1／30×0.95)＋1×0.05\n＝0.95／30＋0.05\n＝0.95／30＋1.5／30\n＝2.45／30\n＝0.081666…≒\n0.08\n以上より、実効メモリアクセス時間は主記憶のアクセス時間のおよそ「0.08倍」になることがわかります。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q10.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q10.html",
    "title": "応用情報技術者令和6年秋期問10 主記憶の実効アクセス時間｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "ストレージのインタフェースとして用いられるFC(ファイバチャネル)の特徴として，適切なものはどれか。\n\n---\n【選択肢】\nア: TCP/IPの上位層として作られた規格である。\nイ: 接続形態は，スイッチを用いたn対n接続に限られる。\nウ: 伝送媒体には電気ケーブル又は光ケーブルを用いることができる。\nエ: 物理層としてパラレルSCSIを用いることができる。",
    "back": "【正解】 ウ\n\n【解説】\nファイバチャネル\n(FC：Fibre Channel)は、コンピュータと周辺機器を高速かつロスレスで接続するデータ転送規格であり、主にストレージエリアネットワーク(SAN)の構築で利用されます。16Gbps、32Gbps、さらには128Gbpsの転送速度をサポートするものもあり、大量のデータを転送するストレージシステムで採用されています。ファイバチャネルは、専用のファイバチャネルスイッチやケーブルを使って構成されるネットワークを介して動作します。\nファイバチャネルは、TCP/IPと異なりFC0からFC4までの階層化されたプロトコルで動作するため、TCP/IPとの互換性はありません。\n接続形態としては、ホストとストレージを1対1で繋ぐ「ポイントツーポイント型」、1台のFCスイッチに1台以上のストレージが繋がれる「ファブリック型」、複数台のホストとストレージをループ状に繋ぐ「調停ループ型」があります。\n正しい。伝送媒体としては、光ファイバケーブル、銅線のツイストペアケーブルや同軸ケーブルが使用可能です。\nファイバチャネルはシリアル転送方式なので、使用できるのはシリアルSCSIです。パラレルSCSIは使用できません。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q11.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q11.html",
    "title": "応用情報技術者令和6年秋期問11 ファイバチャネルの説明はどれか｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "Webアプリケーションサーバの信頼性に関する記述のうち，適切なものはどれか。\n\n---\n【選択肢】\nア: コールドスタンバイ構成で稼働しているサーバに障害が発生した場合，サービスは中断しないが，トランザクションは継続できない。\nイ: コールドスタンバイ構成で稼働しているサーバに障害が発生した場合，サービスは中断するが，トランザクションは継続できる。\nウ: セッションを共有しないクラスタ構成で1台のサーバに障害が発生した場合，サービスは継続できないが，トランザクションは継続できる。\nエ: セッションを共有するクラスタ構成で1台のサーバに障害が発生した場合，サービス及びトランザクションは継続できる。",
    "back": "【正解】 エ\n\n【解説】\nコールドスタンバイ構成は、システム障害が発生した際に待機中の予備サーバに切り替えてシステムを稼働させる仕組みです。\"コールド\"の名前のとおり、予備サーバは平常時には電源OFF状態で待機しているか別の処理を行っています。障害発生時は予備サーバを起動し、業務システムを立ち上げて処理の引継ぎを行う必要があるため、サービスは一時的に中断します。また、主系と予備系で同期のメカニズムがないため、トランザクションも継続できません。\n「ア」の解説のとおりです。コールドスタンバイ構成における障害回復ではシステムの再起動が行われるため、サービスは中断し、トランザクションも継続できません。\nクラスタ構成は、複数のコンピュータを連携して1台のコンピュータのように動作させることで、高い処理性能や可用性を実現する仕組みです。1台のサーバに障害が発生した場合、フェールオーバーにより他のサーバに処理が引き継がれるため、サービスは中断することなく継続されます。ただし、セッション情報が非共有の構成ではセッションの引継ぎができないので、トランザクションも継続できません。\n正しい。セッションを共有するクラスタ構成では、セッション情報がクラスタ全体で共有されているため、1台のサーバが障害を起こしても他のサーバでサービスとトランザクションが継続されます。この方式はアプリケーションサーバの高可用性を確保するための一般的なアプローチです。\n※セッション情報は、Webアプリケーションにおいてユーザーの状態を一時的に保持するためのデータです。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q12.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q12.html",
    "title": "応用情報技術者令和6年秋期問12 Webアプリケーションサーバの信頼性｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "データアクセス方式の一つであるオブジェクトストレージに関する記述のうち，最も適切なものはどれか。\n\n---\n【選択肢】\nア: ストレージにファイルシステムを構成し，ファイル単位でデータにアクセスする。\nイ: ストレージの論理ボリュームを決まったサイズに分割し，その単位でデータにアクセスする。\nウ: データとメタデータをセットにして保存し，階層構造にすることによってデータにアクセスする。\nエ: データとメタデータをセットにして保存し，固有の識別子でデータにアクセスする。",
    "back": "【正解】 エ\n\n【解説】\nオブジェクトストレージ\nは、従来のファイルやディレクトリと言った階層構造ではなく、オブジェクトという単位でデータを格納・管理する記憶方式です。フラットな構造でスケールアウトが容易なので、非構造型データを大量に保存するデータレイクに適しています。AmazonS3がオブジェクトストレージの代表格です。\n各オブジェクトは、データ本体とともにメタデータと固有の識別子が付与された状態で格納されています。階層構造がないので、①データの複製、移動、分散がしやすい、②効率的にアクセスできる、③ディレクトリ数やデータ数の制限を受けないといった特徴があります。また、オブジェクトストレージには識別子を指定してREST API(HTTP)でアクセスします。このため、利用者は格納場所を覚えておく必要がなく、様々なプラットフォームから共通の手順でデータ操作を行うことができます。\nファイルストレージの説明です。オブジェクトストレージは、従来のファイルシステムのような階層構造を持たず、ファイル単位ではなくオブジェクト単位でデータを管理します。\nブロックストレージの説明です。オブジェクトストレージは、ストレージをブロック（固定長の区画）に分割しません。ブロック単位ではなくオブジェクト単位でデータにアクセスします。\nオブジェクトストレージは階層構造を持たず、フラットな構造で管理されています。\n正しい。オブジェクトストレージでは各オブジェクトにデータ本体とメタデータ、固有の識別子が付与され、その識別子を使ってデータにアクセスします。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q13.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q13.html",
    "title": "応用情報技術者令和6年秋期問13 オブジェクトストレージ｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "稼働率が等しい装置Xを直列や並列に組み合わせたとき，システム全体の稼働率を高い順に並べたものはどれか。ここで，装置Xの稼働率は0より大きく1未満である。\n\n---\n【選択肢】\nア: A，B，C\nイ: A，C，B\nウ: C，A，B\nエ: C，B，A",
    "back": "【正解】 イ\n\n【解説】\n各装置の稼働率は等しく、0より大きく1未満とあるので、仮に稼働率0.9を当てはめてみて、システム全体の稼働率を比較します。直列接続の稼働率を求める式はR\n2\n、並列接続の稼働率を求める式は「1－(1－R)\n2\n」です。\n【A】\n2台の並列接続なので、\n1－(1－0.9)\n2\n＝1－0.1\n2\n＝1－0.01＝\n0.99\n【B】\n稼働率0.99であるAの構成部分に、装置1台が直列接続されているので、\n0.9×0.99＝\n0.891\n【C】\n装置2台の直列接続は、0.9×0.9＝0.81\n稼働率0.81の構成部分が、並列に接続されているので、\n1－(1－0.81)\n2\n＝1－0.19\n2\n＝1－0.0361＝\n0.9639\nしたがって、稼働率の高い順に「A，C，B」となります。\n【別解】\n各システムの稼働率を式で表して、それを比較する論理的な解法です。各装置の稼働率をRとします。\nAの稼働率\n1－(1－R)\n2\n… aとする\nBの稼働率\nR×[Aのシステム構成]なので、Ra\nCの稼働率\n1－(1－R\n2\n)\n2\nそれそれの稼働率の大小を比較します。\nAとB\n0＜R＜1なので「a＞Ra」、よってA＞B\nAとC\n1から減じる部分を比較すると、0＜R＜1なので「(1－R)＜(1－R\n2\n)」、よってA＞C\nBとC\nBの稼働率 Ra を展開すると、\nR(1－(1－R)\n2\n)＝R(1－(1－2R＋R\n2\n)\n＝R(1－1＋2R－R\n2\n)＝R(2R－R\n2\n)\n＝R\n2\n(2－R)\nCの稼働率を展開すると、\n1－(1－R\n2\n)\n2\n＝1－(1－2R\n2\n＋R\n4\n)\n＝1－1＋2R\n2\n－R\n4\n＝2R\n2\n－R\n4\n＝R\n2\n(2－R\n2\n)\nR\n2\nに乗ずる部分を比較すると、0＜R＜1なので「2－R＜2－R\n2\n」、よってB＜C\n以上より、3つのシステム構成を稼働率が高い順に並べると「A，C，B」になります。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q14.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q14.html",
    "title": "応用情報技術者令和6年秋期問14 システム全体の稼働率｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "あるクライアントサーバシステムにおいて，クライアントから要求された1件の検索を処理するために，サーバで平均100万命令が実行される。1件の検索につき，ネットワーク内で転送されるデータは平均 2×10\n5\nバイトである。このサーバの性能は100MIPSであり，ネットワークの転送速度は 8×10\n7\nビット／秒である。このシステムにおいて，1秒間に処理できる検索要求は何件か。ここで，処理できる件数は，サーバとネットワークの処理能力だけで決まるものとする。また，1バイトは8ビットとする。\n\n---\n【選択肢】\nア: 50\nイ: 100\nウ: 200\nエ: 400",
    "back": "【正解】 ア\n\n【解説】\nサーバの処理能力とネットワークの処理能力に切り分けて考えます。\n【サーバの処理能力】\n1件の検索につき平均100万命令が実行され、サーバの処理能力は100MIPSである\n↓\n1MIPSは1秒間に命令を100万回を実行できる能力なので、100MIPSのサーバは1秒間に\n100件\nの検索要求を処理できます。\n【ネットワークの処理能力】\n1件の検索につき平均2×10\n5\nバイトが転送され、ネットワークの転送速度は8×10\n7\nビットである\n↓\n単位をバイトにそろえると、ネットワークの転送速度は 8×10\n7\n[ビット／秒]＝1×10\n7\n[バイト／秒]、1件当たりの転送データ量は 2×10\n5\n[バイト] です。よって、1秒間に転送できる件数は、\n1×10\n7\n2×10\n5\n＝\n1×10\n2\n2\n＝\n100\n2\n＝\n50件\n以上を整理すると、サーバでは1秒間に100件の検索要求を処理できますが、ネットワークでは1秒間に50件分のデータ転送が上限です。ネットワークの転送速度がボトルネックとなるため、このシステムが1秒間に処理できる検索要求は最大\n50件\nとなります。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q15.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q15.html",
    "title": "応用情報技術者令和6年秋期問15 トランザクション処理能力｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "タスクスケジューリング方式の説明のうち，特定のタスクがCPU資源の割当てを待ち続ける可能性が最も高いものはどれか。\n\n---\n【選択肢】\nア: 各タスクの優先度を決めて，優先度が高い順に実行し，CPU割当てまでの待ち時間の長さに応じて優先度を徐々に上げていく。\nイ: 各タスクを実行可能待ち行列に置かれた順に実行し，一定時間が経過したら実行を中断して実行可能待ち行列の最後尾に加える。\nウ: 処理予定時間が最も短いタスクから順に処理を実行する。現在実行中の処理が終了するか，又は何らかの要因によって中断されたとき，次のタスクを開始する。\nエ: タスクがシステムに到着した順に実行可能待ち行列の最後尾に加え，常に実行可能待ち行列の先頭のタスクにCPUを割り当てる。",
    "back": "【正解】 ウ\n\n【解説】\n動的優先順位方式の説明です。待ち時間が長いタスクは優先度が上昇していき、やがて最も高い優先度となるので待ち続けることはありません。\nラウンドロビン方式の説明です。実行可能待ち行列の順番に従い、すべてのタスクに一律にCPU時間を割り当てるので、特定のタスクがCPU割当てを待ち続けることはありません。\n正しい。処理時間順方式の説明です。予定処理時間の長いタスクは、より処理時間が短いタスクが存在する限り、永遠に実行されることはありません。よって、予定処理時間の長い特定のタスクが、CPU資源の割当てを待ち続ける可能性が高くなります。\n到着順方式の説明です。タスクは到着した順に処理されるため、待ち続けることはありません。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q16.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q16.html",
    "title": "応用情報技術者令和6年秋期問16 タスクスケジューリング方式｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "ページング方式の仮想記憶において，ページ置換えの発生頻度が高くなり，システムの処理能力が急激に低下することがある。このような現象を何と呼ぶか。\n\n---\n【選択肢】\nア: スラッシング\nイ: スワップアウト\nウ: フラグメンテーション\nエ: ページフォールト",
    "back": "【正解】 ア\n\n【解説】\n仮想記憶システムにおいて、主記憶の容量が十分でない状態で同時に実行されるプログラム数が増えると、ページング処理が頻繁に発生し、システムのオーバーヘッド（間接的な負荷）が増加します。これによって、アプリケーション処理に割り当てられるCPU時間が減少し、システムの処理能力が低下する現象を\nスラッシング\n(Thrashing)といいます。\n正しい。スラッシングは、ページング処理の多発により処理効率が著しく低下する現象です。\nスワップアウトは、主記憶を効率的に利用するために、主記憶上で長い間待ち状態となっているプログラムを実行状態のまま補助記憶上の領域に退避させることです。\nフラグメンテーションは、主記憶や補助記憶装置の記憶領域の中に使用されない領域の断片が多く存在した状態になる現象です。連続したメモリ領域を確保しにくくなるのでアクセス効率が低下します。\nページフォールトは、ページング方式において要求されたページが主記憶上に存在しないときに発生する割込みです。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q17.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q17.html",
    "title": "応用情報技術者令和6年秋期問17 スラッシング｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "仮想記憶方式において，セグメンテーション方式と比較した場合のページング方式の長所はどれか。\n\n---\n【選択肢】\nア: 記憶領域へのアクセス保護を論理的な単位で行うことができる。\nイ: 記憶領域をプログラム間で容易に共用することができる。\nウ: 実行時に記憶領域の大きさを動的に変えることができる。\nエ: 主記憶の外部断片化が発生しない。",
    "back": "【正解】 エ\n\n【解説】\nセグメンテーション方式とページング方式は、仮想記憶の内容をどのように区分して主記憶とやり取りするかを決める方式です。通常、仮想記憶と言えばはページング方式を使って実装されています。また、両者を組み合わせたページ化セグメンテーション方式も存在します。\nセグメンテーション方式\n補助記憶上の内容を、プログラム、サブルーチン、データなどの論理的な構造に則して区分し、可変長の区画（セグメント）単位で管理する。主記憶に読む込むことをロールイン、主記憶から退避させることをロールアウトという\nページング方式\n補助記憶上の内容を、その内容とは無関係に連続的な固定長の区画（ページ）に分割して管理する。主記憶に読む込むことをページイン、主記憶から退避させることをページアウトという\nセグメンテーション方式の長所です。ページング方式における記憶領域のアクセス保護はページ単位で行われるため、論理的な単位での保護はで来ません。\nセグメンテーション方式の特徴です。セグメンテーション方式ではデータが一区画にまとまって配置されるため、プログラム間でのデータ共用が可能です。一方、ページング方式では各ページはバラバラに配置されるので共用は不可能です。\nセグメンテーション方式の特徴です。セグメンテーション方式の区画は可変長なので、必要な大きさに動的に変更することが可能です。一方、ページング方式のページサイズはOSの管理下であるため動的に変えることはできません。\n正しい。ページング方式の長所です。可変長の区画を使用するセグメンテーション方式において、プログラムのロードと終了を繰り返すと主記憶の未使用領域が断片化し、大きな連続領域が確保できなくなることがあります。一方、固定長の区画を使用するページング方式では外部断片化は発生しません。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q18.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q18.html",
    "title": "応用情報技術者令和6年秋期問18 ページング方式の長所はどれか｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "分散開発環境において，各開発者のローカル環境に全履歴を含んだ中央リポジトリの完全な複製をもつことによって，中央リポジトリにアクセスできないときでも履歴の調査や変更の記録を可能にする，バージョン管理ツールはどれか。\n\n---\n【選択肢】\nア: Apache Subversion\nイ: CVS\nウ: Git\nエ: RCS",
    "back": "【正解】 ウ\n\n【解説】\nApache Subversionは、単一の中央リポジトリを全員が編集する集中型のバージョン管理ツールです。分散リポジトリのサポートはありません。\nCVS(Concurrent Versions System)は、ソースコードなどのテキストファイルを共有し、その変更を記録し管理するツールです。サーバ上の共有ファイルを全員が編集する集中型で、分散リポジトリのサポートはありません。\n正しい。\nGit\n(ギット)は、各自が完全なリポジトリを保有できる分散型のバージョン管理ツールです。元々はLinuxのソースコード管理に用いるために開発されたツールですが、現在では多くのプロジェクトのソースコード管理に利用されています。\nGitでは、リポジトリの完全なコピーをローカル環境に保持することができるので、中央リポジトリにアクセスできないときでも、変更履歴を調査したり変更を記録したりすることなどが可能です。\nRCS(Revision Control System)は、ファイル単位で変更を管理する初期のバージョン管理システムです。複数人での作業やプロジェクトのサポートがありません。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q19.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q19.html",
    "title": "応用情報技術者令和6年秋期問19 バージョン管理ツール｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "AIにおける教師あり学習での交差検証に関する記述はどれか。\n\n---\n【選択肢】\nア: 過学習を防ぐために，回帰モデルに複雑さを表すペナルティ項を加え，訓練データへ過剰に適合しないようにモデルを調整する。\nイ: 学習の精度を高めるために，複数の異なるアルゴリズムのモデルで学習し，学習の結果は組み合わせて評価する。\nウ: 学習モデルの汎化性能を高めるために，単一のモデルで関連する複数の課題を学習することによって，課題間に共通する要因を獲得する。\nエ: 学習モデルの汎化性能を評価するために，データを複数のグループに分割し，一部を学習に残りを評価に使い，順にグループを入れ替えて学習と評価を繰り返す。",
    "back": "【正解】 エ\n\n【解説】\n交差検証\nは、機械学習モデルを評価するための手法で、1つのデータセットを学習データとテストデータに複数回分割し、それぞれで学習と評価を行うものです。各検証で得られた評価指標を平均化することで、全体としてのモデルの性能を評価します。データセットの件数が少ない場合でも信頼性の高い評価が可能となっています。\n正則化の説明です\nアンサンブル学習の説明です。\nマルチタスク学習の説明です。\n正しい。交差検証の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q2.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q2.html",
    "title": "応用情報技術者令和6年秋期問2 教師あり学習での交差検証｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "手続型言語のコンパイラがコード生成までに行う処理のうち，最後に行う処理はどれか。\n\n---\n【選択肢】\nア: 意味解析\nイ: 構文解析\nウ: 最適化\nエ: 字句解析",
    "back": "【正解】 ウ\n\n【解説】\nコンパイラ\nは、高水準語で記述されたソースコードをコンピュータが理解できる機械語に一括変換する（＝コンパイルする）ソフトウェアです。\nコンパイルには、①字句解析 → ②構文解析 → ③意味解析 → ④最適化 → ⑤コード生成 の5つの処理段階があり、この順番で実行されていきます。\n字句解析\nプログラムを表現する文字列を、意味のある最小の構成要素（トークン）に分解する\nint a = 5 + 3;\n↓\nint(型)、a(変数)、=(代入演算子)、5(整数)、+(加算演算子)、3(整数)、;(セミコロン)\n構文解析\n句解析で得られたトークンをもとに、言語の文法に基づいてプログラムを解析し、文法誤りがないかチェックする。構文木を使用してプログラムの構造を表現する\n意味解析\nプログラムが意味的に正しいかを検証する。変数の宣言と使用とを対応付けたり、演算におけるデータ型の整合性を確認する\n最適化\nコードの実行効率を向上させるために、不要な演算の省略、ループの展開、関数のインライン展開、レジスタ割付けなどの変換を行う\nint a = 2 * 5;\n↓\nint a = 10;\nコード生成\n構文木を元にデータの記憶位置、レジスタ割当てを確定し、コンピュータが実行可能な機械語やアセンブリ言語、中間コードとして出力する\n4つのうち、コンパイラがコードを生成する前に最後に行う処理は「最適化」です。したがって「ウ」が正解です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q20.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q20.html",
    "title": "応用情報技術者令和6年秋期問20 コンパイラが最後に行う処理｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "図はスイッチA及びBの状態によって，LEDが点灯又は消灯する回路である。スイッチAがオンの状態をA＝1，オフの状態をA＝0とし，スイッチBも同様にオンの状態をB＝1，オフの状態をB＝0とする。また，LEDが点灯する状態をY＝1，消灯する状態をY＝0とする。このとき，図の回路を動作させたときのタイミングチャートとして，適切なものはどれか。\n\n---\n【選択肢】\nア: \nイ: \nウ: \nエ: ",
    "back": "【正解】 ウ\n\n【解説】\n図の回路は、スイッチAとスイッチBの両方がONのときだけ通電し、LEDが点灯します。この回路の動作は、A＝B＝1である場合のみY＝1、それ以外の場合にはY＝0となっているチャートに対応します。論理回路でいえば\nY = A AND B\nに相当します。\nYが1となるのは、AまたはBの少なくとも一方が1のときです。どちらか一方のスイッチONで点灯する動作を表すので誤りです。論理回路でいえば\nY = A OR B\nに相当します。\nYが1となるのは、AとBの両方が0のときだけです。両方のスイッチOFFで点灯する動作を表すので誤りです。論理回路でいえば\nY = A NOR B\nに相当します。\n正しい。Yが1となるのは、AとBの両方が1のときだけです。両方のスイッチONで点灯する動作を表すので、図の回路に対応します。\nYが1となるのは、AとBの両方が1のとき以外です。両方がスイッチONのとき以外で点灯する動作を表すので誤りです。論理回路でいえば\nY = A NAND B\nに相当します。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q21.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q21.html",
    "title": "応用情報技術者令和6年秋期問21 タイミングチャート｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "SoCの説明として，適切なものはどれか。\n\n---\n【選択肢】\nア: システムLSIに内蔵されたソフトウェア\nイ: 複数のMCUを搭載したボード\nウ: 複数のチップで構成していたコンピュータシステムを，一つのチップで実現したLSI\nエ: 複数のチップを単一のパッケージに封入してシステム化したデバイス",
    "back": "【正解】 ウ\n\n【解説】\nSoC\n(System on a Chip)は、CPUコア、GPUコア、DSP、メモリ、タイマー、通信モジュールなどの複数の構成要素を1つのチップ上に集約したシステムLSI(大規模集積回路)です。\n従来のコンピュータシステムでは、これらの構成要素は個別のチップで構成されていましたが、SoCでは1つの半導体チップに必要な機能をまとめることによって、コンパクト化、高速化、低消費電力化、コスト削減を可能としています。SoCがワンチップであるのに対して、複数のLSI(チップ)を1つのパッケージまとめることでシステムLSIを実現する方式をSiP(System in a Package)と言います。iPhoneに登載されているAppleのAシリーズなどがSoCの代表例です。\nファームウェアの説明です。SoCは、ソフトウェアではなくハードウェアであるチップ自体を示す言葉です。\nマイコンボードに関する記述です。\n正しい。SoCの説明です。\nSiP(System in a Package)の説明です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q22.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q22.html",
    "title": "応用情報技術者令和6年秋期問22 SoCの説明として適切なもの｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "アクチュエーターの説明として，適切なものはどれか。\n\n---\n【選択肢】\nア: 与えられた目標量と，センサーから得られた制御量を比較し，制御量を目標量に一致させるように操作量を出力する。\nイ: 位置，角度，速度，加速度，力，温度などを検出し，電気的な情報に変換する。\nウ: エネルギー源からのパワーを，回転，直進などの動きに変換する。\nエ: マイクロフォン，センサーなどが出力する微小な電気信号を増幅する。",
    "back": "【正解】 ウ\n\n【解説】\nアクチュエーター\n(Actuator)は、入力された電気信号を力学的な運動に変換する駆動機構で、機械や電気回路の構成要素です。\n制御システムにおいては、コントローラーから制御信号を受けとり、制御対象に与える操作量を変化させる部位のことをいいます。具体的には、温度管理システムにおけるファン、自動ドアシステムのドア、工場におけるロボットアームなど、物理的なアクションを起こす部分がアクチュエーターに該当します。\nコントローラーの説明です。\nセンサーの説明です。\n正しい。アクチュエーターの説明です。\nアンプの説明です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q23.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q23.html",
    "title": "応用情報技術者令和6年秋期問23 アクチュエーターの説明はどれか｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "マイクロプロセッサの耐タンパ性を向上させる手法として，適切なものはどれか。\n\n---\n【選択肢】\nア: ESD(Electrostatic Discharge)に対する耐性を強化する。\nイ: チップ検査終了後に検査用パッドを残しておく。\nウ: チップ内部を物理的に解析しようとすると，内部回路が破壊されるようにする。\nエ: 内部メモリを物理アドレスに合わせて整然と配置する。",
    "back": "【正解】 ウ\n\n【解説】\n耐タンパ性\nは、ハードウェアやソフトウェアが外部からの改ざんや解読、データの不正取得等の行為にどの程度耐えられるかを示すセキュリティ指標です。ICカードやセキュリティチップ、スマートキーや銀行ATMなど、特に機密データを扱うシステムやデバイスでは重要な要素となります。タンパ（tamper）は「変更する」「改ざんする」「弄る」などを意味します。\nESDとは静電気放電のことです。静電気によりにプロセッサが破壊されるのを防ぐための対策であり、耐タンパ性とは直接関係ありません。\nチップ検査用のパッドが残っていると、攻撃者がそれを利用して内部にアクセスしやすくなるため、耐タンパ性は低下します。\n正しい。物理的な解析に対して内部回路が破壊されるようにすることは、耐タンパ性を高めるための典型的な手法のひとつです。\n整然と配置されていると、解析者にメモリ構造や内部プログラムの動作を解析を容易に把握させてしまうおそれがあるため、耐タンパ性は低下します。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q24.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q24.html",
    "title": "応用情報技術者令和6年秋期問24 マイクロプロセッサの耐タンパ性｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "Webページの構成要素のうち，図のような固定の表示領域内でマウス操作やタッチ操作を行うことによってスクロールし，複数の画像などが横方向に順次表示されるものを何というか。\n\n---\n【選択肢】\nア: アコーディオン\nイ: カルーセル\nウ: タブ\nエ: モーダルウィンドウ",
    "back": "【正解】 イ\n\n【解説】\nアコーディオンは、見出し部分をクリックやタップすることで、コンテンツを展開・折りたたみ可能なUI要素です。主に縦に並べられた多くの情報を省スペースで整理するために使用されます。\n正しい。\nカルーセル\nは、複数の画像やコンテンツを固定領域内に配置し、利用者がスワイプや左右の矢印、点（インジケーター）で横スクロールすることで一連のコンテンツを順次表示するUI要素です。画像ギャラリーやスライドショーなど、限られた領域で多くのコンテンツを見せたい場合に使用されます。\nタブは、上部の見出し部分をクリックすることで、表示するコンテンツを切り替えるUI要素です。本の索引などに使われる紙タブを模したものです。\nモーダルウィンドウは、Webページ内の別のコンテンツや特定のアクションを強調するために、画面上に浮かぶように表示される一時的なウィンドウです。表示されている時は、背景にあるコンテンツの操作が禁止されます。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q25.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q25.html",
    "title": "応用情報技術者令和6年秋期問25 Webページの構成要素｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "800×600ピクセル，24ビットフルカラーで30フレーム／秒の動画像の配信に最小限必要な帯域幅はおよそ幾らか。ここで，通信時にデータ圧縮は行わないものとする。\n\n---\n【選択肢】\nア: 350kビット／秒\nイ: 3.5Mビット／秒\nウ: 35Mビット／秒\nエ: 350Mビット／秒",
    "back": "【正解】 エ\n\n【解説】\n動画像配信における1秒当たりのデータ量を算出します。\n1フレームの画像に含まれるピクセル数は、縦横のピクセル数の積で、\n800×600＝480,000ピクセル\nそれぞれのピクセルが24ビットの色情報を持つので、1フレーム当たりのデータ量は、\n480,000ピクセル×24ビット＝11,520,000ビット＝11.52Mビット\n1秒間の動画像は30フレームで構成されるので、1秒間のデータ量は、\n11.52Mビット×30フレーム＝345.6Mビット\n求めたデータ量と選択肢の数値とを比較すると「35M＜\n345.6M\n＜350M」なので、動画像の配信に必要な帯域幅は「350Mビット／秒」となります。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q26.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q26.html",
    "title": "応用情報技術者令和6年秋期問26 最小限必要な帯域幅はおよそ幾らか｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "2相コミットで分散トランザクションの原子性を保証する場合，ネットワーク障害の発生によって参加者のトランザクションが，コミットすべきかロールバックすべきかを判断できなくなることがある。このような状況を発生させるネットワーク障害に関する説明として，適切なものはどれか。\n\n---\n【選択肢】\nア: 調停者のトランザクションが，コミット又はロールバック可否の問合せを参加者に送る直前に障害になった。\nイ: 調停者のトランザクションが，コミット又はロールバックの決定を参加者に送る直前に障害になった。\nウ: 調停者のトランザクションに，コミット又はロールバック可否の応答を参加者が返す直前に障害になった。\nエ: 調停者のトランザクションに，コミット又はロールバックの完了を参加者が返す直前に障害になった。",
    "back": "【正解】 イ\n\n【解説】\n2相コミット\nは、分散データベース環境でのトランザクションの原子性・一貫性を確保するために、トランザクションのコミットについて、①各サイトに対して更新可能かを問い合わせるフェーズ（第1相）と、②全サイトの合意が得られた後に変更を確定するフェーズ（第2相）の2つの段階に分けて実行する手法です。本問でいえばコミット／ロールバックについて「可否の問合せを参加者に送る」のが第1相、「決定を参加者に送る」のが第2層の動作に相当します。\n2相コミットの流れは下図のとおりです。図中の主サイトは「調停者」、従サイトは「参加者」を表します。\n2相コミットでは、調停者にコミットの可否を応答した参加者は、いつでもコミットまたはロールバックが可能なセキュア状態（中間状態）に遷移します。この際、参加者は調停者からの指示を受け取るまで待ち状態となります。そのため、調停者が各サブトランザクションからの応答を受けとった後、行うべきアクションを各サイトに通知する前（第2相の開始時）に障害が発生すると、待ち状態の参加者はコミットすべきかロールバックすべきかを判断できない不定状態に陥ります。\n調停者またはネットワークが第1相の開始時に障害でダウンした場合、各参加者はタイムアウトとみなしてロールバックを行います。\n正しい。セキュア状態になった後に調停者からの通知がない場合、参加者はコミット／ロールバックの判断をすることができません。他のサイトでは調停者からコミット／ロールバック通知を受けて、正常に処理している可能性があり、原子性・一貫性の観点から安易にどちらの処理も行うことができないためです。\n一定時間内に各参加者からの可否の応答がない場合、調停者はタイムアウトとみなしてトランザクションを中止し、各参加者にロールバックを命じます。応答をした参加者（セキュア状態）は調停者からロールバック命令を受けて、障害となった参加者（セキュア状態ではない）はタイムアウトにより、いずれもロークバックされるため、参加者が判断に困ることはありません。\n本肢の障害が発生するのは、各参加者が調停者からコミット／ロールバックの指示を受け取り、その処理を完了した後です。すでにどちらのアクションを行うべきか決定しているため、判断に困ることはありません。復旧後に指示どおり再実行すれば済みます。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q27.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q27.html",
    "title": "応用情報技術者令和6年秋期問27 2相コミット中の障害発生｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "化粧品の製造を行っているA社では，販売代理店を通じて商品販売を行っている。今後の販売戦略に活用するために，次の三つの表を設計した。これらの表を用いるだけでは\n得ることのできない情報\nはどれか。\n\n---\n【選択肢】\nア: 商品ごとの販売数量の日別差異\nイ: 性別ごとの売れ筋商品\nウ: 販売代理店ごとの購入者数の日別差異\nエ: 販売代理店ごとの売れ筋商品",
    "back": "【正解】 ウ\n\n【解説】\n\"販売代理店別日別販売\"表の項目として、商品ID、販売数量、日付があります。この3つを集計することで得ることができます。\n\"商品購入\"表には顧客ID列があります。顧客ID列をキーとして\"商品購入\"表と\"顧客\"表を結合し、性別と商品IDでグループ化することで得ることができます。\n正しい。この3つの表からは、ある日における販売代理店ごとの顧客数を得ることはできません。この情報を得るには、日付の項目を\"販売代理店別日別販売\"表ではなく、\"商品購入\"表にもたせる必要があります。\"商品購入\"表に日付があれば、販売代理店ごとの日別販売数は\"商品購入\"表から導出することができます。\n\"販売代理店別日別販売\"表の項目として、商品IDと販売数量があります。\"販売代理店\"表をこの2つの列でグループ化することで得ることができます。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q28.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q28.html",
    "title": "応用情報技術者令和6年秋期問28 表から得ることができない情報｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "次のオブジェクト図(インスタンスを表す図)に対応する概念データモデルはどれか。ここで，オブジェクト図及び概念データモデルの表記にはUMLを用いる。\n\n---\n【選択肢】\nア: \nイ: \nウ: \nエ: ",
    "back": "【正解】 イ\n\n【解説】\nオブジェクト図\nは、ある特定の時点でのオブジェクトのインスタンス間の静的な構造を記述する図です。クラス図がクラス間の静的な関連を定義するのに対し、オブジェクト図はそのクラス図から具体的なインスタンス（実際のオブジェクト）がどのように生成され、関連をもつのかを示します。\n設問ではオブジェクト図とクラス図の対応が問われています。クラス図の多重度は、あるクラスのインスタンスに対し他のクラスのインスタンスがいくつ関連するかを表すので、インスタンス同士の数の関係に着目します。\nまず\"地域\"と\"仕入先\"の関係を見ると、下図のように1つの\"地域\"インスタンスに1つ以上の\"仕入先\"インスタンスが関連付けられています。したがって、\"地域\"クラスと\"仕入先\"クラスの多重度は「1対多（\n1　*\n）」です。1つの\"地域\"の対応する\"仕入先\"は1つ以上存在し、1つの\"仕入先\"に対応する\"地域\"は常に1つということです。\n次に\"仕入先\"と\"仕入\"の関係を見ると、これも上記と同じく1つの\"仕入先\"インスタンスに1つ以上の\"仕入\"インスタンスが関連付けられています。したがって、\"仕入先\"クラスと\"仕入\"クラスの多重度は「1対多（\n1　*\n）」です。\n最後に\"仕入\"と\"部品\"の関係を見ると、1つの\"部品\"インスタンスが1つ以上の\"仕入\"インスタンスに関連付けられています。よって、\"仕入\"クラスと\"部品\"クラスと多重度は「多対1（\n*　1\n）」になります。\nこの3つの多重度の関係を適切に表現している概念データモデルは「イ」です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q29.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q29.html",
    "title": "応用情報技術者令和6年秋期問29 オブジェクト図｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  },
  {
    "front": "式A＋B×Cの逆ポーランド表記法による表現として，適切なものはどれか。\n\n---\n【選択肢】\nア: ＋×CBA\nイ: ×＋ABC\nウ: ABC×＋\nエ: CBA＋×",
    "back": "【正解】 ウ\n\n【解説】\n通常の式を、\n逆ポーランド表記法\n(後置表記法)で表現するための基本は、「A＋B」を「AB＋」で表す\nことです。1回変換した部分は1つの項とみなすことに注意して、普通に計算式を解くのと同じ順番で変換で行っていくことで逆ポーランド表記法の式になります。なお、変換を行う優先順位は通常の計算式と同様に、括弧付き\"()\"→積商算(×÷)→和差算(＋－) の順番です。\n最初に「B×C」の部分を変換します。\nA＋\nB\n×\nC\n→ A＋BC×\n次に「BC×」を1つの項とみなしてAとの＋演算部分を変換します。\nA\n＋\nBC×\n→ ABC×＋\nこれで式A＋B×Cの逆ポーランド表記法への変換が完了です。よって正解は「ウ」です。\n\n(出典: https://www.ap-siken.com/kakomon/06_aki/q3.html)",
    "source": "https://www.ap-siken.com/kakomon/06_aki/q3.html",
    "title": "応用情報技術者令和6年秋期問3 逆ポーランド表記法｜応用情報技術者試験.com",
    "period": "令和6年秋期"
  }
]